{
    "data": [
        {
            "text": [
                "Customer service sucks",
                "My screen went out",
                "I purchased this barely over 90 days ago",
                "When contacted customer service I was told “happy to help but can’t since it’s past 90 days” it’s practically new &amp; now I’m stuck with a POS computer",
                "Worst customer service ever."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "One Star",
                "Very slow..",
                "not worth it"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It said SSD drive in the description",
                "It wasn't ...",
                "It said SSD drive in the description",
                "It wasn't an SSD drive",
                "But i had one in my old computer so whatever",
                "But still."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "perfect",
                "I was a little worried with some of the reviews but my 13 inch MBP looks and acts brand new",
                "thank you"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good product",
                "It was for my son and he loves it",
                "Corners got a little scuffed in transit."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "works great",
                "I dislike that arrived with some dents and i believed could be better wrapped to avoid future dents on delivery..my wife loved it and works great at least for now"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "As expected",
                "The computer is a little slow and I had to replace the charging cord but for the value it’s good."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent",
                "It looks new, has no scratches or anything, and very little wear",
                "I think it's a good purchase"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great deal.",
                "Excellent condition, works flawlessly",
                "Plan to purchase another one to support a church project."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Do Not Buy One Of These Laptops!",
                "Save your money and buy a new one",
                "The one we bought worked for 2 hours then just stopped",
                "Do not buy one of these computers, was a bit scratched on the bottom, no big deal, but stopped working on Christmas right after it came out of the box",
                "JUNK."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good Buy",
                "I absolutely love my computer",
                "I had to update and reset it when I got I to update to the newest IOS but no issues since I’ve received it! It had some dents but is it a used computer plus they sent it with a computer cover",
                "Good buy!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not worth it",
                "Luckily I got my refund, but when I got the laptop I was upset to see it was a 2012",
                "Also when picking up heard something very loose in the casing of it",
                "I would look somewhere else."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop",
                "I have never owned a Mac before , and this is a great computer",
                "Very easy to use and intuitive."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Fairly good, but still has an issue",
                "Besides the actual screen under the glass being a little broken and the pixels being messed up as a result, it works great",
                "I’m rating four stars because with a little pressure in the right spot it temporarily fixes the issue"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Apple products are great",
                "Great computer,easy to use and small"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "I was pleasantly surprised works like a charm looked really good to",
                "I was pleasantly surprised works like a charm looked really good to"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Why did i even buy this, i have a phone",
                "This product was terrible, i bought it two years ago and to this day it still can’t even update chrome, update its own software, and as well the battery life runs quicker than usian bolt",
                "Would not recommend for the price that it’s asking."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Poor Quality Checks",
                "Product arrived with no instructions no paperwork no serial number and keyboard was nonfunctioning, Cant recommend this vendor"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Works great",
                "Computer came in like new condition",
                "Works perfectly."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good buy!",
                "A few Little scratches on the outside, but I’m using for music use so it function very well and I haven’t had any issues with it thus far!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Battery needed replacement",
                "The battery life was much less than the description that accompanied this product."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Year Mac was made should be part of description",
                "My complaint is mostly with the reseller",
                "I'm new to a Mac so I realize I have a learning curve on how to use this, but my laptop seems to be extremely slow",
                "I went to an Apple Store today to have them take a look",
                "First off, they were surprised that the year of my refurbished Mac was not in the description",
                "Mine is a 2012 and if it was 2011 or later, it would be considered \"vintage\" and they would no longer support it",
                "As it is, I only have about 5 years on this and Apple will no longer support this model",
                "I needed a software update so they wiped it clean and put the latest \"non-beta\" version but I'm having trouble now reinstalling my programs",
                "I am so frustrated",
                "I'm past the return or support date from the reseller",
                "I don't think I would have even purchased this if I had known that it was already 5 years old."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I was expecting something better",
                "Batterie's life is not the best and some cosmetic stains in the screen, I know, it's a used computer"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Ridiculous",
                "After a year, it’s not turning on and it’s difficult to get in contact with the seller"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Happy with purchase!",
                "I ordered this for my granddaughter as a Christmas present",
                "She loves mine so I thought I would get her one, especially with online learning being so prominent."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Buyer Beware",
                "The laptop is not what was expected at all",
                "It is a very old (maybe 2011) outmoded laptop and didn’t even include the charger cord (and the laptop model is so old that it requires a very different charger than even the 2015 models)."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Damage garbage",
                "This should have been a birthday gift for my daughter but it turned out to be a bad surprise",
                "This laptop came with scratches and a lot of dents",
                "After seeing all of this the it made me change my mind so Iam retuning it right back."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "No customer service!",
                "Sent numerous emails and they don’t respond!!! Mine wasn’t as beat up",
                "Just scratches and worked fine until after the second charge",
                "It doesn’t want to charge anymore!! Don’t buy this please",
                "Save yourself the money and the hassle"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Wish I never bought",
                "The slowest thing I’ve ever had! It won’t pull up apps without a 10 minute wait and then kicks you out",
                "Total waste of my money."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very slow",
                "This was to be a replacement for my stolen MacBook Pro",
                "It will do until I can get something else",
                "It is very slow and does not want to update",
                "The trackpad also does not work well",
                "Had to go buy a mouse instead."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great loptop",
                "This loptop is great so far",
                "It’s easy to use",
                "I am so happy I bought it."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very nice love this macbook",
                "Love it so much"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Better than I expected",
                "Received it earlier than expected and it was in very good condition, looks pretty much new",
                "It is a bit slow once you start it but will be upgrading it so that's not a problem",
                "All in all very happy with my purchase as of now."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I like it",
                "So far it working properly, I’m not having any troubles."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Likeable pc.",
                "Order received safely."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "🙀🤥MACBook Pro 🧐🤦🏽‍♂️",
                "It looks like my teenage daughter had it for 5+ years and for $700 (is it April 1?🧐😤)"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good stuff",
                "I am pleased I upgraded it with an ssd and 16 go ram It is now a great machine for less than a new comparable one"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Apple not the best",
                "Got it for my daughter going to med school, didn't work was gone to see grandson",
                "Didn't have time 30 days even though I called them, still have yet to see if I can get it repair"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great deal on a Mac!",
                "Bought as a mobile recording solution, works like it is supposed to."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Keypad and touchscreen",
                "I thought it was keypad and touchscreenThe court continue to get hard when you plug it up and hasn’t run the laptop gets real hot and start acting up without working functions do not work right"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Don’t waste your money!",
                "Product runs really slow and takes forever for anything to load! For the price of it and the insurance might might as well wait and get a new computer! Don’t waste your money!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Do not buy used.",
                "Would not come on, received no instruction manual or software disc."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent",
                "Excellent"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "LOVE IT",
                "Love this laptop",
                "Came quickly and is just as advertised",
                "Amazing price."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Product was older than made believe",
                "The computer was equally old as the one I wanted to replace",
                "Too expensive for the age and an unacceptable offer"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "LEMON!",
                "Worked for 5 weeks and then stopped! Wish I had bought a different one!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great deal",
                "Great purchase for a great price, couldn’t be happier."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Bad mac book!",
                "Macbook is taking forever to even set up and once i did get it set up it is taking forever to process anythig there is somethi g wrong with it."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Condition",
                "It’s not clean."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Need a replacement but seller never answered",
                "Product not good they sent a broken loptop sometimes turned on sometimes not can't go to the internet power button not working"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Worth the money for a MacBook",
                "Good value....",
                "dislike the marks and its processor was a bit slow."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good purchase",
                "There were a few scratches on the exterior, and also a few occasional weird tech issues, however I think it’s still a pretty good purchase."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Purchased in July",
                "Failed January with white screen about six months later.",
                "Lasted 6 approximately six months then failed with white screen",
                "Sent to shop for repairs if cost effective or will trash",
                "Would not buy this type of product again."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I recommend it",
                "It is great I love it you should totally buy this but the only thing that is bad is that it is kinda slow but not really everything else is amazing and especially the battery life it last for me for like 4 days"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Customer service isn't very good",
                "Be aware that this company won't try to help with a computer that isn't working and wasn't working correctly from the first time we turned it on",
                "It was a Christmas gift an wasn't used in the first 90 days."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Decent and easy to use.",
                "We bought two and this one was way better than the other",
                "If functions and does the things we need it to do for my husbands schooling."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Product met my expectations.",
                "Product met my expectations",
                "I am thinking about getting a second one."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "IIIITT IISS TOOOOO SSSSLLLLOOOOWWWWWW!!!!!!",
                "this computer takes minutes to open apps and programs",
                "It is so slow that it leads to constant frustration",
                "I am assuming the problem is not just mine but the product itself."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I’d buy it again",
                "I’d buy again in a heartbeat"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Hard drive died after 2 months",
                "I liked this computer",
                "It wasn’t fast, but I was able to do what I needed to do at a good price",
                "Sadly, the hard drive died on it within 2 months of owning it."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "The hard body",
                "After two months the hard body needed to keep the inside protected is coming a loose",
                "REALLY!!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "this is a hoax",
                "I bought this Computer new and what I received is a used MacBook , it's scratched , the battery only last 45 min , the volume is damage ",
                "this is a hoax"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Pretty good for the price",
                "I was really nervous when I first purchased it after reading all the reviews but it came in great condition and actually works perfectly",
                "Fingers crossed that it continues to work well."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Because it was in Niu from 1 to 5 at three",
                "I like the laptop only use it once but the only thing I did not like that it wasn’t brand new from the Apple box seemed like it was used before I thought I was getting something new"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "I like everything."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent product and price",
                "Like new with the exception of a defective charger",
                "Excellent customer service as a replacement charger was expedited to me promptly",
                "No complaints regarding the product or the seller."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Cheated customer",
                "The system is completely malfunctioning and so is the keyboard",
                "We just bought this 9 months ago",
                "It turns out that it was a 2012 unit",
                "We really want it replaced because the unit is completely defective after only 9 months of use",
                "Apple can’t fix it",
                "Pls replace!!!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "The price",
                "I like the price but it’s a little small"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Very poor quality and misleading",
                "This product had to be returned",
                "It was a Mac book from the beginning of time, wrapped in tape and you could still see the big dents and dings in it",
                "I couldn’t even get it to cut on."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great value",
                "Runs like a champ and is much cheaper that buying a new one."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Sold inoperable computer.",
                "When we unboxed this item it did not operate",
                "To fix it costs $300",
                "I do not recommend this seller."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "eh",
                "Spent 70 on a new charger since the one I received didn’t work",
                "Seller never responded to my request for an exchange",
                "Would not recommend."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Excellent product"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Too slow",
                "No good"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "bad purchase",
                "I have to return this item because I could never log into the computer, the computer still being logged in with the Apple ID of the previous owner (I think)....",
                "Buying this was a waste of time."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "That yes a return was appoved, at my cost to return an item that does not work.",
                "This Computer did not work!!! After a few minutes it would glitch and scroll, scroll out of control",
                "Does not work for a High School Student that is Computer literate."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great product",
                "Was a gift"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good value for the money.",
                "Late 2012 model MB Pro - exactly as expected",
                "In good shape with a sling ding - hardly noticeable",
                "Upgraded RAM from 4 to 16 gigs and this works extremely well",
                "Came with Lion but upgraded it to Yosemite",
                "Would definitely do it again",
                "Next project is to update the SSD to a 256gig"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent condition",
                "Product arrived on time and was in excellent condition, like brand new"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good condition.",
                "I am new in the Mac world so this is a good starting point for some one like me."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "I love it",
                "It came like new",
                "Oh!!! I love it",
                "It came like new."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "frumpy charger",
                "The laptop itself is great",
                "Looks and works like new",
                "However, I have had it for less than 24 hours and the charger it came with has already broken, so I now have to replace it",
                "be wary."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Awesome deal!",
                "Awesome price for a great laptop",
                "In great shape",
                "Only one tiny dent",
                "Barely noticeable."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Wear and tear/crakes",
                "Received with some cracks and wear and tear"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Cheap Power Supply",
                "The provided power supply is a cheap Chinese make that only works 20% of the time"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Worthless",
                "Do not buy!!",
                "DO NOT BUY FROM THIS COMPANY! Came with a disgusting cord that didn’t even fit this computer",
                "Once charged with a different cord and turned on, the screen image was so bad you couldn’t even read words to be able to complete set up."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It will take some time some time to figure this one out",
                "Very slow start up if you've never use it really hard to figure out trying to get to mail good luck"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "AMAZING COMPUTER GREAT PRICE AWESOME AS @#$%",
                "memory great graphics great everything AMAZING AS @#$%"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Horrible",
                "The i and o didn’t work and none of the numbers worked",
                "Absolutely dissatisfied",
                "Can’t believe it made it past inspection! Still waiting on my refund...."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Quick &amp; Easy set up",
                "Fast",
                "Best deal online!",
                "What a gift! This was a gift for myself since I am finishing my degree! Bonus: they gave me a cover in my favorite color",
                "Can’t thank you guys enough",
                "Happy New Year!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Do not buy renewed products, they break down quick.",
                "Horrible, Computer stopped working after 3 months and had to spend $450 to fix",
                "Do not buy renewed from Amazon."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I needed this for my studies and now I’m stuck without a working device",
                "This laptop is the worse buy",
                "I hope some how I can get a refund",
                "The laptop keeps shutting down everytime I try to use it."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "👎🏽",
                "Cd dvd doesn’t work 👎🏽"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Add a new HD and RAM and it Smoking Fast",
                "Bought these for my kiddos for school",
                "3 MacBook pro-updated with new Hard Drive and RAM on the cheap",
                "All work great and Run Catalina",
                "Happy Kiddos."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Hard Pass",
                "So slow turning it on lasts about two cups of coffee",
                "Once running there are seconds between selecting something and it responding to your input."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Don’t buy",
                "Don’t buy"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Poor experience.",
                "The computer would not boot up and work properly",
                "So I sent it back",
                "I also had to pay the shipping and handling on the return",
                "I will not but another product from this company"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        }
    ]
}