{
    "data": [
        {
            "text": [
                "Didn't work right out of the box...",
                "Buy from Apple",
                "Froze when trying to transfer data, now is in kernel panic."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very Good Product",
                "Expensive but worth it.",
                "This is the best MBP yet! Very Powerful Product and I think it is faster than what they are advertising",
                "I can't make this 8 core crash yet? Well worth the 2500.00 I paid for this product and I have no regrets buying it so far",
                "I recommend the new i-9 processor to anyone",
                "8 core Laptop",
                "can't wait until the new Laptop stuff rivals the new cheesgrator Mac",
                "I can't imagine a 28 core Laptop but it will happen and soon",
                "The speakers are unrivaled for a new laptop",
                "Everything is great",
                "Scalability is also great with this product",
                "You buy it with 16 GB of ram but you can upgrade it to 64 GB DDR4 Ram, and you can also put up to an 8 TB NVM Express SSD in the mix",
                "Too much excitement for me to list",
                "THIS IS PROCESSING POWER AT IT's BEST!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Do not believe you are getting a new state of the art computer.",
                "Setup has not been the easiest",
                "No screen available from the old laptop",
                "I believed I was getting a new state of the art Macbook Pro but actually received a 2019 version and probably all the problems associated with that model",
                "Its like buying a 2020 automobile and finding out it is actually a 2019",
                "Not exactly an honest approach from my particular point of view",
                "I paid for 2020 but got something less than that..."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good option",
                "New and running like a champ",
                "Battery life is ok when not using integrated AMD graphics but once you do 5 hrs is exactly what you can expect/ 8-10 on intel graphics",
                "Still fantastic setup, would be great if Apple allows for under-clocking to fix the issue with system getting too hot under loads."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Buyer beware",
                "Be careful when you purchase this product.Word or office products do not come with this product at this price and add 249.00 to the purchase price"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Get it if you want/need bootcamp otherwise wait.",
                "Pros: Decent amount of power for gaming in bootcamp",
                "Overall great laptop, love the new/old keyboard",
                "Touch ID is great (now if I could only have that on my iPhone...)",
                "The Touch Bar looks great but I rarely use it, it would be better if it had more powerful customization",
                "I love the huge trackpad, hands down the best trackpad on any laptop",
                "Screen looks gorgeous, excellent color, very bright and good contrast",
                "Cons: The screen is a fingerprint magnet and super delicate, and because of the tight tolerances the keyboard and trackpad always touch the screen and any oil from my fingers gets transferred to the screen making it impossible to keep it clean",
                "The fans run constantly on any serious load like gaming or video editing",
                "And of course the standard Apple cons of: fixed battery/RAM/SSD which suck but at the end of the day I'm still Apple's B*****h."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Brilliant Machine",
                "Needless to say it's another brilliantly designed machine from Apple",
                "Things that stood out for me particularly in this model: 1",
                "Its body dimensions are almost the same as of previous 15\" model",
                "With thinner bezels, its able to pack a 16\" screen",
                "2",
                "Sound from the in-built speakers is a major step up from the previous generation",
                "It is incredible how it cancels out vibrations from the woofers, giving you rich deep output, but surprisingly no vibrations in the laptop body",
                "3",
                "Awesome new (actually old) MacBook keyboard :-)"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Real or Fake?",
                "I bought this 16 inch MacBook Pro from Amazon dealer and not a third party international seller",
                "Most things work well and I haven't had any problems after two weeks",
                "EXCEPT the bluetooth isn't working",
                "Other than that the computer works well, but still have doubts about it being and authentic Apple product",
                "Also, when applying for Apple Care+ the serial number was not eligible, which lead me to believe it may not be authentic."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Macbook, not as good as it once was",
                "At a point of having to dangle plenty of attachments to get the usability I need",
                "I understand the average college kid loves the sleekness and cool factor of no ports, no holes, no luxuries",
                "But, in the real world, I need additional screens, faster ethernet connections, the ability to read a memory cars, etc..",
                "I think the pro version should still have some usable ports/features without me having to dangle 4 other things off the side and travel with a grab-bag of add-ons",
                "leave the portless model to the kids in the non-pro line",
                "Also, in travel computers, hard drive space is still a factor."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Computer keeps shutting off on its own",
                "Attempted to contact Amazon, no help",
                "Contacted AAPL, have to wait 3 weeks to see me",
                "Computer shuts off on its own."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Go directly to apple, not worth the cheaper price on already expensive",
                "Unboxed and a different size laptop was in the box! The box seemed a little beat up but didn’t think anything if it and Frustrating due to needs for a new computer next time I should’ve just went directly her to the Apple Store."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great Experience After All!",
                "&nbsp;Hello Folks, B like U here! After 7 days I finally received my MacBook Pro 16'' Entry Level",
                "Although it was a bit disappointing to find out that no air cushions were used during transportation, I was relieved to receive the product in perfect conditions",
                "Bought it with the Amazon Prime Credit Card and got a great deal compared to those being sold at apple stores",
                "If you want to save some money and delivery time is not an issue then, this is the place to buy it",
                "Looking forward to trying out all my music softwares and testing how powerful this is."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Battery didn't hold a charge",
                "I received this product and the battery held a charge for less than 3 hours",
                "Was on with Apple Care service for over an hour to run various tests and fixed, which improved the battery life for up to only 6 hours",
                "Requested a replacement from Amazon, which I received promptly, and it had the same problem",
                "Went through the process again, and ultimately decided to return and cancel the order",
                "Then, the refund took about one month! When I finally got through to Amazon customer service, the attendant was very helpful, but overall this experience was quite frustrating",
                "Would not recommend buying an expensive device from Amazon."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Awesome Laptop!",
                "What a phenomenal product",
                "I would buy this laptop over again in a heartbeat",
                "I have to say that it is well worth the money and if I had known how happy I would have been with it I probably would have added more SSD space",
                "What I have works well but I could have cut out the need for some external hdd if I had upgraded a bit",
                "I would recommend this to anyone in the market and considering a MacBook."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "The speakers sound like high quality Bluetooth and the speed and graphics are amazing!",
                "I love this MacBook, I use it for photo and video editing and it works perfect for both",
                "The sound is amazing on it, I honestly don’t need any kind of headphones or studio speakers to hear the quality of sounds in my video."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good for the price.",
                "Great quality for the budget",
                "As graphic designer I would describe as a great startup computer",
                "Fast and reliable",
                "Overheats a little bit though",
                "Doesn’t like to transfer programs from my older computer do I kind had to work my way around in order to get it done without loosing my data",
                "So make sure you have a backup copy of all your files in case you need to restore it to default upon installation and setups."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "great computer",
                "Love the computer and price but it was not upgraded when we received it and that took twenty four hours as our internet is very slow",
                "Also we still can not make email work even after talking with Apple care."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "The best MacBook Pro of all time, at least until the Apple chips come...",
                "Absolutely blazing speed for editing photographs compared to the 7 year old iMac I replaced with this",
                "The i9 8-core processor is so fast that it opens Lightroom in 8 seconds",
                "The keyboard has a perfect feel and the Space Gray is a beautiful design",
                "Very happy with it and the screen size is big enough to be a desktop replacement",
                "My only complaint is battery life, which seems to be about 5 hours for editing photos",
                "If you are just answering emails and looking at the web, it lasts a lot longer",
                "Until the Apple-based chips start shipping, this is the best there is."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Works great,",
                "Honestly I was a bit worried about the overheating issues I read online but after 7 months of use, I can say my unit does not have that problem",
                "My Macbook only has random restarts on sleep mode",
                "Apparently all those issues are solved with Mac OS Big Sur beta",
                "But I'm not ready to upgrade yet",
                "My only regret is not getting 32GB of RAM."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not happy",
                "It stopped working",
                "I can't turn it on after 1 month"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Don’t waste your money on the device❌👎👎",
                "I’m really regret one of my biggest mistakes that i wast a lot of money on this device",
                "Just after one month my mac shutdown every time I opened it for like 5 or 8 time I didn’t use it a lof and I'm outside America so I couldn't return the device",
                "The device now has two months of Reform Center and has not yet been repaired",
                "And I really don’t know what to do"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Best Macboook Pro to date!",
                "Best Macboook Pro to date! I bought the entry version 6-core / 16gb RAM / 512Gb and it’s been great and solid so far in almost everything",
                "Great screen, great keyboard, superb sound and mics (for a laptop) great battery life and of course very good performance",
                "The only issue is the webcam..",
                "honestly they must be using a 720p wecamera from a decade ago",
                "Very poor quality, almost unusable in low light conditions",
                "Shame on you apple for saving on the camera for a 2.5k+ laptop",
                "I would say that every selfie’s cam above iPhone 5 is way better!!! For that reason I would give 4.5 stars"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Transferred by Time Machine seamlessly!",
                "I finally had to break down and replace my mid 2012 Power Mac since I could no longer update the OS",
                "I was very concerned because I had set my MAC up exactly as I wanted it and didn’t want to have to redo all my settings and reinstall apps, etc",
                "I couldn’t be happier! The time machine backup I had done on my old Mac worked absolutely seamlessly in just a couple of hours! And the new Mac runs sooooo much quicker that I’m thrilled",
                "I’ve got it plugged into a 27” Viewsonic monitor and it looks awesome! So glad I upgraded!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not New or like new",
                "This is not new or like new product",
                "This is missing manual when i got it",
                "It’s body and charger have some black marks",
                "This is used product."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Big Mac is a Big success....",
                "I absolutely love this new Mac! Amazing display, sound, size, and speed....what more could you ask for",
                "I already own a MacBook Pro, and feel that Apple really did a great job on this one",
                "So far, no complaints",
                "I still can’t believe how large the display really is!! Honestly, the price was hard to digest",
                "After seeing it, I wasn’t disappointed"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Have fun getting AppleCare if you order for business",
                "Like many people I have a personal and a business account with Amazon",
                "I first viewed this Macbook in my personal account, because that's what I was logged into at the time",
                "There was an option to add Applecare with the purchase",
                "Since I was ordering for work I logged out of my personal account and into our business account",
                "When I viewed the item in my business account the option to add Applecare was not there",
                "No problem, I thought, we'll just add the Applecare through the Apple website once we get it",
                "We've done that a bunch of times with iPads and iPhones",
                "Nope",
                "Apple at first refused to sell us Applecare unless we had a receipt that included the serial number of the device, which neither the Amazon order summary, nor the packing slip included",
                "Amazon support was not helpful at all",
                "Their only suggestion was to return it",
                "After working our way up the ladder with Apple support we finally were able to purchase the Applecare, but only after providing copies of the receipt, the packing slip AND a screenshot of the recent transactions on our business credit card",
                "Took nearly 3 hours to resolve",
                "Long story short - if you want Applecare protection with your $2200 Macbook - DON'T buy it from Amazon with your business account."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Going from window 10 to Apple macbook format is a easy transition.",
                "Quality is very good",
                "This is my first Apple laptop",
                "I spend a day playing with it",
                "I learned a lot of Apple protocol",
                "I am not disappointed in buying this laptop."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It’s all about luck",
                "Laptop lags and stuck at login page all the time, battery drains 10 percent in 10 minutes."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "I believe in paying for quality",
                "In this case, it was worth it and earned.",
                "My grandson was accepted to Tulane",
                "As a graduation/Christmas gift I gave him this laptop",
                "His wonderful bright appreciative smile was all I could ever want."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Why do they always change the input?",
                "Overall this has been very good so far",
                "I am really happy that Mac came out with the 16\" screen and the image clarity and performance is great",
                "I really like the Touch Bar too",
                "Still getting used to it but so far so good",
                "Why did they feel the need to make this with only USB C inputs? That is extremely frustrating to me",
                "The first adaptor I bought is awkward, feels like something is going to break off every time I use an HDMI or regular USB device",
                "I just don't get the logic there",
                "That is a problem in my opinion",
                "I like the old magnetic charger better, and I'm pretty sure everybody has regular USB devices, so adaptors are required for everything."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Keyboard Issue - major headache",
                "There is a major issue with the shift key (left side) on my keyboard",
                "My previous Air had a great keyboard",
                "Initially, I thought there may be a learning curve with the new magic keyboard",
                "But alas, it's gotten even worse",
                "I have to slowly and very deliberately hit the shift key - and even then watch to see if it performs its job",
                "Frequently, even with slow and deliberate strikes, the key does not work",
                "I can't tell you how frustrating this is while coding",
                "Btw- I keep the keyboard clean and it's about 70 days old",
                "Apple will replace the keyboard through a service center, but I will be without computer for 4-7 days",
                "Since it's my primary tool for work+school, this is a poor option",
                "I even followed up with apple to see if there are other options to being without the computer for a week - but no helpful options were presented",
                "One last option still keeps the burden on me",
                "Buying a external keyboard to use until I can the right time to send the computer for repair (ex",
                "Christmas break)",
                "Note: (Hindsight is 20/20",
                "The magic keyboard issue wasn't a user issue like I initially thought possible",
                "Send yours straight back to apple if you have this issue like me)."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This machine has a stutter",
                "Prior to this machine, I had a 2014 MacBook Pro",
                "This 2019 16\" is a beautiful, powerful machine with awesome sound and graphics, but: 1) There's a stutter in the machine whether it's typing, watching a Youtube video, etc",
                "It's like it pauses for a mini-second periodically",
                "2) The trackpad is too large, so at times my palms will inadvertently contact it, causing the cursor to jump or an email to be sent that wasn't complete",
                "3) The Touchbar, although cool technically, is rather a pain practically",
                "I much preferred the dedicated buttons, which I could even access in the dark!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Facinating Macbook pro 16 inch",
                "This machine is an absolute beast, only problem I face is the heat through the aluminium body is irritating sometimes, way better than some windows laptop in the case of fan noise and trackpad, keyboard is the best part of it",
                "After a month of usage I notice it has horrible battery life",
                "As per their advertisement it is supposed to be atleast 10 hrs of battery life, but in relaity it dies after 4 hrs of usage."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Too Awesome",
                "It is familiar since I am a MacBook Pro user yet it is awesome in the speed and graphics",
                "Only complaint, if Apple is listening, is the location of the keyboard make my watch bracelet catches the surface",
                "First World issue, yeah I know",
                "16 Inch is just too forking awesome."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Love It!! Great Cost Savings Of Over $300!",
                "This is a legit MacBook Pro 16\" model from Apple",
                "I was a little skeptical, and called Apple to check the serial number as soon as I got it",
                "It's legit 100% and you save anywhere from $250-$400 depending on options at the time of order",
                "Can't go wrong!!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great product and great service.",
                "Great product and great service",
                "After a month of light use the camera stopped working",
                "Luckily I had Apple Care",
                "I took it Apple store and they got it replaced ( the entire screen/ top lid) and sent it back by FedEx express in 3 days",
                "No issues since then."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Amazing laptop!",
                "If like me, you’ve been using Windows for years, the transition to Mac OS will take some getting used to but once you do, you’re in for a fantastic experience",
                "The hardware itself is blazingly fast and a joy to use!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Fabulous!",
                "So much better than those cheap Windows computers",
                "Sturdy and well-built",
                "The software looks great and the screen is rich and vivid",
                "The computer performs very well and definately meets (exceeds) my expectations",
                "It can run Creative Cloud programs without any hangup and it interfaces with my new iPad Pro to provide a second screen",
                "It can even connect to the iPad to utilize its cellular data connection--without any hassle or PW on my part."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop, but performance is not stable.",
                "This laptop was great while everything works normally",
                "I returned this item because it would restart every 3-4 hours and every time I would close the laptop for extended periods of time",
                "This MacBook gets warm, but not hot when gaming or when running large, complex CAD models",
                "The WIFI works great",
                "I never got kicked off the WIFI or kicked out of a zoom meeting",
                "Also, the large display is great for multitasking",
                "On the other hand, this laptop is too big and heavy to carry around",
                "This laptop is best used at a desk and moved every so often rather than being an everyday laptop carry unless it is the only device you need",
                "The battery life is good when using macOS",
                "I would get between 6-8 hours of mixed use",
                "That is email, 10-12 Safari tabs, Microsoft Office, and Zoom",
                "I only got 4-6 hours when using Windows",
                "This machine is quiet and cool under and office-type workload, but it is pricey if you're looking for a larger laptop",
                "The daily crashing, the short battery life, and the high cost are the reasons I could not keep the machine."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I guess I got a lemon.",
                "big disappointment.",
                "I guess I got a lemon, which is disappointing considering the high cost",
                "All of the Thunderbolt ports had a short and would not stay connected, so I could not charge",
                "I tried different Apple manufactured cables and power supplies with the same result",
                "I was able to get one charge and the battery life was terrible (two hours)",
                "Sent this defective unit back to Amazon for a refund but they said that will take two weeks",
                "I will wait this model out and see if there is a systemic quality issue."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not at all worth the $$$",
                "This thing is a MAJOR disappointment! It lags as I’m just moving the cursor across the screen! It has ZERO USB ports, which means you have to carry an adaa as peter around with you to get anything done",
                "The battery life is sub-par",
                "I’m lucky to get 4 hours out of it! I’ve spent the past 2 months Researching how to even use this laptop to save date, pics, and media..",
                "not user-friendly! There is NO WAY this thing is worth the price tag! I’ve had a $600 Asus laptop that functioned better than this -.-"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Best Apple Laptop",
                "This has been the best Apple Laptop I have owned I have had other's in the past which were good and gave me no problems, but the overall build quality, screen size ,and ease of use have been the best , the new keyboard they are using now has a bit more travel and is a joy to type on",
                "I would Highly Recommend this Laptop with no reservations"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "MUST BUY.",
                "I liked everything about it",
                "I also bought accessories for it from Amazon as well",
                "It was nothing different about it",
                "The same experience I would have had if I ordered it from Apple",
                "But, the product is still under Apple Amazon",
                "I just wanted it ASAP! &amp; due to COVID-19 stuff takes way too long to ship so I got it from Amazon bc with my Prime account I got it the very next day",
                "Prime is just the best thing anyways",
                "Bc if you like me.",
                "I want all my packages ASAP! I’m impatient",
                "But, yeah great experience, great purchase",
                "This isn’t my first Apple product ordered through Amazon either",
                "I got my AirPods from Amazon too."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Expensive but good...",
                "Good computer",
                "Good specs but you’re definitely paying for the name",
                "I love it and the fact that I finally have a pro but the price is way higher than it should be",
                "I purchased it for podcasts and photo editing and it’s working good so far so no complaints other than the money"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Love it best laptop out",
                "Love it and I actually saved almost $200 from apples price (I was lucky caught a quick deal) as new machines rarely go on sale",
                "What can I say I still use a 2009 17 inch MacBook Pro they last forever as long as you get the upgraded ones I think my 2009 work better than my friends new HP I would always tell people to get the upgraded one if you can as it buys you more time in the future",
                "You can get 10 years easy out of a upgraded MacBook Pro"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Non-Responsive Applications",
                "Non-Responsive Applications including Safari and System Preferences often crash or take forever to open, the screen goes black every now and then for a second, and images and video don't preview or show thumbnails in finder."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Cool &amp; elegant looking laptop but need supply of dongles with laptop",
                "This the first Mac Pro",
                "It was touch switching to Mac from windows for decades",
                "I love the the way it operates.Takes little time but as used to it it is charm",
                "The con is that ot does not come with productivity apps and dongle",
                "As you add accessories, it get expensive and sometime fustration as it happers your productivity lack of connectors amd required softwares",
                "I also, feel thw battery life is short and get warm",
                "Battery life and heat dissipation could be better",
                "Except that i like using my first mac laptop."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Already replacing things after a month",
                "Had this for a month and am already having to replace the charging cable",
                "Get a chime noise every few seconds to indicate it’s charging, then not charging",
                "Cord is not damaged and laptop sits in the same spot so I’m already shelling out additional money and I hope this is the issue",
                "Not impressed."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Performance and Magic Keyboard are stupendous!",
                "I like the thin bezels around the screen which resulted in a much fuller view screen for work and multitasking",
                "Although the new display looks great--the keyboard is a significant added change since it includes Apple's new magic keyboard",
                "It is probably the best Mac keyboard ever released by the folks at Apple",
                "Overall, this new MacBook is rather pricey, but there's a reason it is called \"Pro\" because it is designed for professional",
                "With this laptop you're paying for performance in a portable package."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "FANTASTIC !",
                "So happy with my NEW MacBook Pro! I have always used Mac but this is my first NEW purchase",
                "LOVE LOVE LOVE it!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "All in all, this is a computer worth buying",
                "Keyboard changed back to scissors say feel much better The biggest trackpad I've ever seen looks wider than a keyboard, and it works, and it works",
                "I've never used a MacBook trackpad before, and it's easy to use",
                "As for the screen, this 16' large screen has a resolution of 3072*1920, which is super delicate",
                "After watching this screen, other laptop screens should not enter the eye, and I don't know whether it is a good thing or a bad thing."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "No Buyers Remorse",
                "I love it",
                "It’s a big improvement in speed over my 2011 MacBook Pro",
                "I like to write, this makes it easier to do so",
                "Also the sound quality of the speakers is amazing to listen to music with while writing",
                "I can also enjoy editing photos more",
                "All in all a solid machine",
                "Glad I bought it",
                "I don’t know if it’s for you, but I’d recommend it to anyone who likes to buy quality",
                "I have no buyers remorse at all from this one."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Awesome Computer",
                "Great product! It’s everything you’d expect from Apple",
                "It did take about a week from order to arrive but it looks great and so far works great",
                "We had our old one for 10 years and needed an upgrade- we hope this one lasts another 10."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Doesn't disappoint.",
                "I didn't plan on buying this, but when Apple decided to announce their new Silicon plans - I had to grab an intel based macbook (I bootcamp - I mainly use Mac OS for iOS development and spend 80% of my time in windows)",
                "CPU is super fast, screen is great, keyboard is awesome - the only thing I wonder is how well the touch bar will hold up..",
                "but so far so good."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Lots to love and hate",
                "Overall, the computer's performance is excellent, but the battery life is a joke, the giant mousepad a constant issue requiring most to adjust their normal hand placement, and Apple's decision to update all ports to USB-C will give you fits",
                "Obviously, manufacturer design issues like these are unavoidable if you're upgrading to a new MacBook, but buy the required adapter cables and proper charging cable."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great Computer",
                "I held on to my previous MacBook Pro 13 inch for 7 years, and it served me very well, and I gave it away to a needy family who needed a computer for their children",
                "Made this purchase and I couldn’t be happier",
                "Very easy to setup, I love the Touch ID, bright and crisp display, and it’s fast speed",
                "You really can’t go wrong with the MacBook Pro for all your computer needs."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Worth the price, high performance",
                "Best laptop I've used so far",
                "Extremely fast, high processing power",
                "I installed many heavy software like Adobe photoshop, PyCharm and IDEA Intellij and used all of them simultaneously and there was no performance drop at all",
                "It's i9 processor and 16 GB RAM are able to handle very high work loads without any lag",
                "The battery when fully charged lasts for at least 8 to 10 hours while using high processing software",
                "The track pad gestures make it very easy and fun to use",
                "It is definitely worth the price."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Best apple laptop so far",
                "This is my 4th mac laptop",
                "As all the reviews say, they got this one right! Even the base model has enough memory and storage for my music files and videos the keyboard is smoother than older models and the sound output is nice enough you don’t automatically reach for bluetooth",
                "Definitely appreciate the screen size as its mostly on the desk This was an amazon warehouse Purchase but I had no problems"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Overheats with external monitors",
                "Overheats when plugged into an external monitor."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Awesome laptop!",
                "This MacBook Pro is AMAZING! I got it for my Dad and so far it is much easier for him to navigate than Windows and he loves the 16” screen",
                "Definitely happy with my purchase for sure!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not that great beware.",
                "This new 16\" is not noticeably faster",
                "The only thing better is the 1TB SSD",
                "I sold my 2015 i7 15\" MBP and I'm sorry I did",
                "If I didn't this would have gone back",
                "The Touch Bar is no big deal and Big Sur is just a bunch of changes and not for the good",
                "I've been using Mac's since 1984 and this is a sub par machine.."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Won’t buy large electronic device at Amazon ever again",
                "Bought one month and encounter system issue couple times and problems with track pad and can’t even move mouse occasionally",
                "Amazon doesn’t like to let me return to them and ask me to find apple and apple can’t solve the problem then kick me back to Amazon",
                "Then I returned but they received the item for two week but hasn’t started issue the refund",
                "Product isn’t good and the customer service you can tell by your self"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Only 2 problems",
                "I was disappointed that This new laptop does not have a SD card port",
                "so I had to buy an adapter",
                "Also the plug in port for electricity is not magnetic like my old laptop."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It’s an apple so..",
                "Always a good choice! Glad it was on sale because I don’t like paying full price for Apple products haha came wrapped in original plastic and shipped with care in protective box",
                "Works properly and fully functional."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Integration with my various devices!",
                "This was a replacement for my 2012 MacBook laptop that still worked",
                "I felt I needed a replacement",
                "Love the ability to work between my Tablet, iPhone, and my laptop",
                "A very polished machine."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This is a great and powerful laptop",
                "I love this prof doc because of the ability to to work back and forth and between all my Apple products, which is a huge help",
                "In addition, the screen / monitor is excellent",
                "The MacBook Pro 16” is a phenomenal product for on the go and also simply to use like your desktop computer."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "expensive but worth it",
                "I decided to upgrade and get a macbook with a bigger screen because of all the work i do on the computer and this computer is amazing.",
                "i am still getting used to it since i've had only 13in macbooks in the past",
                "the sound quality is amazing, nice and loud with good sized speakers on each side of the keyboard",
                "the battery life is very good, I have been on it for about an hour and a half now and the battery has only gone down about 9 percent",
                "the touchbar on top of the keyboard is pretty cool, i have never owned a macbook with that feature and i really enjoy that i can unlock my computer with my fingerprint, it makes for lighting fast access",
                "so far i am really impressed with it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This is a steaming pile of dog crap!",
                "Starts overheating the moment I turn it on..",
                "the screen locks up constantly..",
                "crashes nearly every time I use it..",
                "Updating the OS did not help..",
                "the only thing I can do to make it somewhat stable is to turn the display settings down to as low as they go, and even then it sometimes crashes",
                "Honestly, a Chromebook is more useful than this garbage",
                "Would not recommend to my worst enemy!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Apple product ..",
                "can't expect less than perfection",
                "No need to write reviews about mac products anymore",
                "One must acknowledge that new keyboard on this model is qay better than old 2018 and 2019 butterfly keyboards"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Really nice, fast and gorgeous screen",
                "I like the big gorgeous screen, how fast it is and the 16 Gb of memory is plenty to run many applications simultaneously",
                "I didn't think it was going to be a big deal but I found the TouchId to be really nice - I like the way it lets me unlock the screen without having to type in my password."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Slim &amp; superior performing notebook",
                "After doing lot of research I finally ordered this MacBook Pro and I am happy with my decision and research",
                "This is the best laptop and Very Powerful performance",
                "It is faster than my previous windows laptop",
                "The new i-9 processor 16 GB RAM and 2.3 ghz core speed make it beast",
                "I couldn’t take off my hands after configuring it",
                "Everything working perfectly so far",
                "Only down is it’s weight but overall it’s best",
                "Performance and look is same as described in Amazon description",
                "Happy to switch from Windows to Apple."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Delivered",
                "The box was open when deliver I haven't had a chance to take it to geek squad have appointment on 04/28/20",
                "Will see if not damage"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Returned faulty mac",
                "Save yourself the hassle and pay the extra money by getting this from the official apple store",
                "On the very first start up while the progress bar was loading, the screen went weirdly green/static for 1-2 seconds then went back to normal, I let that go and thought that maybe it was just an odd occurrence",
                "I just kept using my laptop normally for the rest of the day",
                "The next day i was using iMovie for the first time ever and after importing a video that I received via airdrop i noticed that the sound was messed up",
                "I'd recommend just buying this from the official apple website / the apple store"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "The best 💯",
                "I love my MacBook Pro",
                "It’s everything I thought it would be and more",
                "The speakers sound better than my dang TV!!! The picture quality and brightness are fantastic",
                "The trackpad is superb and the keyboard JUST WORKS! So glad they ditched the butterfly keyboard",
                "I wasn’t able to purchase the apple care for this product through amazon and for some reason I couldn’t get it online either even though it stated it qualified for it, but Apple customer care helped me right away and fixed the problem",
                "Couldn’t be happier",
                "🤩"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice!",
                "This is a beautiful computer",
                "Large screen and not terribly heavy",
                "As with all MacBooks I recommend getting a keyboard cover",
                "They are easy to type with and can save a lot of hassle, as the keys easily collect dirt, crumbs, and dust without it (which can result in keys not working)."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop no USB ports",
                "I’ve owned MacBook Pro’s in the past and I’m always extremely satisfied with them",
                "Enjoy the touchpad and the keyboard",
                "The display is beautiful",
                "Only drawback is there are no USB ports",
                "I had to buy an adapter to be able use USB drives",
                "Only drawback so far."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great Computer overall!",
                "Computer works great, has really wonderful graphics, lots of memory, and a nice keyboard",
                "On the downside, it's pretty heavy and the bottom gets really hot."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It's a very good laptop but",
                "Great sounds, magical keyboard, beautiful display but it does get unnecessary hot and drains the battery fast, run a couple of video editing software for 30 minutes and you will not need to microwave your pizza."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "It",
                "Just",
                "Works.",
                "I bought an XPS 13 before this and hated every minute of it and returned it within a week",
                "Using this 16 inch MBP has been a magical experience! It seems pricy but a device this good will last for years! I love every minute of it",
                "Works like a beast no matter what you throw at it",
                "The keyboard feels so good I wanted to cry first time I typed on it",
                "If you got the dough, look no further",
                "Cons: I’m used to 13 inch so this felt HUGE and very heavy, barely fits in my backpack",
                "Also, it’s not meant for gaming so, don’t even try."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "The best gift",
                "My wife's MacBooks were older and she was debating replacing one with the smaller, older MBP that this one replaced",
                "There are several ways to say Happy Birthday; this one worked pretty well..."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Makes great videos",
                "My videographer uses this for our videos, works great"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great buy!",
                "Amazing buy! Steal of a deal",
                "I showed the post to an Apple store rep and they couldn't believe the price! They confirmed that it was identical to the one I was just about to buy in store and even recommended this one! Don't hesitate!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great",
                "Such an amazing laptop I’ve been dreaming about , the battery is ok while I’m not using a program that consume the processor such as Final Cut, the sound is beautiful the bass is so great , I love it I’m including a pic comparing next to my old 13” MacBook Air"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Apple MacBook Lives Up To It’s Reputation!",
                "Pros: it’s everything my college kid required and wanted",
                "Screen resolution good",
                "Set up easy",
                "Works well",
                "Good battery power",
                "Well worth the money",
                "Bought the extended warranty",
                "It’s an investment for sure",
                "Cons: pricey after adding warranty and taxes."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not refunded for return",
                "Product too heavy",
                "Returned and have not received refund."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "NO CAMERA",
                "NO CAMERA, NONE, NEIN",
                "AFTER ALL THESE YEARS AND NOW A CAMERA ISNT IMPORTANT? I AM RETURNING IT."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent!",
                "I bought this machine to replace my 11 year old MacBook Pro, which I am still using for personal needs but couldn't keep up with professional demands",
                "It's hard to believe how much faster the new Mac is",
                "The quality of the display is incredible",
                "The only downside is that none of my peripherals have USB-C ports, so I need to purchase adapters until the peripherals get replaced."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "good product",
                "good product"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Meh",
                "Sadly my Thinkpad x1 yoga 3rd gen runs rings around this core i9 and it has the ultra low wattage 8th gen I7",
                "I bought this for a project",
                "It is underwhelming -tbh",
                "Beautifully spec’d but will throttle and gpu will give out requiring a reboot when doing any intensive video encoding",
                "And the lack of ports really sucks",
                "Sure -get a dongle but like I said at the beginning of the post -my thinkpad really runs rings around this core i9 “beast”."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Best MacBook",
                "Great laptop, great battery life! I’m glad Apple is giving more value to their customers when compared to previous models",
                "You are still paying an Apple tax, but if you are like me and prefer MacOs, this is a great option."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Defective",
                "arrived defective",
                "was never able to get it turned on."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Love it.",
                "I like the touch bar, keyboard and the speakers on the 2019 MacBook Pro",
                "They are a big improvement from the mid 2015 I previously owned",
                "I have used the laptop for a little more than 2 months and I am a big fan of the quality of the product",
                "I would highly recommend this!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent laptop!",
                "I have had this laptop for a little over two weeks now and I love it",
                "This is my first MacBook and I intend on using it for school",
                "It seems to perform much better than my previous MSI laptop",
                "The display is absolutely amazing",
                "The battery life and speed at which this laptop carries out task has been very impressive",
                "I cannot wait to see how this computer will aid me in my Computer science degree."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "If you're a Mac power user, this is a great option",
                "I really like this laptop but there are a couple complaints",
                "The sound didn't blow me away as I was led to believe it would",
                "It's good not great",
                "It's a powerful computer but in my opinion didn't offer enough change over the previous years to justify the total cost."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I prefer MACOS over all.",
                "Like my 2011 MACBK PRO THIS UNIT OVER HEATS AND IT IS WORRYSOME FOR ME AS IT ALSO HAS AN AMD DISCRETE GPU",
                "AFTER ALL THESE YEARS APPLE SHOULD HAVE GOTTEN A HANDLE ON COOLING",
                "I AM CONCERNED ABOUT EDITING AS IT GETS TOO HOT JUST CHECKING MAIL AND NORMAL USE",
                "OVERALL ITS STILL BETTER THAN BEING STUCK WITH USING A PC."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "The battery is junk",
                "The battery will not hold a charge",
                "We need to take it to an Apple store and it has been out of the box for 2 days!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Ridiculously good",
                "Everything about this machine is ridiculous",
                "Ridiculously good",
                "Especially the speakers",
                "Hot damn",
                "Hot",
                "Damn."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        }
    ]
}