{
    "data": [
        {
            "text": [
                "Bs", 
                "I should’ve done this before I bought this stupid thing but I check the apple website and this laptop not even worth 125 and yet I paid 450 for this BS", 
                "I start to realize that I may have been ripped off cause as soon as I open the package I see wolverine scratches going up and down the top and bottom of the laptop", 
                "The screen and the mousepad clean but this thing is not worth the price", 
                "Im about to return it", 
                "Not worth it."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "4", 
                            "10"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "screen", 
                        "subcategory": ""
                    }, 
                    {
                        "target_position": [
                            "19", 
                            "27"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "mousepad", 
                        "subcategory": ""
                    }, 
                    {
                        "target_position": [
                            "66", 
                            "71"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "price", 
                        "subcategory": ""
                    }
                ], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Charger broke within 4 days", 
                "While this is a refurbished product", 
                "It should be useable", 
                "Unfortunately I this is not possible when the charger is broken", 
                "After a lot research this was purchased as a gift for an adult family member who was quite excited to have it", 
                "I have another Mac in which the charger lasted for 5 years", 
                "This has made it 4 days which is totally unacceptable", 
                "The computer itself is in good condition, but very unhappy about the charger as they are $80 from apple"
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "0", 
                            "7"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "Charger", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "46", 
                            "53"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "charger", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "69", 
                            "76"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "charger", 
                        "subcategory": ""
                    }
                ]
            ]
        }, 
        {
            "text": [
                "Item is not as pictured and described!", 
                "This laptop did not arrive as listed", 
                "The photo of the charger is WRONG", 
                "It is not the late-2012 model with the flat style charger", 
                "It is the early/mid-2012 version with the chunkier “toothbrush-looking” style charger connector", 
                "It also does NOT have a solid state Hard Drive", 
                "It has a SATA disk hard drive", 
                "How can amazon sell these products when they list them incorrectly on their own website?!? Buyer beware!!!!"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Exactly how it should be!", 
                "The MacBook Pro I received really looks and works like new", 
                "The battery charges properly and has only 200 cycles", 
                "An original Apple power adapter was included", 
                "Exactly how it should be for a renewed product", 
                "Seller: Easymobiledevices."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "This piece of junk that is not Apple certified is DOA at just over the 90 day", 
                "This piece of junk that is not Apple certified is DOA at just over the 90 day warranty do not buy this not a good deal like I said it's dead at like 95 days the warranty was only 90 days now I got to go there and figure out if I can get any money back at all the hard drives gone I just got off the phone with Apple and this is not Apple certified it's Amazon certified"
            ], 
            "opinions": [
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Great buy", 
                "Threw the dice with all the negative reviews I read, and glad I did", 
                "This laptop is great!!! I have been using it all day today ran updates and software checks", 
                "Great Mac for the money", 
                "Thanks"
            ], 
            "opinions": [
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "5", 
                            "11"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "laptop", 
                        "subcategory": ""
                    }
                ], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "I received my macbook and it doesn't even work", 
                "...", 
                "I received my macbook and it doesn't even work", 
                "I can't view websites, can't update the OS system, can't download my virus scan, etc", 
                "Now I am expected to pay shipping to return my defective device? I wouldn't buy another item from this seller again!"
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "14", 
                            "21"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "macbook", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [
                    {
                        "target_position": [
                            "14", 
                            "21"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "macbook", 
                        "subcategory": ""
                    }
                ], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Horrible experience!", 
                "This was a christmas present for my son and when we open and saw that they put tape over the top of the computer a huge slab of tape like a sheet over paper covering the whole top of the laptop with an apple sign cut out of it! Yes this really happened and when we took the tape off it had scrapes and scratches all over the top! The description said it had no scratches and blemishes which turned out to be not true! Right now I'm waiting on a refund no one has contacted me on the phone as of yet but they did approve the return with an automated message saying that it was going to charge 15% restocking fee after they sent me a damage computer! I would not recommend!"
            ], 
            "opinions": [
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Five Stars", 
                "I’ve enjoyed using it!"
            ], 
            "opinions": [
                [], 
                []
            ]
        }, 
        {
            "text": [
                "The MacBook Pro is excellent, runs perfectly and I am very satisfied", 
                "The MacBook Pro is excellent, runs perfectly and I am very satisfied", 
                "The laptop has a very good external image, however, in order to increase the RAM I took off the bottom tap and I could appreciate the dust and dirtiness caused by a prolongued use", 
                "I understand this computer is not new, but in my humble opinion, I recommend that such kind of products must suffer an internal cleaning, just to provide to the client an used but clean product, something that I did in 10 minutes", 
                "Thank you"
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "4", 
                            "11"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "MacBook", 
                        "subcategory": ""
                    }
                ], 
                [
                    {
                        "target_position": [
                            "4", 
                            "11"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "MacBook", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "One Star", 
                "Continuously shuts down", 
                "Numerous errors and issues."
            ], 
            "opinions": [
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "the computer was in terrible shape", 
                "The keys had soda or something in ...", 
                "the computer was in terrible shape", 
                "The keys had soda or something in them and they stuck", 
                "it had dents in the cover and took forever to come on", 
                "It was for my daughter and we returned it."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "20", 
                            "25"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "cover", 
                        "subcategory": ""
                    }
                ], 
                []
            ]
        }, 
        {
            "text": [
                "So far runs good, but please factory reset these.", 
                "Not bad at all so far, system seems to be very responsive", 
                "I was scared to buy from these guys because of the terrible reviews but mine is holding out as I speak (might not down the line lol)", 
                "If you could please send these out factory reseted that would a hell of a lot nicer than going through and doing it yourself and since it is a hassle I wouldve payed more money so you could do it damn", 
                "This is my first MacBook so I had no idea how to reset these at all so I called a support and they were very skeptical of me doing this because it appears to them that we are stealing these son of a guns, just please", 
                "FACTORY RESET"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Buy this!!", 
                "Literally perfect condition", 
                "Bought a Kingston ssd 480gig to install in it and it went beautifully as well", 
                "Now runs 6x faster! Great purchase"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Good solid buy.", 
                "Really nice Mac for the money", 
                "A tiny bit bulky, but what can you expect from it being built in 2012? Has every jack you could possibly want as well as a disc drive", 
                "I upgraded the RAM, and now it runs like a champ", 
                "Very impressed for what it is."
            ], 
            "opinions": [
                [], 
                [
                    {
                        "target_position": [
                            "12", 
                            "15"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "Mac", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Don’t listen to the negative reviews", 
                "I mean sure, it’s refurbished", 
                "It’s not going to be in mint condition and I’m sure there are some people who received damaged ones", 
                "The one I received was in great condition and I would buy again", 
                "I bought from Tech4less on here and there were some minor surface scratches and some wear on the bottom", 
                "(Not brand new again it’s refurbished but I was/am pleased)"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Legacy Apple Laptops Are Still A Value For Students!", 
                "Buying this Apple over a new model wan no problem", 
                "My 16 year old was extremely happy ever since I bought this computer for her", 
                "This her main laptop and was not happy that her High School now forces all students to use a ChromeBook and is not allowed to BYOD at her HS", 
                "a"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Untrustworthy seller...", 
                "The computer at first seemed fantastic, but then it became clear why it was being sold", 
                "It will randomly shut down, with no warning, and reboot", 
                "It will also randomly crash and go to the login screen, causing loss of data unless you've been very careful to save", 
                "Certified refurbished is not up to Apple standards and comes with some serious issues", 
                "I am making it work for the price, but I have to be super careful about saving to avoid critical loss of data", 
                "DO NOT BUY FROM THIS SELLER."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Quality exceeding expectation", 
                "I was surprised by the quality of this refurbished laptop after the box was opened", 
                "It is just like brand new with no sign of wear and tear at all", 
                "I am completely satisfied with this purchase."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Not a great purchase", 
                "Unhappy", 
                "Keep freezing up", 
                "Returned", 
                "But was told the screen was broken", 
                "I returned the computer in perfect condition in the same package I received it in", 
                "Company said to let Amazon know", 
                "They said Amazon would return my money."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Don’t BUY", 
                "Absolute junk", 
                "Images on Amazon Ads are of newer models", 
                "The Apple they sent was over 10 years old! They also sent the wrong charger! The computer had a large sticker on the front and back to hide the damage but the sticker looked like junk", 
                "Obviously they buy REALLY cheap OLD computers and selling with images of newer items", 
                "Bait and switch", 
                "Does not support basic software (word, excel, or google docs), slow and over a decade old", 
                "Actually shocked Amazon allows these to be sold by seller", 
                "Should have a clear disclaimer that the item is a “classic” or non functional", 
                "Terrible terrible bad bad"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "will be upgrading, but works well.", 
                "So I will be getting more Ram and a bigger hard drive for this, but to just try it out it booted up very nicely, and connected to my internet and all that fancy stuff, so I am really happy with this for the price I paid for it."
            ], 
            "opinions": [
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Horrible choice", 
                "Please do not buy this product.", 
                "Horrible", 
                "Wouldn't refer anyone to buy refurbished products that aren't from apple itself", 
                "This laptop was gutted and didnt have apple original hardware", 
                "Didnt work well either", 
                "Please do not buy from this seller."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Great computer", 
                "Love Mac"
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "6", 
                            "14"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "computer", 
                        "subcategory": ""
                    }
                ], 
                []
            ]
        }, 
        {
            "text": [
                "Exactly what I expected!", 
                "Looked brand new out of the box! Gorgeous computer and runs perfect", 
                "Was properly factory reset and upgraded to the latest OS! As described, beautiful! Thank you!"
            ], 
            "opinions": [
                [], 
                [
                    {
                        "target_position": [
                            "42", 
                            "50"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "computer", 
                        "subcategory": ""
                    }
                ], 
                []
            ]
        }, 
        {
            "text": [
                "Terrible Purchase!", 
                "First off, it’s not even a macbook pro, but rather a fake one", 
                "You can tell by how thick the base of the laptop is", 
                "The charger is also nothing like macbook chargers and the ports are different as well", 
                "The charger also came in a plastic ziplock bag and was already marked up and wasn’t in good condition", 
                "Also, when I received it and right as I took it out of the package it came in, the screen was shattered! Luckily, it states that there’s 90 day return policy which I’m hoping to get in contact with customer service to get a full refund", 
                "This is unbelievable and I do NOT recommend buying!"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "4", 
                            "11"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "charger", 
                        "subcategory": ""
                    }
                ], 
                [
                    {
                        "target_position": [
                            "4", 
                            "11"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "charger", 
                        "subcategory": ""
                    }
                ], 
                [
                    {
                        "target_position": [
                            "83", 
                            "89"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "screen", 
                        "subcategory": ""
                    }
                ], 
                []
            ]
        }, 
        {
            "text": [
                "Exactly what I wanted", 
                "I prefer the old MacBooks because of their durability and the fact that they have a disc drive", 
                "Digitalizing everything is idiotic and short-sighted", 
                "This refurbished model works wonderfully and I am much happier with it than the $1200 notebook that can't do anything that I had bought prior to this."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Buyer beware", 
                "Buyer beware", 
                "I bought this laptop in hopes that it will be in half decent condition", 
                "However upon delivery the top was chipped inside was dirty the screen was dirty and it was horrible I don’t know how anyone can present this to a customer", 
                "Mind you also for the age of it, it was pretty expensive", 
                "I wouldn’t pay 30 bucks for it."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "63", 
                            "69"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "screen", 
                        "subcategory": ""
                    }
                ], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Strange Red Line &amp; bulging bottom", 
                "I’m giving this a low rating because there were a few things wrong", 
                "The first was when I went to plug it in I found the bottom of the computer is bulging out from the top", 
                "Then when we turned it on a strange thin red line appears on the screen and won’t go away", 
                "Also the bottom screws don’t line up with the slots on the computer", 
                "I’m really disappointed because it was a Christmas gift for my daughter."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Very Happy!", 
                "Pulled it out of the box, plugged it in and it works great! I have no complaints it looks just as good as new", 
                "It’s my first Apple computer so it takes some getting used to but so far I m very happy.", 
                "the battery holds a charge for days", 
                "The screen is like new.", 
                "I’d have no problem recommending this to friends or family."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "4", 
                            "11"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "battery", 
                        "subcategory": ""
                    }
                ], 
                [
                    {
                        "target_position": [
                            "4", 
                            "10"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "screen", 
                        "subcategory": ""
                    }
                ], 
                []
            ]
        }, 
        {
            "text": [
                "No one has called", 
                "Stay away do not buy from them no matter what the price .", 
                "got the laptop the next day worked will I try downloading some music from foot Box it wasn’t working one song took 20 min", 
                "I’ve left three messages", 
                "I’ve called 5 time and every time they want you to leave a message", 
                "Amazon shout be", 
                "But I blame myself I never Read the compliant !!!"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "The company doesn’t return calls, not refurbished", 
                "I called the company and got their voicemail, and they never called me back! Some of the keys on the keyboard Stick terribly, making it hard to use, the MacBook Pro typically has certain programs that should come standard, and this unit did not, and it had scratches on it", 
                "Very disappointing as it was a birthday gift for my daughter."
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "4", 
                            "11"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "company", 
                        "subcategory": ""
                    }
                ], 
                [
                    {
                        "target_position": [
                            "101", 
                            "109"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "keyboard", 
                        "subcategory": ""
                    }
                ], 
                []
            ]
        }, 
        {
            "text": [
                "Dirty computer", 
                "Not cleaned before resale", 
                "Amazon fraud", 
                "I understand it’s used and will have some wear and tear but from the description it makes it sound like it was broken down and cleaned and inspected by amazon", 
                "Which was quite the opposite", 
                "There was still crud and splatter from whoever owned it previously", 
                "A simple wipe down of the outer case left the slightly wet paper towel I used brown", 
                "The wipe down around the keyboard was even worse", 
                "How do I know there isn’t semen and lube left on there", 
                "Wiped the whole thing down with germ killer", 
                "Gross", 
                "If I didn’t need the computer I’d send it back", 
                "Bad form, Amazon."
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "6", 
                            "14"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "computer", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Perfect condition", 
                "I expected a used machine that is at least 5 years old to have a few scratches and maybe looking a little dull", 
                "This machine arrived polished and looking like new", 
                "It was loaded with OS10.12 which works fine with the particular software I'm using (a CADD program), an application that is performing less vigorously as the OS advances", 
                "I couldn't be happier."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Piece of Crap", 
                "No where did it say this computer was a 2012", 
                "I knew I was getting a used computer but it was shown as if it was new out of the box today’s price would be $1200...no one is paying $1200 for 2012 technology", 
                "It’s not even capable of being unlocked with an Apple Watch because it’s so old", 
                "Super disappointed this was advertised as a newer computer that was used/refurbished", 
                "It is slow and old technology", 
                "It’s not worth the $400 I paid for it! Honestly I wouldn’t have paid $100 for this brick! DO NOT BUY!!!"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Buy a new one, not used!", 
                "This product kept freezing up from the moment I bought it", 
                "I should have sent it back, but I kept it", 
                "After a year it quit on me", 
                "Technology like this should be bought new with all the warranties", 
                "Do not chance work projects with used technology."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "After receiving this 2x because it was damaged both times, it has now stopped working after 4 months", 
                "Beyond mad! I ordered this as a gift for Christmas and it arrived damaged! Returned it for a replacement and it arrived with MORE damage and no charger!! Elected to keep it after it was too close to Christmas", 
                "4 MONTHS LATER IT SUDDENLY STOPPED WORKING- Almost 500 later, we now have a laptop that will not work"
            ], 
            "opinions": [
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "76", 
                            "82"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "laptop", 
                        "subcategory": ""
                    }
                ]
            ]
        }, 
        {
            "text": [
                "Hard drive went out within two weeks", 
                "Laptop came with scratches but I was able to see past that even though I said refurbished and I haven't even had the computer for more than 2 weeks and the hard drive went out", 
                "Took it to the Max store you said I need a new hard drive and for the amount of money I paid for the computer now plus a hard drive I would have been better off buying a brand new laptop"
            ], 
            "opinions": [
                [], 
                [
                    {
                        "target_position": [
                            "0", 
                            "6"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "Laptop", 
                        "subcategory": ""
                    }
                ], 
                []
            ]
        }, 
        {
            "text": [
                "Works like new", 
                "I got this for my kid this is his first year of college I got this refurbished it looked and functions like new save some money and buy refurbished"
            ], 
            "opinions": [
                [], 
                []
            ]
        }, 
        {
            "text": [
                "GREAT LAPTOP!", 
                "I was very nervous about getting this MacBook because of the reviews I saw, but I did it anyway and I have no regrets! I just got it today and it works perfectly fine, although it does have a few small scuffs and scratches that I don’t really mind and aren’t noticeable, I think it’s a great laptop for the price it was sold for!"
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "6", 
                            "13"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "LAPTOP!", 
                        "subcategory": ""
                    }
                ], 
                []
            ]
        }, 
        {
            "text": [
                "Very Dissatisfied!!!", 
                "Very disappointed!! Whoever refurbished it left a lot of the previous persons passcodes in it and can’t use half of the items", 
                "Called Apple and they said it would be very costly to get it back to working order", 
                "Very disappointed!!"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "My first ever Macbook Pro", 
                "This is my first ever Macbook and I'm quite impressed how a 7 year old laptop still runs very well", 
                "Despite some minimal scratches on the corners, I love the silver sticker they put on top and bottom to cover any blemishes on the aluminum body", 
                "I upgraded it to SSD and 16GB RAM and it runs faster than my friends 2017 macbook pro", 
                "This seller is legit and I really appreciate it."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Works!", 
                "It’s a little more scratched than I expected- obviously not anywhere near new", 
                "But the computer works, which is what we needed! Glad to get a MacBook that fit our budget."
            ], 
            "opinions": [
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Top service", 
                "great service - seller replaced item after it stopped working within 2 weeks of purchase"
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "4", 
                            "11"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "service", 
                        "subcategory": ""
                    }
                ], 
                [
                    {
                        "target_position": [
                            "6", 
                            "13"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "service", 
                        "subcategory": ""
                    }
                ]
            ]
        }, 
        {
            "text": [
                "Don’t buy save your money", 
                "I bought a used MacBook Pro from this seller they even through in a free case when I got home I couldn’t wait to open my package and when I turned the laptop on the screen is all busted I can not see a thing ....glass looks fine when the computers off but when on it’s useless ,I guess you really do get what you pay for ...0 stars for this one !"
            ], 
            "opinions": [
                [], 
                [
                    {
                        "target_position": [
                            "165", 
                            "171"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "screen", 
                        "subcategory": ""
                    }
                ]
            ]
        }, 
        {
            "text": [
                "First purchase and not very happy.", 
                "I was VERY disappointed when I received this", 
                "I opened it and it looked like it had been dragged along the ground", 
                "There were scratches on the back", 
                "All the ports where u plug the charger into had some sort of corrosion or built up something in em there was a dent on the frame of the screen", 
                "It was CLEARLY used", 
                "It didn't even looked refurbished", 
                "It looked used", 
                "I returned it immediately because I wasn't confident it would last more than a week before it broke down", 
                "Now I am STILL waiting for my refund."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "136", 
                            "142"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "screen", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "My favorite", 
                "I use this every day and it works ...", 
                "My favorite", 
                "I use this every day and it works like it is brand new and looked relatively new", 
                "The only downside is that it doesn't have some minor features the newer models have, for instance the camera quality is not the best", 
                "I am still thrilled with this purchase though."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Not worth the hassle!", 
                "Purchased this laptop Dec 2019", 
                "It’s now Aug 2020 &amp; it no longer works", 
                "Took it in for a diagnostic check &amp; found that the board no longer works", 
                "Will cost more to replace the board than what I originally paid for the laptop."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "DO NOT BUY from this seller.", 
                "This was not a good experience", 
                "The computer does not work right and is not accepting the latest update", 
                "DO NOT BUY from this seller", 
                "We will never buy an electronic on Amazon again."
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "21", 
                            "28"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "seller.", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [
                    {
                        "target_position": [
                            "4", 
                            "12"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "computer", 
                        "subcategory": ""
                    }
                ], 
                [
                    {
                        "target_position": [
                            "21", 
                            "27"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "seller", 
                        "subcategory": ""
                    }
                ], 
                []
            ]
        }, 
        {
            "text": [
                "Worth the money.", 
                "Operates as a brand new product so far", 
                "Using it to run Serato Dj Pro", 
                "Working flawlessly!!"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Looks new and works well", 
                "Someone who has experience with Mac products will love this computer", 
                "It’s small easy to travel with and operates very responsively", 
                "On the other hand if you’re accustom windows, your going to have to learn computers all over again."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Junk", 
                "Received this Apple Mac Book Pro and would not even turn on", 
                "Customer service connected me with Apple", 
                "They advised computer ram was bad", 
                "I sent it back for a refund", 
                "Don’t waste your money!"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "22", 
                            "25"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "ram", 
                        "subcategory": ""
                    }
                ], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Highly recommend this seller", 
                "Ordered my MacBook Pro and it came earlier than expected", 
                "When I opened the fedex box the MacBook was neatly placed in the box and the MacBook also came with a free black case the worth of $50", 
                "The case was already put in by a technician", 
                "I turned it on and it was just like a brand new MacBook", 
                "Works perfectly fine with no scratches", 
                "This was a great buy for me low priced and now I can finally can make my beats", 
                "Highly recommended this seller", 
                "You’ll definitely get what you want", 
                "Thanks guys"
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "22", 
                            "28"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "seller", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "24", 
                            "30"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "seller", 
                        "subcategory": ""
                    }
                ], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "I am annoyed.", 
                "MacBook shuts off on its own for no apparent reason", 
                "It is very slow turning on and doing anything whatsoever (even things that don’t require WiFi)", 
                "Also, on the amazon renewed area it said if held a foot away damage is undectable and I have to look from across the room to not notice"
            ], 
            "opinions": [
                [], 
                [
                    {
                        "target_position": [
                            "0", 
                            "7"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "MacBook", 
                        "subcategory": ""
                    }
                ], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Trouble from the get go!", 
                "Don’t like the fact that you aren’t able to download any new updates or apps! Horrible purchase", 
                "And can’t receive a return of my money because it’s passed the 30 days!!"
            ], 
            "opinions": [
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "PERFECTION!!! Thanks!!! :D", 
                "OUTSTANDING!!! This Mac book pro is 100% perfect! I am very very very very happy with my new laptop :) It's spotless N fast! I would definitely buy again :)"
            ], 
            "opinions": [
                [], 
                [
                    {
                        "target_position": [
                            "20", 
                            "32"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "Mac book pro", 
                        "subcategory": ""
                    }
                ]
            ]
        }, 
        {
            "text": [
                "wrong model number", 
                "I purchased one, and it arrived not being the model advertised and not weighing 1.1 lbs", 
                "It was closer to 10 lbs", 
                "Hope I get my money back."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Nice Device!!", 
                "Just received the laptop today", 
                "Can't say much about battery life being we just got it", 
                "Cosmetically they are nice, minimal if any outer flaws", 
                "The laptop itself fired right up and my son got right to work doing his homework", 
                "No complaints thus far! Thank you for the quick shipping!"
            ], 
            "opinions": [
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "21", 
                            "28"
                        ], 
                        "polarity": "neutral", 
                        "category": "", 
                        "target": "battery", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Old And Slow", 
                "Do not buy this", 
                "It’s an old laptop, and it’s not going to last long", 
                "Mine was already slow when I got it", 
                "You’re better off paying full price for a new one that will last you ten years"
            ], 
            "opinions": [
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "12", 
                            "19"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "laptop,", 
                        "subcategory": ""
                    }
                ], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Great value, but for experienced mac users.", 
                "I think this is just straight up used and not refurbished", 
                "Still good value, but don’t get if you’re expecting it to run like new", 
                "It needed to have the hard drive wiped and MacOS reinstalled", 
                "Which is so easy to do, I don’t know why the seller didn’t just do it", 
                "Runs great after I did that."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Completely outdated not able to be updated", 
                "Useless", 
                "This product was sold outdated", 
                "Unable to do any updates or upload apps", 
                "Was not compatible to any of the current software", 
                "Extremely slow."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Not worth it for me", 
                "I was sad to see that this computer basically won’t pull up most sites", 
                "“Outdated” error messages abound", 
                "I don’t know a lot about computers, but I thought if I bought one that was refurbished, it would at least be useable", 
                "The charger lasted one use as it fell apart into three pieces when I first unplugged it, although it was replaced promply."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "4", 
                            "11"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "charger", 
                        "subcategory": ""
                    }
                ]
            ]
        }, 
        {
            "text": [
                "I do like the laptop", 
                "I do like the laptop, I think that it is nice", 
                "But, there are some misstatements that need to be addressed", 
                "First, the body is nice and only has one or two tiny marks on it", 
                "If you didn't \"inspect\" it, you probably would not see it", 
                "So good job, it does look rather new and clean", 
                "Nothing was shipped damaged etc, I've seen pictures where the charger was horribly damaged and not in any condition to be used for anything other than a sorry paperweight", 
                "The computer functions rather well, I say rather because I'm not overly happy about it", 
                "When you open more than three windows, it lags soooooooo bad", 
                "With 4 G memory, mail, internet, and spreadsheet should not lag the computer so horribly", 
                "Besides the internet is not doing videos or music, it's on a static page", 
                "Also, my major issue is that it claims to have a seven-hour battery life", 
                "How about two-three hours", 
                "Literally, all I use this for at work is my scheduling software, mail and invoicing - sometimes for kicks I throw in the spreadsheet and close down something else", 
                "So, while I do like the laptop - I don't like the misleading on the battery life or the fact that more than three things open causes such a lag."
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "14", 
                            "20"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "laptop", 
                        "subcategory": ""
                    }
                ], 
                [
                    {
                        "target_position": [
                            "14", 
                            "21"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "laptop,", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [
                    {
                        "target_position": [
                            "11", 
                            "15"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "body", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "4", 
                            "12"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "computer", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "better condition than I even imagined", 
                "better condition than I even imagined", 
                "Certified Apple Product, and it doesn't have a ding dent or smudge on it", 
                "***** for sure."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Look elsewhere...device came dirty and battery life gone..", 
                "Battery came with little or no life left to it..will only work if charger is hooked up...needed updated...6hrs worth.", 
                "and was a bit dirty..during Covid19???? Expected more", 
                "Wouldnt purchase from seller again.."
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "39", 
                            "46"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "battery", 
                        "subcategory": ""
                    }
                ], 
                [
                    {
                        "target_position": [
                            "0", 
                            "7"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "Battery", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [
                    {
                        "target_position": [
                            "22", 
                            "28"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "seller", 
                        "subcategory": ""
                    }
                ]
            ]
        }, 
        {
            "text": [
                "Wonderful buy !!!", 
                "I love my Mac pro laptop I just purchased (refurbished, however, it looks and acts like brand new) !! Not only was it a great deal but It was delivered expeditiously!! Great product for the price !!"
            ], 
            "opinions": [
                [], 
                [
                    {
                        "target_position": [
                            "10", 
                            "13"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "Mac", 
                        "subcategory": ""
                    }
                ]
            ]
        }, 
        {
            "text": [
                "Random, interfering \"test\" account still on machine", 
                "The machine is actually working fine, which is why I gave it a second star, however it has a \"test\" account remaining on the machine that is not allowing me to do things like turn on FileVault, since I don't have the password for this account", 
                "It also is not allowing me to sync with my iphone, when other refurbished machines in fact did", 
                "I've tried reaching out to the seller via amazon (the only way to do so) without any response."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Disk drive does not work - returned/refunded", 
                "Disk drive does not work: S.M.A.R.T", 
                "Status is “failing”", 
                "Cannot set up the computer without a functioning drive, so returned for refund."
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "0", 
                            "10"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "Disk drive", 
                        "subcategory": ""
                    }
                ], 
                [
                    {
                        "target_position": [
                            "0", 
                            "10"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "Disk drive", 
                        "subcategory": ""
                    }
                ], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Total lemon - and DO NOT BUY ASURION WARRANTY", 
                "Laptop totally died 6 months after I bought it", 
                "\"Start up disk broken and can't be repaired\" No problem, I purchased the Asurion 4 year warranty", 
                "Phone number has been disconnected", 
                "Cannot get in touch", 
                "Bad product and worthless warranty."
            ], 
            "opinions": [
                [], 
                [
                    {
                        "target_position": [
                            "0", 
                            "6"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "Laptop", 
                        "subcategory": ""
                    }
                ], 
                [
                    {
                        "target_position": [
                            "10", 
                            "14"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "disk", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Slow, but good for office use", 
                "It’s really clean and like new, until you realize it runs as old as the year it came out", 
                "Sadly it did not hold up to Apple standards."
            ], 
            "opinions": [
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "It was okay", 
                "I needed a backup laptop for work", 
                "This seemed to fit the bill", 
                "It runs suuuuuuper slow", 
                "Like dial-up slow", 
                "I only have 2 applications on it", 
                "No photos, music, or videos."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "DON'T BUY", 
                "Would give product a Zero if I could", 
                "Worked for two startups, then would not turn on", 
                "Troubleshot every option, didn't work", 
                "Amazon customer service was helpful in returning item, but should stop selling this product."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "0", 
                            "6"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "Amazon", 
                        "subcategory": ""
                    }
                ]
            ]
        }, 
        {
            "text": [
                "Works well for high school home learning", 
                "Works well so far, and my daughter is making great use of this laptop for all her distance learning during COVID closures."
            ], 
            "opinions": [
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Not the best", 
                "After a month the screen starts to wobble", 
                "Find out tha the screws holding it were lose", 
                "Not a good quality refurbished job"
            ], 
            "opinions": [
                [], 
                [
                    {
                        "target_position": [
                            "18", 
                            "24"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "screen", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [
                    {
                        "target_position": [
                            "11", 
                            "18"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "quality", 
                        "subcategory": ""
                    }
                ]
            ]
        }, 
        {
            "text": [
                "Poor quality product.", 
                "Product broke after about 90 days", 
                "Needed to be rebuilt Not a good vendor"
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "5", 
                            "12"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "quality", 
                        "subcategory": ""
                    }
                ], 
                [
                    {
                        "target_position": [
                            "0", 
                            "7"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "Product", 
                        "subcategory": ""
                    }
                ], 
                []
            ]
        }, 
        {
            "text": [
                "MacBook replacement", 
                "Replaced a Mac AirBook that went caput, my fault not the AirBook's", 
                "Couldn't be more pleased", 
                "Running 10.13.1 with no problems."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Great product thank you", 
                "Not one mark on it, could not even tell that it was a refurbished unit", 
                "Great product thank you."
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "6", 
                            "13"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "product", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [
                    {
                        "target_position": [
                            "6", 
                            "13"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "product", 
                        "subcategory": ""
                    }
                ]
            ]
        }, 
        {
            "text": [
                "Good value", 
                "Arrived quick, downloaded my stuff that I had on external hard drive", 
                "From my old computer that died", 
                "Works great ."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "This is a smart buy for your money.", 
                "Thus product came packaged well by seller", 
                "There were no dents scratches or anything like that", 
                "The computer looked like it was new", 
                "Software was updated and the machine runs like an Apple product should, smoothly and with out effort", 
                "Online pages loaded quickly and were easy to read", 
                "So far very happy with this supplier and i do have 90 days if anything goes wrong", 
                "I do not foresee that happening."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Excellent customer service.", 
                "Update: I was able to contact the seller's customer service and the sent me an RMA tag and a replacement laptop immediately", 
                "New laptop arrived and was in perfect working order", 
                "there were a couple of VERY minor scuffs but otherwise the device was in like new condition", 
                "I would definitely recommend", 
                "This Certified refurbished MacBook was a Christmas gift for my daughter and the keyboard is not working", 
                "Leaving this one star review as a placeholder pending customer services' response."
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "19", 
                            "27"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "service.", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Excellent buy!", 
                "My daughter uses this product mainly for video streaming, gaming, social media, and Internet."
            ], 
            "opinions": [
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Gift for my brother", 
                "Let me start off by saying that was a gift for my younger brother who is starting his freshman year in college", 
                "I couldn’t not wait to give it to him he is such a great kid I am so proud of him and he deserves the best and this Mac book pro really is the best for the price can’t beat it JemJem you made my younger brother so happy", 
                "Thank you"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "I've been using it for a year now and it's still running beautifully.", 
                "When I got it, it appeared to be brand new", 
                "I've been using it for a year now and it's still running beautifully."
            ], 
            "opinions": [
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Excellent purchase for an older MacBook", 
                "Love my MacBook", 
                "I was hesitant at first because of the reviews but I'm glad I purchased", 
                "The package arrived promptly", 
                "My only disappointment is that it didn't come with a charger so I had to purchase one ($99 from Best Buy)", 
                "I have been able to hold a charge for up to three days before needing to recharge ", 
                "Overall a good deal !!!"
            ], 
            "opinions": [
                [], 
                [
                    {
                        "target_position": [
                            "8", 
                            "15"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "MacBook", 
                        "subcategory": ""
                    }
                ], 
                [], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "27", 
                            "33"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "charge", 
                        "subcategory": ""
                    }
                ], 
                []
            ]
        }, 
        {
            "text": [
                "Five Stars", 
                "Great products and the price is right."
            ], 
            "opinions": [
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Inoperative Laptop", 
                "Laptop turned in for 5 minutes and never turned back on", 
                "Very badly renewed, don’t waste your money and time."
            ], 
            "opinions": [
                [
                    {
                        "target_position": [
                            "12", 
                            "18"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "Laptop", 
                        "subcategory": ""
                    }
                ], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Get a newer version", 
                "Decent laptop considering how old it is", 
                "After 2 years of having it it needs to be tuned up", 
                "This may be apples doing more than anything", 
                "Buy a newer version of this laptop"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Five Stars", 
                "Great price for what you get and so far working as advertised."
            ], 
            "opinions": [
                [], 
                []
            ]
        }, 
        {
            "text": [
                "pretty good", 
                "When it came, I expected some dings and scratches but there were none, in fact it looked brand new", 
                "The performance was good enough at the time however I later added more RAM and swapped the hard drive out with a SSD and now it runs better than ever and faster too", 
                "I've been able to run programs like Adobe photoshop and Logic pro x with ease and no crashes after making the upgrade."
            ], 
            "opinions": [
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "4", 
                            "15"
                        ], 
                        "polarity": "positive", 
                        "category": "", 
                        "target": "performance", 
                        "subcategory": ""
                    }
                ], 
                []
            ]
        }, 
        {
            "text": [
                "Four Stars", 
                "A few scratches on front cover, but otherwise works great"
            ], 
            "opinions": [
                [], 
                [
                    {
                        "target_position": [
                            "19", 
                            "30"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "front cover", 
                        "subcategory": ""
                    }
                ]
            ]
        }, 
        {
            "text": [
                "Bad business practices.", 
                "The seller claimed the product was made in 2015 but it was not true", 
                "The product was made 2012", 
                "I over paid not knowing how old the product was", 
                "They installed 2015 back cover of the laptop", 
                "A year later I found out the actual laptop was 2012", 
                "By the time I found out it was too late to return", 
                "I don't recommend the sellers because they are not legitimate or honest."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                [
                    {
                        "target_position": [
                            "22", 
                            "29"
                        ], 
                        "polarity": "negative", 
                        "category": "", 
                        "target": "sellers", 
                        "subcategory": ""
                    }
                ]
            ]
        }, 
        {
            "text": [
                "One Star", 
                "I actually liked the computer", 
                "But the letter \"Q\" didn't work", 
                "So I returned it."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "and look amazing!!", 
                "While it does have a few scuffs here and there, I fully expected that being refurbished! As far as everything else, it runs smooth, and look amazing!!! Thank you so much!(:"
            ], 
            "opinions": [
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Works great but had some dents", 
                "Knew we were buying a refurbished laptop but the description didn't include the dents and scratches that were on the outside", 
                "It works great", 
                "Other than the dings, no complaints."
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Don’t buy used", 
                "Buy new", 
                "Dislike", 
                "Won’t charge", 
                "Dies quickly when it decides to charge", 
                "Slow", 
                "My guess it was a piss poor job of being refurbished"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Works great!", 
                "I bought this product for my business &amp; school &amp; of course personal reasons", 
                "My daddy set it up &amp; it was an easy set up", 
                "I didn't even realize it has a CD-rom until I got it but I'm a little ol skool..so I was happy with that!"
            ], 
            "opinions": [
                [], 
                [], 
                [], 
                []
            ]
        }, 
        {
            "text": [
                "Very happy with my laptop", 
                "Very happy with my laptop, I did a lot of research and am pleased with this product", 
                "There is a small scratch on the top case but it is refurbished and doesn't effect the product at all."
            ], 
            "opinions": [
                [], 
                [], 
                []
            ]
        }
    ]
}