{
    "data": [
        {
            "text": [
                "Fantastic laptop",
                "I love this amazing laptop it's perfect for my online school and between my daughter and I we share the laptop since she is going through virtual school",
                "Its not heavy fits perfect in a small case and book bag",
                "Very durable love how thin this laptop is its not bulky at all."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Overpaid for this laptop!",
                "Bought this laptop on 1/4/21 for $229",
                "Computer works well, no issue at all with it",
                "Yet, a week later, same laptop was listed for $189",
                "Not happy I overpaid, and there is no mechanism other than returning it and buying it again to realize the $40 savings",
                "Should have went to Costco."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Keeps crashing",
                "My apps constantly crash even though I have downloaded no additional software at all",
                "The laptop is horribly slow at loading anything",
                "I mean, you pay a couple hundred bucks for a laptop worth a couple hundred bucks so it is what it is",
                "The frustration is not worth the few hundred bucks you’d save when you can just buy a Chromebook or a Surface Pro."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Capabible",
                "Nice little home PC",
                "To look stuff up, pay bills, manage accounts, shop, surf, social media, etc",
                "Screen is beautiful! Very nice",
                "I'm impressed and I use PC's all day at work",
                "Mines an Amazon Warehouse purchase, $150 bucks, cant beat it!!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "ASUS L203MA-DS04 VivoBook L203MA Laptop",
                "Only little lap top I could find for an affordable price with 8 gig",
                "Do not do gaming at all",
                "Love this little lap top best one I have ever had."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Spend a little more get something better",
                "This is the second of the same one and first wasn’t correct to spec",
                "Second won’t even get past the loading screen to turn it on"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good cheap laptop",
                "This is great for basic functions (word and internet) and for travel, but has a lot of technical blips, forcing me to periodically restart in the middle of activities",
                "I wouldn’t want to use it as my primary laptop but it works well as a cheap secondary."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Do not buy",
                "Do not buy this product",
                "Barely over a year old and stopped working",
                "I use it maybe 4-5 times month and stops working as soon as warranty runs up",
                "Called support and it cost me more to send it in for diagnostics than it did to purchase",
                "I will be buying from someone other than Asus."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent Laptop",
                "I love this",
                "My previous laptop was 8 years old and was sluggish and just couldn’t do what I needed it to do anymore",
                "I had to get a new laptop for a new school I’m attending, and it’s been fantastic",
                "It does exactly what I need it to do and has all the storage I need."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This computer is good for starters to learn",
                "This computer is good for starters and it’s in a heavy duty computer but it will handle email smaller games and websites with these it will print and it will handle most of your standard needs I actually bought a second"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good but small started freezing",
                "It’s good but quite small does not have touch screen but it is portable but it stopped working after 11 days do not get scammed by this"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great value",
                "I bought this as a \"gaming\" computer for my 12 yr old daughter",
                "I say \"gaming\" because she is only playing games like roblox - lower res games",
                "But for her, this is the perfect fit",
                "Easy to move &amp; carry and faster than her phone",
                "Overall, very pleased for the money."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Poor customer support from vendor",
                "I bought this laptop for my 14-year-old, she loved the laptop",
                "For some reason it stopped working after two weeks",
                "I sent it back to the vendor to get fixed and instead they gave me a refund of only 155.69",
                "It was half of what I paid - they deducted a restocking fee $137.48 plus a tax of $18.22",
                "Not only am I out $150.00 now I must go out and buy another laptop",
                "This is the main reason why I am a little hesitant of buying electronics from a third-party vendor",
                "I am upset and will never buy from this vendor again."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect for what I needed",
                "Perfect for school",
                "Small and compact",
                "Works fantastic with my college courses",
                "I am able to do everything I need without any issues."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect for the price",
                "Great size, perfect for college taking notes, quick start up"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Complete junk",
                "It says 64gb of storage, but it's actually 28.3gb",
                "It also has \"S-mode\", which means you can only download stuff from the Microsoft store",
                "This is a glorified tablet with a keyboard that's too small to realistically use."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good paper weight",
                "I'd say it's a giant piece of junk but it's really not very big",
                "This laptop cannot do one thing at a time, imagine trying to do two things",
                "If you need a computer that can do things, spend the money on a good one."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very nice little basic laptop",
                "Considering the low price, I was not expecting anything extraordinary",
                "All things considered, I am very pleased with this little laptop",
                "Very user-friendly, nice display, lightweight and easy to carry around",
                "Pleased with this purchase!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Works every other week.",
                "This was such a bad idea to think that a $200 laptop would do it",
                "This computer just works whenever it decides it want to works",
                "Everyday is a surprise: is it going to start today or not? Obviously it’s always when you need it the most that this stupid computer will decide to not work",
                "I’m so disappointed and mad."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I love that it comes with installed Internet protection virus software.",
                "The computer is new, so it’s hard to give it a review right away",
                "So far I like the size and lightness of the product",
                "Seems fairly simple to find what I need",
                "I needed something small and this seems to work perfect",
                "Mostly using it for surfing the internet and research."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Had issues and returned it.",
                "I previously reviewed this item positively which we are asked to do with data of receiving them",
                "However on about the 4th time I turned it on, the keyboard failed to function and rendered it unusable",
                "Will send it back, really had high hopes for this computer."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "True to its word",
                "I waited this long to review to be sure I am giving a true answer",
                "It works great , light and small enough to talked along display is clear ",
                "Good product would recommend"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Love it!",
                "I have to use complicated software and didn't know how to install JAVA, but with an expert friend installed it and truly love this PC",
                "I use JAVA, Telegram, and ANKI apps and all work great",
                "The price is really reasonable and the weight is great too."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Workhorse laptop for kid's pandemic remote school",
                "We bought this laptop as spare and did not use it much until the Covid pandemic hit and we needed an extra computer",
                "My child uses it everyday, all day for school and it is holding up well",
                "The only negative is the screen is not that sharp or bright",
                "But for the price, I can't complain too much",
                "We also put the full Windows 10 version on it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Won’t turn on after very little use! buyer beware!",
                "Don’t buy this tablet it’s junk! I bought this tablet in June have barely used it because I had shoulder surgery and was unable to type",
                "Now that I’m able to use it again and I have here and there (maybe a dozen times) and today it just won’t turn on have tried all troubleshooting....nothing! It’s totally dead pretty upsetting! Looking back on the reviews it’s looks like it’s common problem! Buyer beware! Only gave it a star to be able to post my review."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Gets the job done",
                "Light weight and affordable.i would of gave it 5 stars but it's slow to load",
                "I purchased 2 and on kind of lags but it is a great computer to get the basics done",
                "I am grateful so far about 30 days in and it's going well",
                "Esp since it came with the 1 year free 365 program",
                "Since ima writer this is perfect."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "return boken computer already purchased June 4",
                "this computer has broken and I want full credit for its purchase",
                "It is completely dead",
                "I would like to return it without a re-purchase of same item",
                "I was in hospital and could not return it ny July 4th."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good choice",
                "For my daughter",
                "She loves it",
                "No complaints."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This is the absolute Dogs!",
                "I've been a Mac fanboy for ~20yrs and was looking for just a small(top of the bar) kick around(it can break) windows box",
                "Not chrome book",
                "My purpose is mostly for learning and software development and this asus hasn't disappointed",
                "I put in a 256gb and a wireless mouse for when im at the desktop and i use it with my very large monitor(48inch) via hdmi port on the side",
                "another great aspect is that you dont need a brick for power - all very tidy."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "DO NOT BUY! WILL STOP WORKING AFTER RETURN PERIOD",
                "Do not buy! Bought two for my kids for distance learning",
                "Both stopped turning on",
                "One before the return date luckily",
                "The other after",
                "I know have to go through ASUS to get fixed",
                "The problem is I bought them for school so I needed to replace ASAP",
                "No time to send to manufacturer."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It’s ok",
                "I like it",
                "Good for an inexpensive PC",
                "Not great but very light and portable",
                "I like the thinness",
                "The computer works okay but it’s a lot different from a typical laptop PC."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Waste of money",
                "I liked the laptop when it worked",
                "If the Lap top was low in battery it would shut off and you could charge it over 8 hours and it still would not turn back on",
                "It would basically work when it wanted to",
                "The powered button was also irritating trying to press because it was really small",
                "Pretty much had to use your pinkie finger to press it"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Trash",
                "This Laptop said that is has HD webcam, but it lied! That's the only reason I bought this laptop but when I tried to use the camera, the quality was 480p and blurry and not HD",
                "I wouldn't recommend this laptop to anyone and wont be buying again."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Poor Quality",
                "I bought two of these for my kids to use for online school",
                "These are really poor quality",
                "We have had a lot of issues",
                "Poor screen image",
                "Poor camera for connecting to school",
                "The microphone doesn't work consistently",
                "And most recently the headphone jack stopped working",
                "We have only had them for about 6 weeks and have had this much trouble",
                "I expect them to be fully nonfunctional in 6 months or less at this rate",
                "I will not buy this brand again and I would not recommend you buying them."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Disappointed",
                "I’m so disappointed",
                "I really wanted this laptop and then it went on prime day for a great price but it’s missing a key hardware component that you need to go on the internet."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "very light",
                "I needed a notebook type laptop for the weight - or in this case - the lack of! I can use it comfortably on my lap",
                "Took me a bit to get used to keyboard but once I got my arthritic fingers aligned it was a breeze",
                "I don't need a workhorse, but wanted a Windows based notebook",
                "Also easy to switch to regular Windows 10."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little pc for the price!",
                "Great little laptop for the price! Not as slow as some of the reviews state as long as you know what you're purchasing and what it's intended for",
                "Switch it out of S-Mode and you're good to go with Chrome and other programs",
                "Works great for the programs I wanted to use it for and plays videos great with VLC",
                "Using a micro-sd card for additional storage space works great!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Confusing to use.",
                "Goes from one screen to another in order to finish a search",
                "Hard to remember what's what from screen to screen",
                "If it were larger, it would all fit in one page."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Subpar screen and touchpad.",
                "Battery life is very good, the screen is difficult to see and the touch pad is very inaccurate",
                "I am giving 3 stars because Amazon let me return it",
                "I invested more money in a Surface Go, beautiful piece or art!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Battery Defecitive",
                "A week or two after purchasing and I noticed the battery would only charge to about 90%",
                "I called Asus and they did some troubleshooting and told me it would fix",
                "A few weeks still same thing",
                "Then it started to discharge the battery while actually plugged in",
                "By then I was past the return window with Amazon",
                "Now I have to deal with getting it serviced",
                "So far very disappointed"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I wish I hadn't bought it.",
                "I really hate this computer, I have had it for a year and wish I hadn't bought it",
                "The mouse is probably my biggest complaint",
                "Since that's what's used the most, it makes the entire experience bad",
                "The mouse clicks things randomly and is just a headache to use."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "The buying experience could have been better",
                "This laptop came with an inactive copy of Windows",
                "I thought I was going to have to return it",
                "There was no product key provided, so the laptop was useless until I finally got a key code from Asus."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect for middle school",
                "Love this little computer",
                "We use it mainly for school work but i have video chatted on it and it works great",
                "I just wish it was touch screen."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This is like the perfect gift for anybody",
                "I absolutely love this laptop perfect size light as they say easy to put in any bag and I can get all my work done on it the keypad is wonderful there's so much I could say about this laptop I love and and for the price you can't beat it."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "It's Laptop",
                "Very light weight and slim",
                "Not too big, not too small for a 6yr old",
                "Very fast operating system",
                "Camera video quality is very good",
                "My first grader is very pleased",
                "Not bad for the price."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very lightweight, use Linux.",
                "I got it used, and it came with windows in S mode, but no valid windows product key, so I installed Linux on it instead",
                "Runs great, better than windows S",
                "The laptop itself is super light and compact",
                "Buyer beware if you actually want to use windows on it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "wouldn't turn on after two weeks",
                "At first it was a good computer but after using it for two weeks it wouldn't cut on",
                "i tried charging it for a few hours thinking it died (it didn't even light up to show that it was charging) and even holding the power button down for a few seconds but still nothing worked",
                "Somehow after leaving it alone for a week it finally turned back on",
                "The two stars are mainly for the headache that it caused but at least it turned back on."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Do not buy it.",
                "Stopped working",
                "Bought on December 4th",
                "This is now Feb 26th",
                "Really...."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Online support is poor.",
                "I couldn't contact my email with this product and couldn't do some other things",
                "The company website was no help",
                "I telephoned an agent but he was not much help."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good computer for the price.",
                "I bought this for my son to use for online classes",
                "Its a good value for the money",
                "I like the size because its convenient for travel",
                "He loves it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good, but no backlight keyboard.",
                "Works good",
                "But the keyboard is not backlit",
                "Good buy, if you don't need a backlit keyboard."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Patience required for set up.",
                "Haven't seen anything yet",
                "I don't remember having such a difficult time setting up a tablet or computer!! Not user friendly by any means."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Buyer beware",
                "It has stopped working completely",
                "Won't turn on and it is less than 3 months old",
                "So disappointed especially since my kid saved to buy this."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Warranty issues",
                "Worked fine for my child for 5 months, then it stopped charging",
                "Warranty requests through Asus have been ignored for more than 2 weeks at this point so I am unable to recommend this product."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Cheap quality, small screen.",
                "Cheap quality, not suitable for everyday use",
                "I can imagine this would usable for a youngster or someone who only needs to check email",
                "Screen seemed small compared description - would need a monitor to make this usable for me",
                "Have returned it to Amazon."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Don’t do it",
                "Don’t do it",
                "Slow and buggy",
                "Returned"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Died within 6 months of use",
                "Stopped working 6 month after I purchased it",
                "Will not turn on."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great price and perfect size!",
                "So far I love this laptop! I couldn't say no to the price",
                "It does come in Windows 10S mode, but you can easily disable it - first thing I did",
                "I love how light and small this laptop is",
                "It's not big and clunky like some tend to be",
                "Perfect for if you're on the go! Works great for basic stuff, music, movies, browsing the web, doing work."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Big Disappointment , not what it appears to be!",
                "Be warned this is not full size and has very limited ports and capabilities! You get what you pay for! Spend a little more and get a real laptop."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect Laptop for High School Student",
                "Good speed, works fine, can do Zoom classes and homework",
                "The touch pad can be a little sensitive at times, but overall works as it should",
                "Battery life is good and lasts the entire day."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Super lightweight notebook",
                "Great notebook to travel with",
                "It has all you need for email, Whatsapp and video watching while away from home",
                "And there's room to load any special software programs you may need too",
                "Highly recommended."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "No Microsoft Office",
                "I just got my laptop and one of the reasons I got it was for the free year of office",
                "Office isn’t on this Computer for free",
                "Anyone know why?"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "No lit keyboard nor touch display",
                "Packaging was 1 star",
                "Overall laptop is a 5 stars",
                "2 things it doesn't have is1---touchscreen and 2",
                "Backlit keyboard (which I thought it came with)",
                "If it had those 2 items it would be 10 stars."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It’s good! I can run Ableton and Minecraft.",
                "Honestly, it works amazing! The only problem I have is the storage and the touchpad really",
                "The people who say that it’s too slow are probably just fake reviews to be honest",
                "It loads pretty slow for the first 2 hours but then after the updates are done, its a pretty fast load-up time",
                "So far, I’ve played Minecraft (with resolution down), and it worked great!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Do your research!",
                "Screen quality is ok",
                "Not the clearest",
                "Not touch screen."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect",
                "Perfect for COVID 19 home schooling."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good product but a few hiccups",
                "I bought this laptop for my daughter on her birthday",
                "Its a good laptop but the audio just stopped working one day",
                "I've tried fixing it but doesnt get fixed."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Am returning this item",
                "it said it was compatible with Chrome",
                "It was not, or if it was, I couldn't find the secret door",
                "Never mind getting this unless you're a geek."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not bad for the price!",
                "Its a great casual laptop that is silent and can run what is needed for my college classes",
                "Does not possess a backlit keyboard which was a little misleading and disappointing, but not really a deal breaker",
                "For the price I paid ($190 for the n4020 11.6 model) I am very satisfied."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Processor sucks, lies about processor speed",
                "and laptop freezes up all the time",
                "Froze 5 times in a row on conference meeting for work",
                "Embarrassing",
                "-Freezes randomly -laptop is SUPER SMALL for what the picture shows",
                "-Feels cheap and light -bad processor - LIES about processor speed -DOESNT EVEN HAVE A FAN."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Feels a little cheap....",
                "...but so far, so good",
                "Got it as a Christmas gift for my daughters",
                "It works fine and has plenty of speed and memory for their needs",
                "I will update this review if anything changes."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Spend your money elsewhere.",
                "Absolute trash",
                "Plastic garbage",
                "Touch screen was unresponsive",
                "Display was horrible",
                "Didn't connect to WiFi."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Trash!",
                "HORRIBLE",
                "Worked for me twice",
                "Had it a week",
                "Now its completely dead",
                "Wont turn on",
                "I dont even get the light when it plug it in..."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                ".",
                "I have this put away for a Christmas gift for my husband, but during set up, I thought it was very easy to use."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Terrible used when i ordered new(refurbished)security hole backdoor;",
                "Product quality was terrible, none of the windows 10 came back activated, the physical defective laptop will not even boot up",
                "Very unstable, it was supposed to be knew it seems like it was refurbished and shipped to me, Office 365 would not register either, Product had an unsafe backdoor."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Inspect what you purchase",
                "Came without registered windows and no windows key",
                "Do not buy",
                "Pirated software dropshipping",
                "Also smaller than it appears in photos",
                "And they take forever to refund."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice Lil' Guy",
                "Solid little computer! I'm mostly just using this lil' beaut for writing, and it definitely serves that purpose in spades",
                "All other functions and start ups seem to be pretty zippy, too",
                "The fact that you get a full year of Microsoft Office makes this SUCH a solid value",
                "Yeehaw!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "ASUS VivoBook L203MA Laptop, 11.6” HD Display",
                "This notebook computer is refurbished but looks and performs like new",
                "There are no drawbacks that I have detected."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Super light and portable - great overall laptop",
                "great value for the money...",
                "use it for email, web, word, zoom, etc",
                "no problems"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This little thing packs a punch",
                "I got this for my college classes, but I'm really surprised at how well it runs some video games I've tried out on it",
                "I didn't expect it to be as smooth and speedy as it is"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Disappointed",
                "Very tiny..",
                "difficult to type on"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Wonderful tablet",
                "I bought it for my son for school and he’s a little way he does everything with a job and the views go live with his teacher and get me a job at Amazon"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good lapto",
                "Good laotop easy to use and functional",
                "God for daily use and lasts",
                "Great for someone that just wans a simple laptop for pictures and videos and badic use",
                "Love it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Satisfied",
                "I am not a tech person",
                "I use this for my basic word documents and research on the internet",
                "It works well for me so far",
                "Should this change, I will edit this review."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Does the job",
                "Smaller than what I expected but just as advertised",
                "The screen doesn’t seem as bright or crisp as I’d like but I was a Mac user previously so",
                "Does the job of internet searching, which is all I needed."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Stopped Working After One Time Use",
                "After setting up laptop discovered it failed to work",
                "Returned it",
                "Vendor checked laptop and emailed laptop had technical issue and my money would be refunded",
                "Appreciate pending refund",
                "Not happy about purchase; hence 3 stars."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice little laptop",
                "I bought this for my 10 year old",
                "Great quality and perfect size",
                "If you are looking for a pc to do major photo editing etc..",
                "not the laptop for you",
                "If you are looking for a simple laptop that is smaller",
                "This is it!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little computer.",
                "So far so good",
                "Got this for my son for online school",
                "He loves it",
                "Very small and perfect for him."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice laptop for email, word, and light web usage",
                "Bought it as a gift for my dad who usually buys used laptops",
                "He seems to love it",
                "At the time it was just $169 so it was a great deal."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop!",
                "This is a great little laptop! I purchased it for my 10 year old son to play roblox, and other games, and to watch YouTube",
                "He loves it and we haven’t had any problems yet and I bought it back in August",
                "He also used it for remote learning until he got his school issued one and it also worked for that."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good for small laptop",
                "This is a smaller size laptop and works well for a school aged child",
                "Product description says it is a touchscreen, but it is actually not."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Cute and fantastic computer!",
                "This computer is great",
                "It’s screen quality is fantastic! It’s an adorable computer and compact so I can take it anywhere",
                "It’sa quick computer which is what I was looking for",
                "I am extremely happy and would recommend it!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not very good quality",
                "We’ve had this for four weeks and it just quit working",
                "Screen went black, can’t turn it off or on, nothing",
                "We have antivirus software on it and it hasn’t suffered any damage",
                "Very disappointed."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "not for virtu school work",
                "I bought this for my granson to use while doing school virtual",
                "His mother said that it gliched a lot",
                "other that that I guess it was okay."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great Laptop for Kids",
                "This computer was perfect for my middle school boys' e-learning",
                "I was surprised by how small it was, but the body can easily sit anywhere in the house and get their work done",
                "I would not recommend for an adult though",
                "I have small hands and found the keyboard too small for me",
                "But for kids GO FOR IT!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Super slow operating system",
                "I was able to return it and get a full refund which is great, but I would not recommend this",
                "I don't game or anything, just normal internet browsing etc",
                "After a few weeks this computer wouldn't even play a show on Netflix without constantly buffering."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great to have for the price",
                "What I don't like is,I wish that it wasn't windows",
                "Easier to manipulated.over ALL K LOVE it."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        }
    ]
}