{
    "data": [
        {
            "text": [
                "I should at least get three good years out of it before it goes out on me like this",
                "Did get to use it for no more than a few weeks and it stops working now it needs repair going to cost more what cost to buy it"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "They should test their items before shipping",
                "Speakers did not work"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "working good",
                "school"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Nice"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "I need a new MacBook Pro .",
                "It’s missing a file"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Can go a long time with out having to charge it",
                "So far I cannot say i that I don’t like it"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Zero Issues with this MacPro..Great Purchase!!",
                "Perfect........"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great computer for the money!",
                "Great product"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good!",
                "Good laptop!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Fire",
                "Fire"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "as expected",
                "too slow"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "It came early so that made me happy I appreciate it.",
                "Loved!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good",
                "Good"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Computer works fine but the bottom of the computer is in bad condition and has a dent in it.",
                "It’s ok"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "But otherwise it's good.",
                "It makes a scratchy noise whenever I start it up",
                "But otherwise it's good."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Damaged pc",
                "I am still waiting For an answer"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Please let me know when you’re available to send them to store",
                "Not comentes"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great!",
                "works perfectly fine and looks brand new"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Bad Computer",
                "Broke after 1 week"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "I love the laptop it works great for my son"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Very happy.",
                "Exactly what I ordered",
                "Very happy."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great",
                "It’s a great product"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Thank you",
                "Very happy with purchase, thank you."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Awesome :D"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Wish I would've bought from Best Buy",
                "For a refurbished product I'm pretty dissapointed",
                "3 weeks after getting this product the hard drive fails after a simple os update",
                "Costed me $250 to replace",
                "Wish I would've bought from Best Buy",
                "For a refurbished product I'm pretty dissapointed."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Buying stuff off prime",
                "It was ok"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "I am very pleased with my new MacBook Pro",
                "I am very pleased with my new MacBook Pro",
                "Everything works perfectly and the computer itself is flawless",
                "For the money, it was the best investment by far getting a much better quality, more robust computer than what I would have gotten from a big box store, for a much more reasonable cost",
                "For my editing and graphic needs, this computer is perfect!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Upset",
                "MacBook spent work properly have to see back",
                "Kids are upset their Xmas present can't be used"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very bad",
                "I has a knock on the part oh the lid that for the price I think I should be care ful when sending"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Buy new or refurbished?",
                "Was without problems until 30 days in use when the battery died well past the time to return it for refund",
                "Fortunately after 2 visits to 2 different Apple stores, it was replaced."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good mac laptop",
                "Although the laptop is a bit thick due to hard drive instead of SSD, it looks pretty new, no obvious wear",
                "The running speed is fast and smooth for regular applications",
                "And the machine will not be very hot after a long run",
                "Acceptable at this price."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Far better than expected.",
                "The computer just arrived today and is in amazing shape",
                "it's in almost perfect condition",
                "Not that it's an issue at all, the only way I could tell it was used was the packaging it arrived in and the ever so small abrasion marks from being carried in a bag at some point",
                "Far better than I expected, especially for the price",
                "I would definitely buy another one!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Fast laptop and fast delivery",
                "Great product and user experience"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "The quality",
                "The mac has problems, worse product ever"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "This seller does a good job with these little MacBook Pro's",
                "This seller does a good job with these little MacBook Pro's",
                "I'm not sure it was \"like New Condition\", but it was pretty darn good",
                "A couple little scratches I could see at 12 inches away (which is the standard they use for \"like New Condition\"",
                "I expected it to be pretty flawless, but for the price, I can live with the small scratch and my daughter keeps a cover on it at college anyway",
                "I did immediately upgrade the RAM, and the inside was like new...",
                "no dust",
                "I'd give it 5 stars, but there were a couple scratches, mostly on the bottom",
                "I checked the cycle count on the battery, and it was a respectable 72, so it's not been used much",
                "Overall, buy it"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Slow",
                "Computer is slow!!!!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great deal on a great product!!!",
                "Purchased as a gift and it's awesome",
                "I plan on getting me one very soon."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Definitely would not recommend",
                "Additionally",
                "This product was defective, with internal and external damage",
                "Definitely would not recommend",
                "Additionally, the return shipping was covered by the consumer and was extremely expensive",
                "I wish I had never bought it, it was a waste of time and money to return it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "but works like new",
                "I love it",
                "It was refurbished,but works like new",
                "I love it",
                "Only thing is the mouse pad acts up when the temperature changes dramatically"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Piece of junk.",
                "Very dented cover, won't hold a charge, now screen is freezing up, not happy at all with this purchase",
                "Looks like it should have been discarded a long time ago."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Price was a bit high",
                "Good offer"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Exactly what I hoped for.",
                "Got to me on the date expected which is no small feat here on my small island in the middle of the Pacific",
                "Perfect condition and so far runs like a gem."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Crappy refurb.",
                "Does not work",
                "Hardware problem and won't connect to wifi",
                "Never buy refurbished."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "2GB Memory",
                "Overall the computer is amazing however, it states in the description 4GB of memory",
                "When I looked at my memory details it shows only 2GB",
                "So, now I have to buy more memory because 2GB is pushing it with all the items I run",
                "But no damages no scratches",
                "It was practically mint condition besides this little problem."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "great computer",
                "using the laptop as I type this, love apple computers"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great!",
                "I can barely tell that it was previously owned."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Very pleased",
                "Package arrived on time and in original box, with all parts intact",
                "The only way one could tell it was used was that the seal was broken on the box",
                "Very pleased!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great product, I'm actually making the review on the ...",
                "Great product, I'm actually making the review on the laptop I bought",
                "It works like a charm, its like buying a new one",
                "Really!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Works as promised",
                "Works as promised",
                "I was a bit skeptical about this product when I bought it but then it works brilliantly",
                "I also ordered the 16GB DDR3 RAM for this laptop and now it is practically invincible"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Four Stars",
                "My daughter is having a good time putting all her contacts and business dealings and notes on this."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Excellent condition like new upgraded Ram and it flies Highly recommend"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great",
                "Works perfect",
                "Looks brand new",
                "Very happy."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Pretty good just like a new one"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Working great, looked great",
                "Graduation gift for my daughter, she wanted a Mac vs PC",
                "Working great, looked great",
                "just as advertised Great introduction into what Macs can do vs the pcs we have traditionally purchased."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "it is working fine",
                "I would buy again",
                "Overall, so far, as promised",
                "Only 1 complaint: the power cord was damaged and needs to be replaced",
                "It looks as though it's been closed into something and has several spots the wires are coming through causing it to heat up when plugged in",
                "Overall though, it is working fine",
                "I would buy again"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "To be honest I was a little disappointed in the way it was shipped and also there ...",
                "To be honest I was a little disappointed in the way it was shipped and also there were a lot of marks on it from obviously being used a lot",
                "Other than that it seems to work just fine."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I'm In Business!",
                "Opening my own business and needed graphics with phoshop",
                "Like the convenience that all my Apple products can sync as well",
                "I won't use anything but a Mac",
                "Nothing else compares!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Postively Exactly As Advertised! Good Stuff!",
                "So far so good! Great transaction and EXACTLY as described."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Apple is garbage",
                "Using it for a music library but this mc book does not seem to be connecting g yo internet can't get off internet screen it just keeps searching for connection I am returning this laptop its garbage apple sucks I gonna bya comp or hp or Lenovo screw apple"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "arrived as promised works great and now I am a believer in apple"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "I am very pleased KangaSuplly took time to follow up 2 weeks after receiving to ensure no issues.",
                "The computer is great! We ordered this particular computer do use in our home based business",
                "We like MacBook products and have several",
                "Everything in my order was I great shape and is as stated and promptly shipped."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Would not have been able to tell the difference from a brand new one.",
                "I spilled a glass of red wine on my MacBook Pro MC374LL/A from 2010",
                "I was in the process of buying my first home at the time, so a brand new replacement just wasn't in the budget",
                "I decided to put my faith in a refurbished MD101LL/A and I am very pleased with how it all worked out",
                "First, it arrived in the appropriate packaging with all of the relevant accessories",
                "Second, the screen, keyboard and frame were immaculate",
                "No noteworthy scratches, dings or scuffs",
                "Battery life and processing speed were solid from the start up",
                "Anything is an improvement when your last laptop was 5+ years old, but I can honestly say I would not have been able to tell that this was a refurbished unit if it was not advertised as such",
                "I've had it for a few weeks now and couldn't be happier with the decision",
                "Saved myself a few hundred bucks and it exceeded my expectations right out of the box."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great buy",
                "Great product in great condition",
                "Seems like it's brand new",
                "I would recommend this product."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "One Star",
                "Very very bad item so dirty ! ıt is realy looking old."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Good condition👍👍👍"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great",
                "Great condition, works well."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Looks and works like brand new",
                "I could not tell that this is a refurbished Macbook",
                "Looks and works like brand new!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great option when looking to save from purchasing new",
                "Great option when looking to save from purchasing new",
                "It had a minor cosmetic blemish on the case, otherwise was brand new."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Other than that great computer, no problems.",
                "I received product on time in the condition promised",
                "However, after first turning on the computer I found that the password was provided but not the username",
                "This may be obvious to others but I was unaware that the user name was ADMIN",
                "Other than that great computer, no problems."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "I love my mac pro",
                "It runs well just like new",
                "I am happy with my purchase!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "MacBook Pro",
                "The laptop is pretty much as advertised."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "The overall condition of the laptop was good but 2 weeks after purchase it began shutting off ...",
                "The overall condition of the laptop was good but 2 weeks after purchase it began shutting off to a black screen and beeping, eveuntally not turning on at all",
                "Luckily for me, it was still under the 90-day Amazon warranty."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Two Stars",
                "It's an used product with scratches al lover and dents",
                "Wish I knew before buying this product."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Great quality and value."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "One Star",
                "It was full of viruses,had to spend money to get cleaned out before I could use!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great deal",
                "Looks great! Great deal",
                "Quick shipping! Great dealer!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Very good working computer, fast shipping"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Great buy!!!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Great!!!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Exactly as described or better",
                "Great deal!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Excelent deal Thanks"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Bought it for my daughter",
                "I myself didn't not see it but she's thrilled with it."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Buy refurbished",
                "Awesome",
                "Good price",
                "Works great."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "AMAZING",
                "I absolutely love this laptop",
                "I bought it for college and i didnt expect it to be as good as it is amazing quality very happy with this product"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent product",
                "Will buy again",
                "Bought one a gift for my daughter",
                "Excellent product",
                "Will buy again!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good Service",
                "5 Star service",
                "Laptop runs well."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Awesome just what the doctor ordered"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Great product and service, thanks."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Just like a new one!",
                "Excellent condition! It came in a box with the charger and initial user guide",
                "What I loved the most: not even a single scratch or dent! It came with OS X Yosemite and I already updated to El Capitan",
                "Definitely, 100% recommended",
                "Thank you very much! I'm really happy with my purchase!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect for Us",
                "The MacBook is perfect",
                "I'm glad we knew enough to buy only one that is reconditioned by Apple because we have no problems at all."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "One Star",
                "My computer doesn't rebook no more do I have any warranty with product"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Do not buy from this seller",
                "Stated first avai in 2015, system on the computer stated mid 2012",
                "That's a scam"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Great product! Love it!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Doesn't work.",
                "Doesn't work",
                "Had to call Apple and spent hours trying to fix now have to send back and daughter has no computer for college"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I Love It!!!",
                "This purchase was better than I expected, I love it"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Like new! Good battery",
                "Happy with this purchase!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Great."
            ],
            "opinions": [
                [],
                []
            ]
        }
    ]
}