{
    "data": [
        {
            "text": [
                "Five Stars",
                "Great laptop by Apple",
                "Great price"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "perfect!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Good"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Fail",
                "Fresh out of the box and it doesn't work",
                "It won't charge",
                "VERY DISSAPOINTED!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Feels like I bought a new computer",
                "Works perfectly! Had no damage or slowness of any sort",
                "Feels like I bought a new computer!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "One Star",
                "It wouldn't charge"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect! My first Macbook Pro and it's just perfect ...",
                "Perfect! My first Macbook Pro and it's just perfect for college",
                "Like others stated, it's hard to believe how it's refurbished when it's practically new",
                "Plus it's cheaper here than at Apple's refurbished store",
                "Thank you"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Four Stars",
                "Great product."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Works great",
                "Super value -- and I think a better ...",
                "Refurbished product is virtually new",
                "Works great",
                "Super value -- and I think a better product -- than the current generation of Macbook Pro devices",
                "Greater flexibility and more user control",
                "If that is important to you, something like this is a better purchase than a current device."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Don't buy this",
                "Do not buy this only last a year won't turn on gets super hot when it did work and you get electrocuted when plugging it in to charge"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "One Star",
                "This is a VERY old system that can't be upgraded."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Absolutely great computer I received it in two days with great ...",
                "Absolutely great computer I received it in two days with great condition so far I'm very happy with it and the price is great"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "The MacBook looked brand new and has worked with no problems so far."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Great product"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Four Stars",
                "Item was as described and in good working condition"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "BUYER BEWARE! This Seller Deletes or Reports Reviews They Find Displeasing",
                "This item arrived looking cosmetically displeasing as it was dinged, scuffed and severely dented in upper right screen side of the computer",
                "This is NOT a refurbished item as the business definition of \"refurbished\" states",
                "This is, at best, a used, severely damaged computer",
                "Upon powering up this computer for the first time, it took a little over two hours, a tech support call to Apple, a \"first aide\" run, and a factory reset",
                "It worked at a nearly excruciating speed for a few days",
                "I powered it down, in hopes that it would start back up \"refreshed\"",
                "Two days later, I tried to turn it on",
                "It took over three hours of \"turning on\" when I finally decided to make another call to Apple",
                "This is what we did*",
                "(*Please see attached photos, as they are of my notes regarding the most recent phone call.) I have made more than a couple attempts to call the seller; it rings once, if at all, and promptly goes to voicemail",
                "So all in all I have this \"brand new\", refurbished computer that arrived broken, with seemingly no solution available to resolve the issue."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Really good purchase!",
                "I was extremely hesitant to buy this laptop because I read a lot of bad reviews and horror stories about people who purchased refurbished",
                "Well, the laptop arrived today and it was even earlier then expected and when I opened it I was pleasantly surprised",
                "Everything from the power cord to the laptop looks brand new",
                "In fact, the only way you know it's probably not new is because it didn't arrive in an Apple original box; it arrived wrapped (neat and tight) in a white box within an amazon box",
                "It has actual two USB 3 ports, one thunderbolt port, sd card reader, HDMI port, DVD drive",
                "It also has the MagSafe charger, illuminated apple logo, etc",
                "The force trackpad is nice to use, the keys feel fantastic to type on",
                "Screen is flawless",
                "This computer came with macOS Sierra operating system",
                "It runs fairly fast",
                "Apps open almost instantly and the wifi performance is great",
                "I LOVE LOVE LOVE this laptop!!!! Overall this was a wonderful deal",
                "I’m so so happy with this purchase",
                "Thank you Amazon Seller: PrimeBuys"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "wow I'm excited",
                "my son recommended this Mac Pro because he has one",
                "his work fine",
                "its refurbished also",
                "He ordered me one",
                "He was wondering why the price was so cheap",
                "We didn't know if we got a deal or junk",
                "I went back and read the reviews and they were very discouraging",
                "I said when the Mac Pro come in I was returning it immediately",
                "Boy was I wrong",
                "Im very very pleased",
                "Its looks brand New except for a couple of dents barely noticeable at the bottom of the lab top",
                "The keyboard looks brand New",
                "The keys type fine",
                "The lab Top is up to great speed and down loads fast",
                "I love it",
                "I'm so glad that after all of the bad reviews I've read, I'm glad I went with my move and gave it a chance",
                "I'm loving my Mac Pro",
                "It's looks brand new and it works great",
                "Excellent Buy",
                "EveryOne's experience is different",
                "Mines was a great move",
                "My power card look brand new",
                "My Mac Pro was packed tight and labeled FRAGLE handle with care",
                "I'm one happy customer."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "So not worth it, it's trash 🗑️",
                "I brought this for my girlfriend for Christmas she always wanted one and she was starting her youtube channel come to find out this laptop is junk I should of know better than to trust a cheap price like this."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Useless!",
                "When i got it i thought it will be a very good laptop.It was for a year until my battery broke and stayed on 0% for the rest of the day it started lagging and really bad stuff.I then thought apple did a very poor job.I then just bought a Surface Pro 4 and it is way better"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "When I received the computer it looks like a very used",
                "When I received the computer it looks like a very used, scratched deviced..",
                "instead what description says",
                "After 2 days using it started going slow, getting stock",
                "I couldn't returned the macbook because I'm out of the US",
                "Finally my computer doesn't answer, after I turn it on got stock and the screen black...",
                "such a wasted of my money"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Falsely advertised.",
                "This is a mid 2012 model, not from 2015 as the ad suggests."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Horrible Quality - I should have returned it",
                "The Mac was a gift for my daughter, she advised me right after the 30 day return period passed that something was wrong",
                "that the PC is running very slowly and sometimes locks up completely",
                "I wish I had known in time to return it",
                "She has friends with the same type of PC so knows what speed she should be able to expect."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "damaged and dented",
                "The item was advertised as refurbished ",
                "but the item was dropped previously and the whole chassis was bent to the point where the lan port and the charging ports were twisted and you cant even charge the unit",
                "the laptop looked abused and was very dirty and had scratches and dents all over."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "DO NOT BUY",
                "Just waited 2 weeks for this MacBook and when i got it the charger didn’t even work DO NOT BUY"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Small ding in My New Used MacBook Pro, but she works great!!!!",
                "you can't expect a refurbished Mac to be perfect, but besides a small dent on the back side that a case is going over anyways, she is dam near perfect! works great and fully functional! I would buy again!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "trash",
                "trash absolute garbage",
                "first computer i got the system was corrupt",
                "i got a replacement but the replacement came damaged and it looked like someone dropped it",
                "lastly i am unable to download any apps"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Meh.",
                "Dented near batter indicator",
                "Freezes, screen glitches and reboots unexpectedly."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "No Charger Cord",
                "Product is nice, but doesn't come with a charger cord or the original box with information",
                "A little thicker than I was expecting, but runs fairly well for a refurbished product."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Like New",
                "I was a little worried buying a refurbished laptop, however, arrived in like new condition!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Certified refurbished not always good",
                "The numbers keypad didn't work and the screen flickered on start and during scrolling."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Fast shipping and product was great!",
                "Product shipped so fast and was as expected!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great condition",
                "Received it the day it said it would arrive Came In perfect condition no dents or anything Came with 75% battery and charger Works fine"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Worst buy ever full of dents and scratches futhermore I ...",
                "Worst buy ever full of dents and scratches futhermore I cannot update it as the sofware has been tampered with total waste of my money"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Outdated model don’t waste your time",
                "This would be a good deal 10 years ago"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "i like how cool it is"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Found out more about myself from these reviews so...",
                "I bought one of these from someone who was selling both on eBay and Amazon &amp; someone I know bought one of these from the same seller on Amazon &amp; my review of it is that it's far more laptop than I deserve",
                "USB 3.0, FireWire 800, &amp; Thunderbolt 1.0 make for an awesome combo for usage to try and do anything with it",
                "I mean, another reviewer &amp; I shared the same laptop &amp; we both loved it until it was about to overheat &amp; die under my stewardship &amp; got red wine spilled into it under his",
                "We now have the MD101LL/A model the both of us and it was the best thing @ all imaginable",
                "Yes, the MacBook Pro broke eBay's back for my father",
                "But I got a replacement for the MacBook Pro I gave up &amp; so did he",
                "There are some times where that's all that matters, that justice is done in the end."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "AWESOME DEAL",
                "What a amazing deal ! I was skeptical based on mixed reviews but when I opened mine up looks brand new ! So far everything seems to be running good , extremely happy !!!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Apple Mac book",
                "I liked"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Highly recommend",
                "Awesome laptop",
                "Fast shipping",
                "Flawless laptop",
                "Near perfect condition",
                "I upgraded to a SSD and added more memory and now it’s as fast as any new laptop",
                "It came preloaded with Mojave",
                "Great experience",
                "Gonna buy another soon for my son."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Love ❤️ It",
                "I love ❤️ this product and worth every penny!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "If you’re looking just for safari and internet you should buy it.",
                "The product is too old and cannot download apps such as Microsoft word because the internal processor is out of date"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Works Great",
                "I was very skeptical about buying this product after reading the reviews",
                "I got mine in the mail today",
                "When I took it out of the box, I noticed a couple of scuff marks on the bottom",
                "I opened it up and turned it on",
                "It powered right on",
                "I hooked it to my wifi and set it all up",
                "I am using it now to wright this review on amazon",
                "It runs smoothly and efficiently",
                "The screen has no marks or odd spots",
                "The charger and keyboard both work fine",
                "You would not know that it wasn't a brand knew item besides the scuffs on the bottom",
                "I am very happy with this product",
                "I would purchase again."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Expected product",
                "There was no issue in ordering",
                "It's typical apple product",
                "I have great experience with apple products"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Don't buy it, very bad laptop",
                "Very bad quality product",
                "Looking like more than 10yr old and battery backup is less than 15 min",
                "If Amazon will not refund my money then I will go for legal action against Amazon."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not happy",
                "This laptop did not come with the right charger cord",
                "Once the battery was dead we could no longer use it",
                "We are not happy!!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "been sent back several times",
                "A Buying a reconditioned computer is risky, but we thought it was worth the gamble",
                "Wrong!! Have had to send it back twice as it has stopped working and all my stuff was wiped as I hadn't backed it up (we had only had it for 2 months at the time)",
                "It is currently working after all sorts of problems with DPD delivering it and then losing it, but I am not holding my breath and hoping the 6 month warrantee doesn't run out before it stops working again."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Incredulously slow!",
                "I had this exact same model of laptop previously and it was absolutely perfect, worked like a dime, but unfortunately, it got lost",
                "I ordered this refurbished product to replace it, and I was severely disappointed",
                "While the laptop arrived looking perfect apart from relatively insignificant dings, the laptop is incredibly slow",
                "So much so that it is impossible for me to work daily with it, despite having all the patience in the world",
                "It is incapable of opening more than 4 windows without the laptop crashing, and no more than 3 tabs on Safari/Google Chrome",
                "I'm extremely dissatisfied with this purchase and in the process of returning it, nor would not recommend it at all",
                "Don't buy this laptop."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Pristine Condition for its Age",
                "I am very impressed.",
                "Ordered on 12 May, here by 14th, delivered by courier and superbly packaged in a protective airbag and was provided with what seems to be a new MagSafe",
                "It booted from the outset, no issues at all",
                "I have run through various actions and services and all seem to be fully functional",
                "I was particularly impressed with the cosmetic quality: I can't find any dents or scratches, the screen is clear with no obvious dead pixels and the keyboard action is solid so you feel you are typing on a quality mechanical keyboard and not a membrane one",
                "Very impressed for an 8-year-old laptop, CRS - the supplier - provide a detailed checklist carried out before shipping and offer a 12-month warranty, backed by Amazon",
                "So far, I am most impressed and have no hesitation in recommending the supplier and the quality of their service",
                "You will not be disappointed."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Massive Headache",
                "Seemed like a good deal for what you’re getting",
                "But I highly recommend spending more money and getting a product that actually works",
                "For 3 or 4 weeks the laptop worked perfectly but then it started getting slower and slower",
                "It’s gotten to the point it’s barely usable",
                "Today it took 45 minutes to open up PowerPoint",
                "Huge inconvenience, avoid if possible."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Had a day and broke",
                "I've had it a day and already broken, the seller was great as the charger was forgotten to be put in the box, very quick response and sent out for next day delivery, but since charging laptop not turned on again, in contact with seller for this to be fixed again very quick response and very good to looking after you for them 5*"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Slightly disappointing",
                "The battery empties quickly",
                "Deep scratch near to the keypad."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great condition laptop.",
                "Have been using it for a few weeks now",
                "The laptop came in good condition which I wasn’t expecting",
                "Works great for the year of production it is",
                "So far had no complications with it",
                "Would highly recommended buying it if you are unsure wether to go with an refurbished product."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Major signs of usage!",
                "Ad says it is like brand new and doesn’t have much signs of usage",
                "Mine came with a dent and many deep scratches looks horrible",
                "The charger looks so beat up and scratched and came with a broken clip ",
                "Also the light on the charger works only sometimes",
                "Better to buy the other cheaper ones",
                "Not worth the price I would not recommend!!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Buy a new one if you can afford it",
                "Poor battery life returned for better battery and got a worse one than originally had",
                "Also keyboard was full of crumbs stuck underneath keys",
                "Sent back for refund."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Buy you won't be disappointed",
                "Would be faster to boot up with a ssd but would need to be 500 GB",
                "Excellent condition, only superficial dings where underneath on the bottom of the mac and a tiny one on 1 corner, otherwise I'm very pleased with my purchase, takes up to 60 seconds to boot up on its Hdd, and up to now is faultless in computing opening pages as requested",
                "Would buy again."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not Happy",
                "I was very unhappy with this product",
                "Very poor battery life",
                "Maeve B"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent condition",
                "Apple macbook arrived looking like a new macbook not a refurbished one.",
                "Only way to tell was a little wear on the power button, unit was fully charged and came complete with charger",
                "Wouldn't hesitate to use this company again."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Software Upgrade",
                "I bought his product for my son and he reported that the FaceTime and iMESSAGE is not registering",
                "i am wondering if it has to do with the software so i upgraded the IOS but it still not allowing him to register FaceTime and iMessage."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "How my laptop will be fixed?",
                "I brought a MacBook pro in May",
                "It’s now faulty as screen displays a question mark constantly and just recently, does not even turn on now",
                "Just emailed you, so waiting to see how you are going to deal with this for me? Thankyou"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great value, exactly what I expected.",
                "Great item for a used laptop, impressed with the battery life, condition functionality etc",
                "It has a few small scratches but is visually in great condition and I know badly these Apple products scratch",
                "Definitely worth the money."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "great tool",
                "nothing to dislike"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great value",
                "Into 2019 and working like a dream."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Don’t buy",
                "There are obvious marks that it has been used before(see the photos), It won’t find any of the networks I have to go to and that’s pretty annoying, I have to make some kind of networks search for it to let me see the possibilities",
                "Plus the battery is pretty old, I used coconut battery(the application) to see how bad it was, and it was okay(71%) the optimal is 85-90%",
                "Besides all of that it’s good for a 2012 version Update of 2ish weeks - my screen is turning yellow and getting back to normal from time to time for no apparent reason -the Wi-Fi network wont work at all, I went to see a specialist he said that the person who made the repairs must have disconnected the plug inside the computer The more it goes, the more disappointed I am, I won’t recommend this to anyone, it wasn’t worth it"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Expected better.",
                "Heats up very quickly, battery life goes very quickly, very slow, sometimes the mousepad doesn’t work properly and smells funny when it gets hot",
                "Apart from that it’s ok."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good value for money",
                "Looks good, works ok, arrived within 2 days",
                "Early Xmas present"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Can't get any better",
                "For a referb it's perfect"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great bargain",
                "Received it in great conditions",
                "Battery life could be better but for the price I think it’s an overall good deal."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Reliability.",
                "Very good quality body and keys",
                "Smooth operation."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Fast delivery",
                "Lovely product",
                "Really good condition and an extra 6 months warranty"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good",
                "Play football"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent value",
                "Excellent value for money"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Condition is super great for a such six-year old machine! (I am from 2018)",
                "I was very impressed by the quality, and functionality",
                "Only 2 small scratches on the lid, but they ain't really seen",
                "Suggest you buying it before an update is finished on May 2019"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Decent",
                "I was honestly worried because of the negative reviews",
                "It’s been a few hours so far and I think the Macbook runs fine (just 4gb of RAM isnt enough so i’m looking to swap that)",
                "I was also worried because it said “1lithium polymer battery required” and not “included” so i thought i was getting a Macbook with no battery! turns out it has a battery and its looks in really good condition",
                "Just RAM space ran out even before I installed anything",
                "So will add more ram"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Value for money",
                "Ive seen negative comment about this Mac but just so you know it works really fine , I am using it on High Sierra which works great and is as fast as the new Macbook but if u gonna try it on Catalina it might slow a bit since its am old machine , but best suits with High sierra and runs awesome battery life is around 7 hours and perfect condition no scratch ."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Not perfect, but good value.",
                "Product was as described",
                "It was a 2012",
                "Comes with old operating system but can upgrade operating systems by at least a few years",
                "Dont think the 2012 hardware would support the newest operating systems",
                "The trackpad is slightly defective but doesn't cause any real problems",
                "Some people have major issues with refurbished laptops, but its been 2 months, and its doing fine",
                "I use my laptop for basic stuff, nothing fancy",
                "So, theres a risk involved, but new macbook pros are almost $2000, so getting this for $700 was reasonable",
                "I like Macs, because you turn them on and they actually work."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Cigarette Smells",
                "No problems with the parts or pieces",
                "My only complaint is that the thing reeks of cigarettes."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "So far so good",
                "Does the Job have had no issues as of yet."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great deal",
                "Looks great",
                "It only had a scuff on the top from where a case was previously used",
                "It works as expected and was easy to set up",
                "Great deal for something that still retails for a little over a grand."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Terrible Buy",
                "Received my laptop with many issues..",
                "Glitches out constantly have to restart it",
                "Dvd drive doesn't work, can't access app store / iCloud/ or download any apps or updates..",
                "built in mouse pad doesn't work",
                "Worst purchase I have ever made online",
                "DO NOT BUY"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not refurbished",
                "Extremely slow right from the moment i first opened it and tried logging in",
                "Didnt even make it through the initial customizing steps because it would freeze for five minutes at a time when trying to connect with my apple ID",
                "Despite the negative reviews I bought this product expecting a \"refurbished\" computer, there is nothing refurbished about this."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Le produit est arrivé bien emballé et même avant la date",
                "Pour un usage personnel"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Buying the unknown",
                "This is a good buy, but the optical drive does not work",
                "Obviously these refurbished computers are not thoroughly tested before shipment",
                "Someone is slacking."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Defective",
                "Very happy with the overall performance of the computer, however the CD drive does not work, which having to clear all personal data and return it is inconvenient and frustrating",
                "I don’t understand how that could have been missed when the product was tested."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Locked out from network",
                "The macbook was used prior as a router and had a encrypted block in all networks",
                "Therefore I was unable to connect to the internet",
                "I had to take it to be fixed and pay the bill which I feel It should have came ready to use",
                "Not happy as it is for university student who was in dire need of a macbook then and had to wait over a week."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "NO COMPRAR, no hay servicio posventa",
                "No compréis",
                "Lo compré hace un año y no funciona bien",
                "No me dan solución",
                "Pedí la devolución pero dijeron que ya no se podía",
                "Una añito justo."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great Purchase",
                "The device came and it did have 1 small scratch on it, but it works perfectly",
                "Very good value for the money!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Probably should just pay more money and get a new one.",
                "It was not upgraded to the newest iOS that it could have been",
                "I required at least OS high Sierra for my school platforms to run and had to do all the upgrades myself",
                "You would think they would have done this for me in advance",
                "Also the charger they sent me is a ratchet piece of trash."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Regrettable purchase",
                "This MacBook had not been prepared properly for sale",
                "It took a lot of extra work on our part to make it usable",
                "We almost returned it and sometimes still wish we had",
                "It is also VERY slow",
                "Not a good purchase, unfortunately"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Works well",
                "I use the MacBook for school (graphic communication) and it does the job fine",
                "The laptop is a lil slow and display isn't as high quality as current models but it's close enough for the amount you pay for."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "2012 MacBook Pro",
                "It’s a mid 2012 MacBook Pro at a good price it’s good for a year or two even refurbished one"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "working poorly",
                "battery needs to be replaced the the apple store charger $250 for a replacement",
                "suggestions?"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "work like new",
                "Happy it works like new so far Let's see what happens next 3 months performing"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Speed",
                "The laptop is good and fast, but there are scratches on the back."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Requred an update",
                "Didnt have the latest update in it",
                "Free update from apple but, not easy to find huge pain to download"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop",
                "Couole scratches on the too but other than that it's amazing",
                "No problems and I've had it a month or 2 now"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "WAY OVER PRICED FOR QUALITY",
                "The computer I purchased was way over priced for the quality of product",
                "Keyboard letters were dirty still",
                "There are a couple dents",
                "Charging Cord very used....need to purchase a new one",
                "Not happy with this purchase at all."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        }
    ]
}