{
    "data": [
        {
            "text": [
                "GREAT CASUAL USER LAPTOP",
                "Ok, just to get everything out in one sentence: This is the perfect laptop for the CASUAL laptop user! Which is a good thing! This is a great little laptop! for $200 this is a steal",
                "64 gigabytes is enough for windows 10",
                "If you get a 128GB mini SD card, then this laptop will work great for you",
                "Now if you plan on using this to store pictures, videos and other files, for awhile, then you will run out of space (with the laptop alone)",
                "But with a mini SD card or a flash drives to store your files, you'll be fine",
                "If you are a heavy computer user and need it for heavy video editing, photoshop or a heavy gamer, then obviously this won't work for you",
                "I use windows movie maker",
                "It works just fine",
                "This can play light games or games that have been released from the early 2000's (if you play on Steam).",
                "Newer games that need Gforce and what not.",
                "Obviously not",
                "This laptop is for the casual user, but can hold its grounds when using other programs",
                "I have used adobe elements for video editing.",
                "Does it work",
                "yes, it does! is it the best computer to use it on.",
                "haha, no",
                "But it does work on this laptop, though this isn't the idea computer you'd used a program on like this",
                "But if you're on a tight budget and don't mind the laptop taking a few extra moments to process everything, then go for it",
                "The keyboard and the mouse pad works like butter",
                "I love typing on this thing",
                "I've typed on several 11.6\" laptops and had trouble, but I have no problem typing on this",
                "GREAT LAPTOP and VERY HAPPY!!"
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "161",
                            "165"
                        ],
                        "polarity": "positive",
                        "target": "$200",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "0",
                            "12"
                        ],
                        "polarity": "neutral",
                        "target": "64 gigabytes",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Top Choice in this segment",
                "This is the only ultra-book I could find with a 64gb ssd, 4gb RAM, weighed only 2 pounds (actually 2.1) and cost $200",
                "If your expectations are reasonable (i.e",
                "don't expect to find a large screen, don't expect to run intense programs or games) then I think you will be happy with this",
                "The notebook comes with Windows 10S (not windows 10) which can be upgraded free and easily",
                "If the upgrade is not made, then you are limited to the programs/apps in windows' store which is not very comprehensive",
                "The only issue here is that the Windows 10 version the upgrade goes to is 64 bit (not 32) which has compatibility issues with some older programs",
                "I found the eMMC disk drive to be fast, the computer boots in a few seconds",
                "There is a Micro SD slot",
                "256GB micro sd card is only around $25 and is immensely helpful in increasing available storage (buy a name brand only; i.e",
                "microcenter, sandisk, pny, crucial, kingston, etc etc)",
                "The internal eMMC drive or the RAM can not be upgraded",
                "WiFi is strong, the screen is only 11.5\" but is very bright and has very good resolution and color",
                "The USB ports are V 3.x",
                "The keyboard does not feel cramped or compromised in any way despite the small size of the notebook",
                "Too bad it does not have a trackpoint which would be very helpful in navigating more precisely on the small screen",
                "I have only had this so far for a week so I can not comment on durability",
                "The card slot seems a bit flimsy",
                "I have been unable to get anything near the \"whole day\" claim on a battery charge",
                "6 hours is about it but obviously that is still very good",
                "Overall I believe this is a very good choice especially for this price range; this laptop is not much heavier than a tablet but is much more useful",
                "Also, Windows 10 is far more versatile than the Chrome OS, in my opinion anyway."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "48",
                            "56"
                        ],
                        "polarity": "positive",
                        "target": "64gb ssd",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "58",
                            "65"
                        ],
                        "polarity": "positive",
                        "target": "4gb RAM",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "80",
                            "88"
                        ],
                        "polarity": "positive",
                        "target": "2 pounds",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "113",
                            "117"
                        ],
                        "polarity": "positive",
                        "target": "$200",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "29",
                            "35"
                        ],
                        "polarity": "neutral",
                        "target": "screen",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "24",
                            "35"
                        ],
                        "polarity": "neutral",
                        "target": "Windows 10S",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "17",
                            "27"
                        ],
                        "polarity": "positive",
                        "target": "disk drive",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "11",
                            "24"
                        ],
                        "polarity": "positive",
                        "target": "Micro SD slot",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "18",
                            "23"
                        ],
                        "polarity": "negative",
                        "target": "drive",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "31",
                            "34"
                        ],
                        "polarity": "negative",
                        "target": "RAM",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "0",
                            "4"
                        ],
                        "polarity": "positive",
                        "target": "WiFi",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "20",
                            "26"
                        ],
                        "polarity": "neutral",
                        "target": "screen",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "4",
                            "13"
                        ],
                        "polarity": "positive",
                        "target": "USB ports",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "4",
                            "12"
                        ],
                        "polarity": "positive",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "79",
                            "83"
                        ],
                        "polarity": "neutral",
                        "target": "size",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "27",
                            "37"
                        ],
                        "polarity": "negative",
                        "target": "trackpoint",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "4",
                            "13"
                        ],
                        "polarity": "negative",
                        "target": "card slot",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "67",
                            "74"
                        ],
                        "polarity": "neutral",
                        "target": "battery",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Linux mighty mouse at a great price!",
                "I bought this on Prime day to replace an android tablet",
                "Wanted something a little more capable, yet portable",
                "I installed several Linux distros without a hitch",
                "Settled on Mint 19",
                "It's rock stable and runs smooth as butter",
                "I added a 200gb micro sd for data storage and have a 2 tb slim USB HD for more extensive things like video",
                "I haven't found much that this mighty mouse will not do",
                "If you need am inexpensive portable Linux machine, look no further",
                "All you kind folks having winows problems on this laptop, save yourself a boat load of headaches and jump off the Microsoft bandwagon",
                "Try linux",
                "Mint is a great place to start",
                "It will easily handle your web, office and email",
                "I have even edited photos with the (free) equivalent of Photoshop and Lightroom ..",
                "GIMP and Darktable",
                "I understand that there is a place for Windows et al on a more capable machine, but for something this light and portable I have not found a better way to go."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Inaccurate description",
                "I was sent an L203MA",
                "From the first moment, the touchpad was weird",
                "It only was accurate when I started the curser when my finger was 1/2 inch from base of the track pad",
                "Now that may have fixable software problem, but the downloaded driver files specific to this model would not work with it as recommended by ASUS as a possible fix",
                "Now that problem was nothing compared to my main complaint",
                "The From the manufacturer description in Amazon said that this model came with a backlit keyboard",
                "In the ASUS FAQ and later confirmed by the ASUS Chat representative, it did not",
                "I am returning this unit today",
                "I have never given a one star rating and am doing this to make sure that others be aware of the inaccurate description provided in the item’s description."
            ],
            "opinions": [
                [
                    {
                        "target_position": [
                            "11",
                            "22"
                        ],
                        "polarity": "negative",
                        "target": "description",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "27",
                            "35"
                        ],
                        "polarity": "negative",
                        "target": "touchpad",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "89",
                            "97"
                        ],
                        "polarity": "negative",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Zips Right Along",
                "I really, really like this little gizmo",
                "Looks good, feels as solid as one can expect, nice response feel on the keys, crisp display and bright, and lightning fast..",
                "for a reason",
                "First things first, I ripped Windows out of this mini laptop shortly after powering it up",
                "Why? Windows is a memory and resource hog",
                "Secondly, the amount of information they want just to run the laptop outside Windows S mode is ridiculous",
                "Hence, Windows had to go, so it I took it out",
                "In place of Windows I installed Manjaro Linux, based off the Arch Linux distro, using the Xcfe interface system",
                "Both are considered light weight and just seemed perfect for this mini laptop",
                "The OS slid right in without a single problem, it picked up all the hardware on boot-up, and the response times proved better than I hoped",
                "As a test of the battery, I loaded up Youtube with 15 hours of videos and let it run",
                "After nearly exhausting the 15 hours of videos, the laptop battery finally gave up",
                "It impressed me since it played for 14 hours and 27 minutes non-stop",
                "Moreover, the speakers sounded much better than I thought they would",
                "A little tinny, but what could anyone really expect? The laptop never got too warm, either, considering it is a fanless system",
                "It just powered through without a hiccup",
                "After ten days of regular use it seems rock solid",
                "The shakedown period ran without a hitch",
                "The distro comes with automatic updates, so the OS is kept fresh and update",
                "The WiFi range is quite good",
                "I remained connected to my WiFi for just about fifty feet, and the signal needed to pass through walls",
                "The camera is okay, but to be honest I do not use it much if at all",
                "I simply tested it",
                "At just over two pounds, it travels well in my backpack and I use it during my commutes to and from the office",
                "LibreOffice runs like a champ",
                "GIMP runs like a champ",
                "Audicty runs like a champ",
                "KPatience is quick and fun",
                "Firefox with extensions is incredibly fast..",
                "faster than on my main desktop",
                "This is a great little mini laptop and, with the Manjaro OS changes, is worth more than purchase price",
                "I highly recommend it since it proved so amenable to modification",
                "I would definitely buy again",
                "6 Months Later..",
                "I still love this mini-laptop",
                "I use it almost every day",
                "Mostly I use it for writing, streaming music to a Bluetooth speaker, and a little web surfing, and I could not be happier with this machine",
                "I made the right choice of swapping out the OS",
                "I have recommended it to others, and I know of at least 3 other people who purchased one",
                "They also seemed pleased, but I don't want to speak directly for them."
            ],
            "opinions": [
                [],
                [],
                [
                    {
                        "target_position": [
                            "72",
                            "76"
                        ],
                        "polarity": "positive",
                        "target": "keys",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "84",
                            "91"
                        ],
                        "polarity": "positive",
                        "target": "display",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "17",
                            "24"
                        ],
                        "polarity": "positive",
                        "target": "battery",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "14",
                            "22"
                        ],
                        "polarity": "positive",
                        "target": "speakers",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "112",
                            "126"
                        ],
                        "polarity": "positive",
                        "target": "fanless system",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "4",
                            "14"
                        ],
                        "polarity": "positive",
                        "target": "WiFi range",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "4",
                            "10"
                        ],
                        "polarity": "neutral",
                        "target": "camera",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "13",
                            "23"
                        ],
                        "polarity": "positive",
                        "target": "two pounds",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Pleasantly surprised and imprressed",
                "I bought the ASUS Vivo book to replace an HP Stream I purchased at a local chain",
                "As an author, albeit not well-known, I use a laptop primarily for writing",
                "I also create my own graphics and maintain my website",
                "The Stream quickly ran out of storage space, making it a constant (weekly) endeavor to free up space",
                "Then - the death knoll",
                "Not enough space to update Windows 10, and Microsoft would no longer offer service or support for my version of 10",
                "I was unfamiliar with ASUS, having located the Vivo on Amazon",
                "The specs were sufficient for my needs",
                "The bonus of Office 365 for a year was a plus as a 19-year user of Office",
                "Slim and lightweight, easy to carry",
                "Graphics are good, as is sound and compatibility with my desktop",
                "The most impressive feature to me? Power on to ready to use is 10 seconds",
                "The Stream took 30-45 and my aging desktop - up to 2 minutes",
                "For $190 dollars, I am as pleased as I've ever been with a laptop/notebook",
                "I'm even getting used to Windows 10, and I love the Cloud storage",
                "I would recommend to someone on a budget or if your looking for a fast and efficient laptop/notebook, (a pretty nice option)&gt;"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "30",
                            "43"
                        ],
                        "polarity": "negative",
                        "target": "storage space",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "4"
                        ],
                        "polarity": "positive",
                        "target": "Slim",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "9",
                            "20"
                        ],
                        "polarity": "positive",
                        "target": "lightweight",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "22",
                            "35"
                        ],
                        "polarity": "positive",
                        "target": "easy to carry",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "0",
                            "8"
                        ],
                        "polarity": "positive",
                        "target": "Graphics",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "25",
                            "30"
                        ],
                        "polarity": "positive",
                        "target": "sound",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "35",
                            "64"
                        ],
                        "polarity": "positive",
                        "target": "compatibility with my desktop",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "34",
                            "40"
                        ],
                        "polarity": "positive",
                        "target": "budget",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "Warning! Stopped working after two days!",
                "Would give this item 0 stars if possible- needed a small travel computer for a trip I was taking- thought this would be perfect in place of outdated Chromebook I had previously",
                "Received it in seemingly new condition- used it for two days and tried to turn it on on the day we were leaving, and NOTHING- wouldn't charge, turn on, ZERO",
                "(yes, I tried all the tricks) Thankfully was able to run to UPS to return for a full refund (thanks Amazon Prime!), and picked up a slightly larger device (from a different manufacturer) at Best Buy."
            ],
            "opinions": [
                [
                    {
                        "target_position": [
                            "9",
                            "24"
                        ],
                        "polarity": "negative",
                        "target": "Stopped working",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "126",
                            "141"
                        ],
                        "polarity": "negative",
                        "target": "wouldn't charge",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                []
            ]
        },
        {
            "text": [
                "Play WoW at work!",
                "I bought this laptop to leave at work so I can log on to World of Warcraft during my lunch break everyday and work on my character(s) professions",
                "(I installed WoW on a MicroSD card since the 64GB internal drive is not enough room.) I was skeptical WoW would even run, but it does! I turn all the graphics settings all the way down, and get anywhere from 10-45 FPS in the open world, and 5-15 FPS in the cities",
                "This might be my best purchase ever! I cannot wait for WoW Classic!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great unit, but I got a lemon",
                "(It Happens)",
                "&nbsp;ASUS makes great products and when it comes to electronics every now and then you get one that doesn't work",
                "This was my case.",
                "The instruction manual recommends charging for at least 3 hours before running it off the battery alone",
                "I let it charge for close to four hours and it said it was 100% fully charged",
                "BUT when I unpluged the power cord the unit shut right off",
                "And it would not start up unless I plug the power cord back in",
                "I'm guessing the battery was bad or something along those lines.",
                "Anyways, While I had it plugged in and powered up it seemed to be really nice..",
                "It was fast",
                "Setup was easy",
                "It has an excellent display and sound",
                "I have nothing negative to say about this laptop other than the one I received was a lemon and would not power up unless it was plugged in",
                "I ended up returning it the next day and ordered a different laptop",
                "later I'll probably order another one of these, hopefully getting one that works right and I'll do a proper tech review on it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "17",
                            "24"
                        ],
                        "polarity": "negative",
                        "target": "battery",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "5"
                        ],
                        "polarity": "positive",
                        "target": "Setup",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "20",
                            "27"
                        ],
                        "polarity": "positive",
                        "target": "display",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "32",
                            "37"
                        ],
                        "polarity": "positive",
                        "target": "sound",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect portable typing and research station",
                "Wow wow wow",
                "I can't find enough good things to say about this portable powerhouse",
                "I'm a pretty hardcore gamer who also uses a lot of graphics intensive programs like Photoshop and Unreal 4",
                "This laptop..",
                "is not for that",
                "It's for those times away from your high-end programs, where you need 10 chrome tabs open in a coffee shop while you're experimenting with Microsoft Word layouts",
                "It's for when you're out in the woods and want to sort and organize the photos on your camera's SD right then and there",
                "It's for trips where you want to travel light, but still want the world at your finger tips",
                "OK, OK, enough flowery language",
                "Let's get to the pros / cons: Pros: -The keyboard feels great, with a nice balance of being chunky and \"clicky\" while still being compact",
                "Once you get used to its size, it's pretty easy to get close to your fastest typing speeds with minimal errors",
                "-This thing is really light",
                "Maybe I'm too sued to heavier laptops, but seriously, this thing is effortless to bring around",
                "Throw it in a backpack, tuck it under your shoulder, do whatever",
                "This thing is pretty durable from what I can tell, so all that lightness doesn't come at the cost of having to gingerly secure it in a special compartment",
                "Any ol' laptop bag / pocket will do! -The battery life is great! Maybe I'm too used to being tethered to outlets by more power-hungry machines, but I was able to get hours of typing and Chromeing out of this thing",
                "The key I've found (as with most machines) is to keep the brightness a bit low when you're not plugged it, it can make a big difference",
                "-ASUS has always made my favorite laptops and this one is no exception",
                "If you're a fan of ASUS' work, you'll find everything you know and love about and ASUS packed into a tiny package",
                "-The ports, lordy, the ports! So many ports in such a tiny machine",
                "-The screen is far brighter and more colorful than I was expecting",
                "My other laptop is a \"state-of-the-art\" ROG Strix II, with a high color accuracy, high refresh-rate display..",
                "the issue is they never calibrate said displays and they always end up coming out sickly yellow, requiring hours of manual adjusting",
                "Not this little fighter though! Bright and beautiful right out of the box! Color pureists will notice things can get a bit washed out, but it's certainly preferable to the yellow tint of other machines",
                "-The price is the best I've seen for the quality of machine you're getting",
                "This thing is durable, sturdy and built for a few specific things it excels at",
                "It's definitely given my productivity a boost and is well worth the investment",
                "-There was pretty minimal bloatware on the machine, which was great",
                "-Office 360 for a year is a HUGE plus",
                "Also be sure to upgrade the machine to full Windows 10 (from S), the process is free, fast and jarringly painless",
                "Cons: -Even 64 GBs is not a a huge amount of space",
                "This is definitely more of a document and cloud oriented device",
                "If you're hoping to put your entire music library on this thing you're going to need to expand the storage",
                "If storage isn't an issue, than this is probably the book for you! -Similarly the 4 GBs of RAM can make this little engine chug sometimes",
                "Don't expect it to be happy with running 20 chrome tabs at once,n or for it to instantly load pages the moment you click them",
                "It's certainly fast enough, but as someone who's coming from a 16 GB machine the little differences can be noticeable",
                "-The touch pad is ..",
                "OK",
                "It's not terrible, but (much like all touch pads these days) it loses tracking now and then and lacks any real buttons for the left and right",
                "I never much enjoyed touch pads to begin with so maybe I'm biased",
                "Closing thoughts: If you like what you've read, read more reviews and honestly take the dive",
                "If you're looking for a durable portable typer, that can do a little bit of everything this is your machine! More closing thoughts: A story for you, about ASUS laptops..",
                "In winter I got an ROG Strix II, a very powerful and very pricey machine",
                "It was maddening getting the thing to work properly",
                "Getting photoshop to play nice with the dual graphics",
                "Getting the screen to not look yellow",
                "Getting the damn speakers to not crank the bass",
                "Many of these issues are still unresolved and frankly though I love the hardware I'm more than likely going to have to start from square one with that thing",
                "I was all emotionally prepared to go through the same process with this little trail-blazer",
                "I was ready to troubleshoot and troubleshoot and finally get something that mostly did what I needed",
                "To my absolute delight, this machine seems to be the last bastion of PCs that do everything right, everything the way they're supposed to, right out of the box",
                "I haven't had to troubleshoot a single thing about this beautiful laptop and honestly couldn't be happier",
                "If you're looking for something portable, something durable, something to up your productivity and most of all something easy to work with, this is the laptop for you."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "41",
                            "49"
                        ],
                        "polarity": "positive",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "25",
                            "29"
                        ],
                        "polarity": "positive",
                        "target": "size",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "25",
                            "29"
                        ],
                        "polarity": "neutral",
                        "target": "size",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "22",
                            "27"
                        ],
                        "polarity": "positive",
                        "target": "light",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "21",
                            "28"
                        ],
                        "polarity": "positive",
                        "target": "durable",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "63",
                            "72"
                        ],
                        "polarity": "positive",
                        "target": "lightness",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "42",
                            "54"
                        ],
                        "polarity": "positive",
                        "target": "battery life",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "5",
                            "10"
                        ],
                        "polarity": "positive",
                        "target": "ports",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "23",
                            "28"
                        ],
                        "polarity": "positive",
                        "target": "ports",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "38",
                            "43"
                        ],
                        "polarity": "positive",
                        "target": "ports",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "5",
                            "11"
                        ],
                        "polarity": "positive",
                        "target": "screen",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "5",
                            "10"
                        ],
                        "polarity": "positive",
                        "target": "price",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "18",
                            "35"
                        ],
                        "polarity": "positive",
                        "target": "minimal bloatware",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "1",
                            "22"
                        ],
                        "polarity": "positive",
                        "target": "Office 360 for a year",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "12",
                            "18"
                        ],
                        "polarity": "negative",
                        "target": "64 GBs",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "45",
                            "50"
                        ],
                        "polarity": "negative",
                        "target": "space",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "91",
                            "94"
                        ],
                        "polarity": "negative",
                        "target": "RAM",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "82",
                            "87"
                        ],
                        "polarity": "negative",
                        "target": "4 GBs",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "5",
                            "14"
                        ],
                        "polarity": "neutral",
                        "target": "touch pad",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "NIGHTMARE",
                "What a nightmare",
                "Wasted about 5 hours tonight between amazon support and ASUS support",
                "DO NOT buy the amazon warehouse deal",
                "Mine didn’t include Office 365 and when I called ASUS I was told that a previous owner of this device had already used up the office 365 one year free trial that was assigned to my computer’s serial number",
                "On top of that, windows won’t activate due to not having a valid digital license or product key",
                "Even after going through a full factory reset, it’s still not working",
                "Have been back and forth with support all night and now ASUS support system is down and all they can tell me is to try calling back another time",
                "In the meantime, this computer still doesn’t work",
                "I’m about ready to office space this piece of crap and go buy something else",
                "I will never buy a computer from anyone but the manufacturer ever again."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "22",
                            "30"
                        ],
                        "polarity": "negative",
                        "target": "computer",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                []
            ]
        },
        {
            "text": [
                "Heavily dissapointed",
                "I ordered this at the beginning of August 2019, and when I received my order, I saw the laptop and thought \"oh great, this will be useful and handy this year for school.\" It's not a big laptop or anything or very fancy, but its description suited me as a low-income student",
                "Then I tried to use the laptop, only to find out that the version of Windows 10s that was supposed to be on the laptop was a bootlegged version, which heavily affected the usability of my laptop",
                "I have now returned said laptop, but with all the hassle that comes with this, please don't get it",
                "Spare yourself whatever pain."
            ],
            "opinions": [
                [],
                [],
                [
                    {
                        "target_position": [
                            "125",
                            "135"
                        ],
                        "polarity": "negative",
                        "target": "bootlegged",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "172",
                            "181"
                        ],
                        "polarity": "negative",
                        "target": "usability",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                []
            ]
        },
        {
            "text": [
                "Horrible Piece of Junk",
                "Worst purchase ever and experience ever, less than a month after I purchased this PC for my son the power supply died and ASUS refused to replace it",
                "They said I had to send them back the $5.00 power supply before they would replace it",
                "I Had to buy another power supply just to get the PC up and running",
                "After I sent the power supply back they claimed that they never got it",
                "Now mind you the defective power supply was just being shipped across town",
                "The claimed they never got it and that I was responsible to provide them a tracking number",
                "So let me see if I understand this, you want me to spend about $20.00 for shipping and a tracking number to replace a $5.00 power supply",
                "I figured they would just get it since they service center is in Pomona California and not in China",
                "They claim they never got it",
                "Now 7 month later the whole computer is dead",
                "Will not power up, screen is dead yet the Hard Drive light is on",
                "ASUS answer, send the computer back to them and if they determine it was not dropped or abused they might repair it",
                "SAVE YOUR MONEY AND BUY A GOOD COMPUTER",
                "THIS THING IS A PIECE OF JUNK AND NOW I AM OUT ABOUT $200.00 Fortunately I purchased an extended warranty, Unfortunately the extended warranty doesn't go into effect until after this junk warranty expires",
                "Amazon wont do anything other than refer me to ASUS, ASUS tells me I am $H@% out of luck",
                "My only recourse now is to file a complaint with the BBB and take them to small claims court",
                "Horrible Horrible experience",
                "Never again DON'T BY ASUS PRODUCTS, THEY DO NOT STAND BEHIND THEIR PRODUCTS ."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "100",
                            "112"
                        ],
                        "polarity": "negative",
                        "target": "power supply",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "19",
                            "25"
                        ],
                        "polarity": "negative",
                        "target": "screen",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Poor Performance -Not Reliable!",
                "I bought for my son for homeschooling during COVID-19 School closure",
                "In the middle of lessons the computer shuts down",
                "We’re only using google classroom and educational applications",
                "Note: This laptop doesn’t have a touch screen",
                "I don’t think it will work well over time since it keeps shutting down and giving me an error screen",
                "I do not recommend this computer",
                "I need something of better quality",
                "Amazon didn’t help me with the error, they sent me ASUS and I have not heard back",
                "My son needs to complete online exams and I can’t trust this computer."
            ],
            "opinions": [
                [
                    {
                        "target_position": [
                            "5",
                            "16"
                        ],
                        "polarity": "negative",
                        "target": "Performance",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Chromebook Compromise Worth Making",
                "I rather foolishly gave up my very capable Lenovo Thinkpad for a massive HP Omen when I committed to getting rid of my console gaming systems",
                "And love my 17in Omen as I do, I'm damned if that thing is going to travel with me anywhere I need to get some kind of work done when on vacation",
                "Most of my work is cloud based, so I don't need a whole mess of hardware to run what I do",
                "I like Chromebooks, but I did miss the Microsoft ecosystem when I used them, I found",
                "This little thing looks to be just the niche I needed",
                "It's dead small; I carry it around with my iPad Pro for editing photos and videos, and together they almost vanish in a bag",
                "The battery life is pretty spectacular for the work I do on the regular",
                "I did try, just for fun, putting some Photoshop and Lightroom projects on it, just to see how it handled them; eh - better than I thought, but definitely wouldn't recommend",
                "Maybe in a pinch, but I wouldn't lean too heavily on it",
                "The track pad is nothing special",
                "I did eventually concede and buy a wireless mouse to use with it whilst on vacation, but that's probably down to my impatience on certain things",
                "It was definitely better than some trackpads I've used, but nothing like my old Lenovo...(moment of silence for Thinky) All in all, though, I would recommend this to anyone for whom a Chromebook is a viable solution, but doesn't always go where constant connectivity is possible, so local word processing is a must",
                "BTW, I can't really speak to how the Vivobook runs and works in S mode, like it comes out of the gate",
                "I needed some applications that the store doesn't supply, so I switched out of it almost immediately",
                "But I don't doubt it would work just fine, if not even faster",
                "But I never grew fond of Internet Explorer, or the newer browser, so S mode had to go",
                "Even so, 5/5, would highly recommend - just know what you need it for, and if it can meet those requirements",
                "With those in mind, this'll probably do you just fine 👍"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "10",
                            "15"
                        ],
                        "polarity": "positive",
                        "target": "small",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "4",
                            "16"
                        ],
                        "polarity": "positive",
                        "target": "battery life",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "4",
                            "13"
                        ],
                        "polarity": "neutral",
                        "target": "track pad",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "please dont buy this crap it is a total rip off",
                "I ordered this item because it was very slim and light weight and had an average review",
                "I made a big mistake",
                "It is totally bad and useless",
                "There is no battery that works inside the computer",
                "The computer worked for 10 minutes while it was charging",
                "then it wen toff and the battery will not charge and thelaptop will not even start with Ac cable It is a total disgrace for Amazon to sell this product."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "40",
                            "44"
                        ],
                        "polarity": "positive",
                        "target": "slim",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "49",
                            "61"
                        ],
                        "polarity": "positive",
                        "target": "light weight",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "12",
                            "19"
                        ],
                        "polarity": "negative",
                        "target": "battery",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "25",
                            "32"
                        ],
                        "polarity": "negative",
                        "target": "battery",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "One litle Power House !",
                "Ok, so you're tired of carrying around the 100 plus pound laptop when you go on vacation or need to make a presentation",
                "Well, I was there too",
                "This 11.6 in screen ASUS Vivobook L203MA 2 + lbs laptop is great ! It's similar in size to a Chrombook but this has Windows10 home",
                "It's in \"S\" mode (safe) which protects you from outside attacks",
                "The downfall on that is that you're going to want to add some of your programs which will require you to remove the system out of \"S\" mode",
                "(super easy)",
                "One important thing...",
                "I highly recommended spending a little more $ to get the 4GB RAM and 64GB storage model.",
                "It's going to cost a little more but highly recommended !! I also bought along with this a wireless mouse",
                "I also recommended the Sabrent 4-Port USB 3.0 Hub with Individual LED Power Switches (HB-UM43) ",
                "I'm able to plug in my USB CD player, wireless mouse button, and what ever other USB you'll use",
                "In short, I am totally happy with my setup and love the portability for traveling."
            ],
            "opinions": [
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "13",
                            "19"
                        ],
                        "polarity": "positive",
                        "target": "screen",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "5",
                            "19"
                        ],
                        "polarity": "positive",
                        "target": "11.6 in screen",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "41",
                            "47"
                        ],
                        "polarity": "positive",
                        "target": "2 + lb",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "47",
                            "48"
                        ],
                        "polarity": "positive",
                        "target": "s",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Dead on arrival",
                "This didn't work on arrival - it wouldn't do anything",
                "Amazon said they'd call me back the next day but didn't",
                "When I messaged them, they offered a refund...the absolute least they could do",
                "Disappointed with both the product and the service."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "5",
                            "16"
                        ],
                        "polarity": "negative",
                        "target": "didn't work",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "27",
                            "34"
                        ],
                        "polarity": "negative",
                        "target": "product",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "43",
                            "50"
                        ],
                        "polarity": "negative",
                        "target": "service",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "A piece of junk!",
                "I bought this as a backup and unfortunately did not start using it until after the return period had expired",
                "A big mistake",
                "This item rarely runs more than 10 minutes before it crashes",
                "I tried three different browsers and none of them made any difference",
                "I think I'm going to put Linux on it and see if that helps",
                "asus used to make a good computer",
                "If you're looking for a good, small laptop, LOOK ELSEWHERE!!!"
            ],
            "opinions": [
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "53",
                            "60"
                        ],
                        "polarity": "negative",
                        "target": "crashes",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This is junk and difficult to get help",
                "Bought this computer and within 3 weeks it went dead",
                "Made a couple of attempts to rectify through the ASUS website but their site doesn't recognize the serial number and won't let you lodge a complaint without it",
                "This is the second ASUS like this that I've wasted money on",
                "HP - Dell are way better options and much better support",
                "This ASUS is junk",
                "don't waste your money",
                "If you could get decent support it might be different."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "24",
                            "31"
                        ],
                        "polarity": "negative",
                        "target": "support",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "Died after 30 days",
                "Bought this laptop just over 1 month ago",
                "It worked just as expected for the first ~30 days and now it won't turn on",
                "No indication of any problems and I barely used it",
                "It just stopped working",
                "Will be trying to fix it, but I'm not feeling hopeful",
                "Do not recommend this."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "8",
                            "23"
                        ],
                        "polarity": "negative",
                        "target": "stopped working",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                []
            ]
        },
        {
            "text": [
                "It worth the price",
                "Empty slot for adding NVME M.2",
                "I really liked this little machine and for the price, in my opinion is a steal",
                "It is like 20% faster than my mini PC which sports an Intel Celeron N3450 Quad-core",
                "Per my tests with the 64GB eMMC included, even Windows 10 (v2004) is snappy",
                "I also ran Linux on it with no issues, except that the wireless driver needs to be installed manually(tested on Mx Linux for instance)",
                "The sequential reading for the Sandisk eMMC is 316 MB/s and 154 MB/s writing",
                "Once I booted up on the Windows installed, switched from Windows 10 in S Mode to Windows 10 Home for free in the Microsoft App Store and went ahead and activated the Office 365 subscription included for free(1 year)",
                "After that, I cleaned up the disk and installed everything from scratch",
                "The drivers can be downloaded from the official Asus homepage",
                "I had zero issues with Windows 10 20H1(v2004) but when tested version 20H2 (v2009), I had issues with the WIFI connection, so left 20H1",
                "Something interesting on this machine is that there's an empty slot for adding our own SSD NVME M.2",
                "I didn't' test it myself as I didn't have a spare SSD, but there are a few videos where someone could put in a 1TB SSD",
                "The BIOS version included was v302, so one of the first things I did was to update to the latest version v306",
                "I wish it had a backlit keyboard and an IPS screen",
                "That would made it perfect for my needs",
                "It's also very well built to be a cheap laptop",
                "Overall, I would buy it again",
                "[UPDATE 2-3-2021] I installed a 512GB SSD and it worked like a charm",
                "The reading/writing speeds are around 1700/1200 MB/s respectively",
                "I just added a screenshot",
                "I did a triple boot (Windows 10, MX Linux and Chrome OS) using Refind and all it's working fine."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "10"
                        ],
                        "polarity": "positive",
                        "target": "Empty slot",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "47",
                            "52"
                        ],
                        "polarity": "positive",
                        "target": "price",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "22",
                            "31"
                        ],
                        "polarity": "positive",
                        "target": "64GB eMMC",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "166",
                            "198"
                        ],
                        "polarity": "positive",
                        "target": "Office 365 subscription included",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "false advertising",
                "The max resolution is 1366 x 768 and not the advertised 1920 x 1080 pixels",
                "The processor speed is 1.1 GHz instead of the advertised 2.6 GHz."
            ],
            "opinions": [
                [
                    {
                        "target_position": [
                            "6",
                            "17"
                        ],
                        "polarity": "negative",
                        "target": "advertising",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "8",
                            "18"
                        ],
                        "polarity": "negative",
                        "target": "resolution",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "4",
                            "19"
                        ],
                        "polarity": "negative",
                        "target": "processor speed",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "It was a good fellow for two month.",
                "The laptop was good for two month",
                "I lost my final paper because it just powered out when I unpluged it from the charger",
                "I should save it more frequently, but I did not expect it to happen",
                "I read the other reviews and figured that I was not the only one having the issue",
                "Contacted asus and it was slow and painful",
                "They had no idea and no solution for this issue",
                "They asked to send the unit to them and said the whole process will take about a month",
                "I really hope that they have some smart ways to do the customer service other than wasting the customer's time",
                "Also, the customer service call getting disconnected autometically when it passes 30 minutes",
                "I am not sure why, but I had to call back to them explain my situation every time it got disconnected",
                "I loved asus because my n55s laptop which I purchased in 2012 still runs very well",
                "I also bought a asus chromebook in 2015, which still working except the broken screen (i connected it to one of my tv)",
                "However, this time, it was a huge disappointment",
                "Previous review: Great battery life",
                "The screen is reflective and keyboard has no light, but great price and works well",
                "I can code anywhere and anytime now",
                "If you know its capacity and utilize it well, it is the best you can get for the price range."
            ],
            "opinions": [
                [],
                [],
                [
                    {
                        "target_position": [
                            "38",
                            "49"
                        ],
                        "polarity": "negative",
                        "target": "powered out",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "55",
                            "71"
                        ],
                        "polarity": "negative",
                        "target": "customer service",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "10",
                            "26"
                        ],
                        "polarity": "negative",
                        "target": "customer service",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "23",
                            "35"
                        ],
                        "polarity": "positive",
                        "target": "battery life",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "4",
                            "10"
                        ],
                        "polarity": "neutral",
                        "target": "screen",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "29",
                            "37"
                        ],
                        "polarity": "neutral",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "62",
                            "67"
                        ],
                        "polarity": "positive",
                        "target": "price",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "16",
                            "24"
                        ],
                        "polarity": "neutral",
                        "target": "capacity",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "Need help not working after 1 month",
                "What computer two months ago five days after return date will not turn on asking for help from Amazon or seller spent a little over $200 and looking for help or guidance this computer just is not working I will change my review based on helping me or figuring out what the problem is but this is bad business to spend money for a computer does not work please call me at 781"
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "192",
                            "203"
                        ],
                        "polarity": "negative",
                        "target": "not working",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "Good bang for the price, *BUT* has problems",
                "UPDATED FOR LOWER SCORE: So while I think if it works, it's decent for the price, the issue is that over the past few months, I've had unfortunate issues with the laptop just out of the blue not wanting to boot, nor will it charge, or even display the battery light",
                "Literally dead as a brick",
                "However if you let it sit for ~24-36 hours, *then* plug it in, suddenly it will work just fine for another few weeks, boots up and charges like normal, until it happens again of course",
                "I should have sent it in when it first happened, but I didn't and I'm stupid",
                "It always has (at least so far) come back just fine, suddenly being without a computer for a day or two is frustrating, so I would advise caution when getting this laptop, and if it suddenly turns into a brick on you, just send it back and don't deal with the issue, and get something else",
                "I've seen too many people with this same issue get another one that also doesn't work right",
                "Original review: So, while I think this is a good product for the price, I think it's important to know what you're getting in to, and know what you'll be using it mainly for",
                "To start with the good: -Product is *very* light weight, incredibly easy for transporting, but doesn't feel cheap",
                "Great choice if you need to take it with you constantly, IE student, for work, etc",
                "-Boots quickly -I do think the battery is decent",
                "Watching video for hours on end, or doing a lot of things while music on, etc, will definitely shorten the 'all day' claim, but it's not bad for general use, and you'll get *most* of the day (also that all depends on long your day is, right?)",
                "-SD card slot for a little extra storage -Keyboard is good for a small laptop",
                "Normally, in my experience, they are very cramped, this one isn't bad",
                "To think about: -It's not speedy",
                "Watching videos and general web browsing and everyday stuff is about it, I wouldn't even feel very comfortable with 'lite' gaming, so if you think you'll give some of that a shot...",
                "I really wouldn't",
                "-Space is not great",
                "Half of your space is already taken up by the OS, so doesn't leave you with more than ~30 gb",
                "Sd card slot helps, but I would recommend some other kind of external drive or something All in all, if you just need a windows laptop for everyday casual use, and want something very easy to take around with you, I absolutely recommend this one - I use mine all day long for normal browsing and streaming video + music,, but if you think you're looking for something for heavier use, maybe some gaming, or something speedier to run more intense programs, maybe spend a little more on another product."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "75",
                            "80"
                        ],
                        "polarity": "neutral",
                        "target": "price",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "191",
                            "210"
                        ],
                        "polarity": "negative",
                        "target": "not wanting to boot",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "224",
                            "230"
                        ],
                        "polarity": "negative",
                        "target": "charge",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "240",
                            "265"
                        ],
                        "polarity": "negative",
                        "target": "display the battery light",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "43",
                            "55"
                        ],
                        "polarity": "positive",
                        "target": "light weight",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "1",
                            "14"
                        ],
                        "polarity": "positive",
                        "target": "Boots quickly",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "31",
                            "38"
                        ],
                        "polarity": "positive",
                        "target": "battery",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "1",
                            "13"
                        ],
                        "polarity": "positive",
                        "target": "SD card slot",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "42",
                            "50"
                        ],
                        "polarity": "positive",
                        "target": "Keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "22",
                            "32"
                        ],
                        "polarity": "negative",
                        "target": "not speedy",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "1",
                            "6"
                        ],
                        "polarity": "negative",
                        "target": "Space",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                []
            ]
        },
        {
            "text": [
                "An excellent budget notebook",
                "After 1 month of use: What I like-- Much improved over its prior generation (X205TA): Better surface treatment so less messy fingerprints",
                "Plenty of port for connections",
                "Reliable and large-area touchpad",
                "LED indicators are more visible",
                "Battery life &gt; 8 hrs for my daily tasks",
                "Upgrade to Win10 Home is free and easy",
                "Booting into Puppy LINUX is easy and fully functional w/o searching special hardware drivers Some disappointments: 1",
                "The USB-C is gen 1 that won't support \"Alternative Display Mode\"",
                "2",
                "The LCD is 1366x768",
                "But it was advertised in the comparison table as 1920x1080 ",
                "See link and scroll to the comparison table",
                "\"https://www.amazon.com/gp/product/B07N6S4SY1/ref=ppx_yo_dt_b_asin_title_o01_s00?ie=UTF8&amp;psc=1\" 3",
                "Top surface coating isn't scratch resistance",
                "Remember not to put it against something too hard",
                "4",
                "HDMI output support 4k but it is very slow and unusable",
                "It is fine however for 1920x1080 output."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "93",
                            "110"
                        ],
                        "polarity": "positive",
                        "target": "surface treatment",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "10",
                            "14"
                        ],
                        "polarity": "positive",
                        "target": "port",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "24",
                            "32"
                        ],
                        "polarity": "positive",
                        "target": "touchpad",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "0",
                            "14"
                        ],
                        "polarity": "positive",
                        "target": "LED indicators",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "0",
                            "12"
                        ],
                        "polarity": "positive",
                        "target": "Battery life",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "4",
                            "9"
                        ],
                        "polarity": "negative",
                        "target": "USB-C",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "4",
                            "7"
                        ],
                        "polarity": "negative",
                        "target": "LCD",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "11",
                            "21"
                        ],
                        "polarity": "negative",
                        "target": "advertised",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "11"
                        ],
                        "polarity": "neutral",
                        "target": "HDMI output",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                []
            ]
        },
        {
            "text": [
                "Update: A great portable notebook for grade school and elementary school kids.",
                "Update: Bought this in August and it is now only April, and the battery keeps blinking which prevents the computer for turning on you have to do a hard reset to get it to come back",
                "It does not lose any data but it is very confusing for a 10-year-old I bought this little nap book for my 10-year-old son so he can do his schoolwork, his school already get some Microsoft word for free, but it does come with a subscription",
                "He plays a game that we installed called the adventure Academy that is educational",
                "And he seems to play Roblox just fine",
                "We haven’t used it much without it being plugged in at his computer desk, but it is very light and portable, we actually use something very similar in the school systemA great portable notebook for grade school and elementary school kids",
                "I recommend using an online drive like Microsoft one drive, Google Drive to store your files and to free up space",
                "This is no bigger than a sheet of printer paper, which makes it very convenient to fit in the backpacks, I do recommend using a laptop sleeve when storing it in a backpack"
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "64",
                            "71"
                        ],
                        "polarity": "negative",
                        "target": "battery",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "89",
                            "94"
                        ],
                        "polarity": "positive",
                        "target": "light",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "99",
                            "107"
                        ],
                        "polarity": "positive",
                        "target": "portable",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                []
            ]
        },
        {
            "text": [
                "Great light-weight notebook!",
                "This notebook is great! We got one for each of our kids for their schoolwork, and my wife liked it so much I got one for her as well",
                "These work so much better than the HP stream!! The build quality is nice, and the battery lasts all day! I took one on a business trip where we were doing a lot of document collaboration, typing all day long",
                "It lasted all day! I highly recommend getting a micro sd card to store all your files on, leaving the small (64gb) hard drive for programs only",
                "Some people have complained about the laptop suddenly not turning on",
                "We have experienced that from time to time, and don't know what causes it",
                "The solution is to hold the power button down for about 40 seconds, release it, and then press it again normally",
                "It usually fixes the problem",
                "These computers are not for gaming, heavy photo editing, or video editing (though my kids do make stop-motion lego videos with them)",
                "They are meant for internet browsing, creating and editing documents, watching videos, and writing emails",
                "The webcam is slightly better than awful, but it gets the job done for zoom, skype, etc",
                "The audio is good, and the realtek software allows you to select whether you have connected headphones, a headset, or microphone",
                "This allows you to plug in a microphone for a zoom call, but use the computer speakers for listening",
                "We are very pleased with this computer for this price! Nathan"
            ],
            "opinions": [
                [
                    {
                        "target_position": [
                            "6",
                            "18"
                        ],
                        "polarity": "positive",
                        "target": "light-weight",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "51",
                            "64"
                        ],
                        "polarity": "positive",
                        "target": "build quality",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "82",
                            "89"
                        ],
                        "polarity": "positive",
                        "target": "battery",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "115",
                            "125"
                        ],
                        "polarity": "neutral",
                        "target": "hard drive",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "4",
                            "9"
                        ],
                        "polarity": "positive",
                        "target": "audio",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "48",
                            "53"
                        ],
                        "polarity": "positive",
                        "target": "price",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "Stopped working after 9 1/2 months",
                "Worked great until it died",
                "Screen went black",
                "Would not boot up again",
                "It was under warranty",
                "Sent it to ASUS for repair",
                "They do NOT have an address for repairs so I sent it to corp w/all the data",
                "Now they say they don't know where the item is ",
                "They apparently have not read my 3-4 emails because their responses to mine are completely non sequitur",
                "I wonder if anyone is there or if the customer service response is simply computer generated",
                "It is as bad as their help page",
                "\"A circular maze of blah blah.\" Their return (RMA# link) didn't work and they have no tech repair address to return the laptop for repairs",
                "In addition you are hard pressed to find a \"Real customer service e mail\"",
                "I asked them to find it,fix it or refund my money",
                "A real waste of time",
                "6/2020 Up Date: They found the laptop and according to customer service it is being repaired",
                "They will let me know when it is repaired",
                "UPDATE: 7/2/2020 They repaired the laptop",
                "It works well",
                "I am very pleased w/the product over all",
                "Hope it lasts."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "38",
                            "54"
                        ],
                        "polarity": "negative",
                        "target": "customer service",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent Linux daily driver",
                "I needed to replace my old Gateway netbook so I gave this one a try, and liked it so much I immediately bought a second for my partner",
                "The first thing I did for both was to rip out Windows and put a proper OS in place, in this case Arch Linux, which installed without a single hiccup",
                "Admittedly this is not a powerful computer",
                "However, for daily tasks (web, email, IM, music/video, office, web editing, coding) it's pretty ideal",
                "It's very light, has excellent battery life and a responsible keyboard, and with a lightweight DE (i3 or xfce) it doesn't give me any trouble even with several dozen browser tabs open",
                "In short, a great little computer for my needs at a great price."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "10",
                            "15"
                        ],
                        "polarity": "positive",
                        "target": "light",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "31",
                            "43"
                        ],
                        "polarity": "positive",
                        "target": "battery life",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "62",
                            "70"
                        ],
                        "polarity": "positive",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "58",
                            "63"
                        ],
                        "polarity": "positive",
                        "target": "price",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "DO NOT BUY THROUGH AMAZON WAREHOUSE",
                "DO NOT BUY THIS USED FROM THE AMAZON WAREHOUSE",
                "I wish I had read the earlier review about this",
                "Though there is no indication in the description, the Amazon Warehouse version of this product does not come pre-loaded with Windows (meaning no Windows S Mode or Windows Home)",
                "The computer will promote you to activate Windows but there is no Product Key provided by Amazon",
                "Check the other one star review on here that details the issue",
                "I've gone through 2 returns now, and I cannot get a usable laptop",
                "Amazon will have you talk to Microsoft, who will have you talk to Asus, and they will give you a product key but it won't work unless you have the recovery media for your laptop (not included in warehouse laptops apparently)",
                "Basically, if you buy the Amazon Warehouse version, you will most likely need to by a copy of Windows",
                "DO NOT BUY THROUGH AMAZON WAREHOUSE."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Super compact, awesome battery life, handles Win 10 and basic productivity apps no problem.",
                "If you loved the portability and battery life with your chromebook but missed some features of Windows, this is perfect",
                "I took mine out of S mode (prompted to do so when downloading 3rd party software)",
                "It runs spreadsheets, word processors, and anti-virus software with no issues",
                "Video streaming, web surfing, email, Roblox with kids, no problem",
                "Goes all day without a charge",
                "Smaller than an 8x11 sheet of paper",
                "Fires up as fast as a chromebook",
                "Keyboard works great",
                "In love with this machine!"
            ],
            "opinions": [
                [
                    {
                        "target_position": [
                            "23",
                            "35"
                        ],
                        "polarity": "positive",
                        "target": "battery life",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "6",
                            "13"
                        ],
                        "polarity": "positive",
                        "target": "compact",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "17",
                            "28"
                        ],
                        "polarity": "positive",
                        "target": "portability",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "33",
                            "45"
                        ],
                        "polarity": "positive",
                        "target": "battery life",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "8"
                        ],
                        "polarity": "positive",
                        "target": "Keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                []
            ]
        },
        {
            "text": [
                "Awesomeness",
                "It is perfect for me to go back to school with thank you very much."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "It was everything I wanted and then some!",
                "I’m a final year medical student and I was really struggling to use my 7 year old laptop",
                "I was hoping it would be good enough to just study for my last board exam before graduating but it couldn’t even open web pages reliably! And literally took 5 mins to just turn on",
                "I found this laptop on amazon and watched a ton of review videos",
                "It was super cheap so I was wary, I was concerned it would be unreliable",
                "But ultimately I went for it, and boy was that a great call",
                "It comes with a free year of office so in my head I knock $80 off the price because I was paying for office anyways",
                "So that knocks the price down to $190 for this laptop",
                "At $190 this is an incredible value proposition! It has a monster battery life and it’s great for",
                "- Webpages - Osmosis - Boards and Beyond - OnlineMeded - Uworld - NBME practice exams - Anki, without the media files though - MyEras and everything else regarding license applications and residency",
                "You can open a ton of tabs at once with no issues at all",
                "- I definitely suggest buying a small SD card and using that to store everything off the actual emc thing",
                "Some minor issues It’s $190 so it’s not gonna be a MacBook Pro or anything",
                "But the issues are minor if you’re just looking for something to study with and take care of basic computer work",
                "- trackpad gets a bit stuck occasionally but nothing that causes a major issue",
                "- keyboard isn’t backlit but that’s not something you can expect at this price point",
                "- it’s most useful in S mode I think, I haven’t tried to take it out of S mode because I’m not sure how well it would handle it",
                "And it works well now so I don’t feel the need to try",
                "When I was looking for reviews I was worried about the compatibility with the programs I would need to use",
                "If you’re in med school and you just need something cheap and reliable to study",
                "I give this a 100% endorsement for the price point",
                "I’m very pleased with this purchase, so much that I’m writing my first review! I think this would work well for most other uses as well but as I’ve never used it in any other capacity I can’t really speak to that",
                "I’m definitely a big fan of Asus now!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "13",
                            "18"
                        ],
                        "polarity": "positive",
                        "target": "cheap",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "16",
                            "35"
                        ],
                        "polarity": "positive",
                        "target": "free year of office",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "30",
                            "47"
                        ],
                        "polarity": "positive",
                        "target": "value proposition",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "66",
                            "78"
                        ],
                        "polarity": "positive",
                        "target": "battery life",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "2",
                            "10"
                        ],
                        "polarity": "negative",
                        "target": "trackpad",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "2",
                            "10"
                        ],
                        "polarity": "neutral",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not a touch screen, max resolution is 1366x768.",
                "I'll start with the happy surprises",
                "First, you can easily remove the \"S mode\" aspect and upgrade to full Windows 10 64 bit in seconds",
                "Second, the processor ( cpu ) IS actually 2.6ghz despite some reviews saying otherwise",
                "It is just designed to only boost up to 2.6ghz when that much processing power is needed",
                "The bad news is despite being tagged as a touch screen, it is not",
                "Its maximum resolution is also not 1920x1080 as suggested multiple times",
                "I found this product through the \"Item comparison\" list where it says 1920x1080 and that was a big part of the reason I bought it",
                "As a result of the multiple examples of misleading advertising, I will be giving this one star less than I feel it would deserve otherwise."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "12",
                            "22"
                        ],
                        "polarity": "negative",
                        "target": "resolution",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "40",
                            "62"
                        ],
                        "polarity": "negative",
                        "target": "misleading advertising",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "Hardware and Software Issues",
                "Really wanted to like this",
                "I have 2 other Asus products that are true to the Asus tagline \"Incredible\"",
                "This machine is still \"in search of incredible\"",
                "Volume buttons were DOA",
                "Plastic case looks well constructed but it transfers fingerprints so efficiently that I don't think I have to wash my hands anymore to avoid Covid-19",
                "Windows S should be called SOS or perhaps POS",
                "Very limited app store for this OS",
                "Won't run 32 bit apps which I absolutely need",
                "Yes you can replace S with W10 and run 32 bit but the system runs like a drunk and blind pig under the resource hog that is W10",
                "Office is not free and neither is cloud",
                "Keyboard is not backlit",
                "I have an Asus ALUMINUM case Chromebook, backlit keyboard, FREE office, FREE cloud and the OS is lighting fast and feather light",
                "This machine cost $50 more and has none of those",
                "It's basically an overpriced Chromebook without any of the benefits."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "12"
                        ],
                        "polarity": "negative",
                        "target": "Plastic case",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "21"
                        ],
                        "polarity": "negative",
                        "target": "Won't run 32 bit apps",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "8"
                        ],
                        "polarity": "negative",
                        "target": "Keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "18",
                            "28"
                        ],
                        "polarity": "positive",
                        "target": "overpriced",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "Bought 3 of these, all of them work great",
                "First, due to Covid the prices on these got escalated",
                "These are typically $190ish and that's the price I bought them all at",
                "At this price these are really good",
                "This is perfect for doing school work and there is a micro SD slot that you can buy 128gig micro SD's for 16$ here on amazon and upgrade the storage",
                "I did that on all of them and its more then enough storage for my kids school work",
                "There has not been a single issue on any of them and they all run quick",
                "Please note this is a protected windows 10 operating system which means you can not run aftermarket (non Microsoft) software to protect the systems by default from corrupt applications",
                "Again, this is perfect for kids",
                "At the 190$ price point these are an excellent buy and I definitely recommend."
            ],
            "opinions": [
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "8",
                            "13"
                        ],
                        "polarity": "positive",
                        "target": "price",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "12",
                            "17"
                        ],
                        "polarity": "positive",
                        "target": "price",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "Not bad so far",
                "I've been using this computer for a few days now and have enjoyed it",
                "I'm not tech-savvy by any means, so this will be a review from a regular old user",
                "The Good: -Inexpensive -Easy setup -Quiet keyboard -Nice, clear picture -Plays streamed movies well (Hulu, Prime, and YouTube tested) -The battery lasted for HOURS (so far)",
                "I initially charged it for the recommended 3 hours before using it",
                "-Hooks up fine to a hotspot and wifi -Works well with collegiate school work (I am 100% online and mostly use Microsoft 365/Office/Word/PowerPoint etc.) -Lightweight &amp; compact The Bad: -The screen is GLOSSY -The touchpad lags when I'm scrolling for longer periods -Low internal storage space (I save on various clouds but you will definitely need external storage space for apps/updates) Overall, it is very basic and perfect for those light users like myself",
                "It's inexpensive, user-friendly, and decent for the price",
                "It is lightweight and compact",
                "I will try to do a review at a later date, but for now, everything is in order, and I am enjoying my new laptop :)"
            ],
            "opinions": [
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "11",
                            "22"
                        ],
                        "polarity": "positive",
                        "target": "Inexpensive",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "42",
                            "50"
                        ],
                        "polarity": "positive",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "64",
                            "71"
                        ],
                        "polarity": "positive",
                        "target": "picture",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "139",
                            "146"
                        ],
                        "polarity": "positive",
                        "target": "battery",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "32",
                            "36"
                        ],
                        "polarity": "positive",
                        "target": "wifi",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "154",
                            "165"
                        ],
                        "polarity": "positive",
                        "target": "Lightweight",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "172",
                            "179"
                        ],
                        "polarity": "positive",
                        "target": "compact",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "194",
                            "200"
                        ],
                        "polarity": "negative",
                        "target": "screen",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "216",
                            "224"
                        ],
                        "polarity": "negative",
                        "target": "touchpad",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "273",
                            "295"
                        ],
                        "polarity": "negative",
                        "target": "internal storage space",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Started out fine, ended up stuck to a wall",
                "I bought the laptop specifically so I wouldn't have to be stuck at my desk, on my desktop, when I wanted to work on things",
                "Started out just fine, too",
                "I was able to carry it anywhere I needed, because the design leaves it VERY lightweight, and the battery life was pretty decent",
                "Or, rather, the battery life used to be decent",
                "About a month or so in, the battery stopped charging",
                "At least, the laptop SAYS it doesn't charge",
                "I've done a few test runs to see if it's charging and just...not registering that it is, but the conclusion is still up in the air",
                "As it is, I'm stuck connected to a power outlet, since the battery life is stuck at about 12 or 20%",
                "It says it won't charge, the battery isn't a removable one so I can't just replace it to see if that's the issue, and I've followed about 10 different guides online to see if it's some program issue and none of them have fixed it",
                "So now I'm stuck with a less-powerful-than-a-desktop laptop that has to always be plugged in/can't be used as a laptop should be",
                "I liked the laptop, which was the sad thing",
                "Now it just sits and collects dust since my desktop is superior in every way anyway."
            ],
            "opinions": [
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "76",
                            "87"
                        ],
                        "polarity": "positive",
                        "target": "lightweight",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "97",
                            "109"
                        ],
                        "polarity": "positive",
                        "target": "battery life",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "36",
                            "52"
                        ],
                        "polarity": "negative",
                        "target": "stopped charging",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I use this laptop for everything",
                "I initially got this laptop to do minor work (Word, canvas, picmonkey, advertising) but I pushed it a bit further and play League of Legends",
                "It runs! There are moments when the game loads up and the window seems like it closed out, but that's only for 5 seconds and you're in the game",
                "I highly recommend if you're looking for a laptop for light gaming and work"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This thing is pretty bad",
                "It doesn't have touch screen for 1",
                "It is small so portability is good, however it still runs in an aspect ratio that makes visuals hard to see, but that's not my main complaint",
                "I bought this refurb a few days prior to a trip because I needed it for my trip",
                "I got it late and couldn't use on the trip",
                "So I got home and attempted to test it just to find out that it can't run anything",
                "The CPU is so slow it runs at 100% with just windows applications running",
                "Let ne elaborate",
                "I set this computer up, did all the updates\\installs and it runs so slow with nothing installed or running just the windows processes, that I can't even load up edge to Install Chrome, This computer belongs in 1995 running Windows 94 because it's THAT slow",
                "Unfortunately by the time my trip was over I had missed the return policy deadline so I kind of got screwed",
                "Moral of the story unless you want a drink coaster or a paperweight (that's what I use it as now) DO NOT BUY IT!!!!!!!!!"
            ],
            "opinions": [
                [],
                [],
                [
                    {
                        "target_position": [
                            "15",
                            "26"
                        ],
                        "polarity": "positive",
                        "target": "portability",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "64",
                            "76"
                        ],
                        "polarity": "negative",
                        "target": "aspect ratio",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "3",
                            "7"
                        ],
                        "polarity": "negative",
                        "target": " CPU",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good small, light laptop..",
                "flaky touchpad",
                "By far the nicest feature of this laptop is it's portability",
                "It's *extremely* light compared to other similarly-sized laptops I've used",
                "The keyboard is decent and has good key size/spacing so you can do normal typing without feeling like you need to compensate for the size of the keyboard",
                "Performance is adequate for most everyday tasks; surfing the web and reading/answering emails",
                "The only negatives are the screen and touchpad",
                "The screen is just \"ok.\" It doesn't seem to have great contrast even when adjusted using the Intel Graphics app for this hardware",
                "The display is also just not quite as crisp as other laptops I've used",
                "By far the biggest negative is the touchpad",
                "It seems to randomly stop tracking when you move the mouse around the screen or try to scroll using two fingers",
                "Sometimes it works fine, but intermittently (enough to be annoying at every usage), it stops responding, then starts up again a second later",
                "I've read many discussion boards and it seems this is a known issue with ASUS touchpads",
                "All Windows updates are being automatically installed and it says it's up to date",
                "I tried uninstalling/reinstalling drivers (including the ASUS Smart Gestures app), changing the Windows settings for the touchpad by setting it to maximum sensitivity but the problem persists",
                "It's not quite bad enough to suffer the restocking fee and return it, but it really does need to be corrected by ASUS",
                "I have no idea if it's a hardware or software issue",
                "I would say overall it's a decent laptop, but if I were doing it over again, I'd probably look elsewhere primarily due to the annoyance of the touchpad."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "6",
                            "14"
                        ],
                        "polarity": "negative",
                        "target": "touchpad",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "49",
                            "60"
                        ],
                        "polarity": "positive",
                        "target": "portability",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "17",
                            "22"
                        ],
                        "polarity": "positive",
                        "target": "light",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "4",
                            "12"
                        ],
                        "polarity": "positive",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "0",
                            "11"
                        ],
                        "polarity": "neutral",
                        "target": "Performance",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "27",
                            "33"
                        ],
                        "polarity": "negative",
                        "target": "screen",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "38",
                            "46"
                        ],
                        "polarity": "negative",
                        "target": "touchpad",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "4",
                            "10"
                        ],
                        "polarity": "neutral",
                        "target": "screen",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "55",
                            "63"
                        ],
                        "polarity": "negative",
                        "target": "contrast",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "4",
                            "11"
                        ],
                        "polarity": "negative",
                        "target": "display",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "35",
                            "43"
                        ],
                        "polarity": "negative",
                        "target": "touchpad",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Glossy cover",
                "Just be careful if you care how it looks, the cover scars easily, I carried this in a nylon stuff sack in a backpack",
                "The laptop was next to my back and it's top, the glossy top, was next to a camera in a camera bag with 1/2\" of foam between its inner and outer nylon material",
                "The camera is expensive so the whole kit was treated gently but the cover of this laptop got abraded by contact with the camera through 3 layers of nylon and 1/2\" of foam",
                "The only pressure was the weight of the camera and the mutual weight of the items pressing against each other in a lightweight strings-for-straps type backpack",
                "The gloss of the cover was abraded so it has random marks on it, disappointing when I was treating it about as well as practicable",
                "I guess I could leave it at home in its box."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "46",
                            "51"
                        ],
                        "polarity": "negative",
                        "target": "cover",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "68",
                            "73"
                        ],
                        "polarity": "negative",
                        "target": "cover",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "17",
                            "22"
                        ],
                        "polarity": "negative",
                        "target": "cover",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                []
            ]
        },
        {
            "text": [
                "dead after 7 mos",
                "It will no longer turn on",
                "There is no information on how to get help, if you click the support key you just get a list of features",
                "This should be under warranty but you can't reach anyone to utilize the warranty",
                "This laptop was purchased 7 mos ago and it is just dead",
                "Disappointed in the quality and customer support."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "20",
                            "27"
                        ],
                        "polarity": "negative",
                        "target": "quality",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "32",
                            "48"
                        ],
                        "polarity": "negative",
                        "target": "customer support",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "Writing papers and watching academic presentations? This laptop is for the academic yo.",
                "I needed a typewriter with internet access for school and got just that for less than $200",
                "Videos take a few extra seconds to a minute to upload and all my files are saved to the cloud, backed up on a 32 GB microSD",
                "I haven't owned a computer in years, what can't you do on a smartphone or tablet? This fit the niche for a compact device with a full keyboard and screen large enough to split between Word and researching online journals",
                "Only dig, wishing it had a backlit keyboard as I do most of my work at night and the smaller keyboard messes with my muscle memory."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "35",
                            "43"
                        ],
                        "polarity": "negative",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "93",
                            "101"
                        ],
                        "polarity": "negative",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "Great except keyboard doesn't backlight and numberpad is disappointing",
                "EDIT: Ok, so i rescind what i said about the number pad...i guess i was hitting the keys to hard and not turning it on/off properly...so like i just figured out that you just barely have to touch the pad and to turn on/off you have to leave your fingertip on the on/off button for just half a second longer than you think you would need to...i think i will actually love this number pad eventually (need to get a mouse first- turning it on/off a bit annoying but you can still use the pad as mouse with it on but it gets hard to know what youre doing if youre entering a password for example and cant see what youre typing) Battery is great, overall really perfect for my needs",
                "Screen could be a little better but makes sense its a trade off for the long battery life",
                "What I don't like is that i thought the number pad would be amazing but it pretty much just doesn't work at all",
                "Also, I thought the keyboard would be backlit and it is not!"
            ],
            "opinions": [
                [],
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "6"
                        ],
                        "polarity": "neutral",
                        "target": "Screen",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "77",
                            "89"
                        ],
                        "polarity": "positive",
                        "target": "battery life",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "20",
                            "28"
                        ],
                        "polarity": "neutral",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "20",
                            "28"
                        ],
                        "polarity": "negative",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "If yours goes dark, do a hard boot to fix.",
                "I received and set up the computer with no problems",
                "After using it for a week or two, I closed it down and used my other computer, a desktop, for two or three weeks",
                "Just now I powered up this ASUS laptop and after signing in, it went into sleep mode",
                "I got it to wake up again and rebooted it",
                "After going into sleep mode a second time, I once again pressed the on button and it remained dark",
                "After pressing it again, the screen came up a deep blue with the white mouse arrow visible, but nothing else appeared",
                "A Google search turned up the fix: Unplug it from the power source",
                "Press and hold down the on button for several seconds, or until the machine totally shuts down and the light goes off",
                "Then press and hold down the on button until the machine boots up again",
                "That's what fixed my problem."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Well it lasted 4 days, then died.",
                "I was impressed at first, needed to by a Windows based laptop to run a certain program I need for my business",
                "Tried to turn it on today and nothing, power adapter cable plugged in, dead",
                "So Amazon is great and they are sending me another one asap",
                "I hope this is just one of those things that this ASUS was defective",
                "I have built many computers in the past using ASUS motherboards and they were bullet proof",
                "This lasted 4 days!!!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not sure about buying it",
                "Had to send it back battery dose not charge"
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "20",
                            "27"
                        ],
                        "polarity": "negative",
                        "target": "battery",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "S Mode",
                "I had no idea what to expect with this computer",
                "I was just excited to have a windows computer instead of a Chromebook but I was wrong",
                "It's very frustrating",
                "I kept trying to get out of S mode and nothing was working it kept telling me something went wrong",
                "That right there was the biggest stressor",
                "And I also didn't care for the mouse it was very touchy",
                "I don't like it",
                "That S mode thing is really dumb",
                "I don't recommend this laptop to anyone."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "31",
                            "36"
                        ],
                        "polarity": "negative",
                        "target": "mouse",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "So far so good",
                "I have only used this product for a little over a month",
                "I don't require a lot from my small computer",
                "I have a desktop on which I conduct most business",
                "I don't game, I am not on any social media, and I rarely stream programming",
                "Price and size were major considerations in my decision to purchase this laptop",
                "Reviews were ok and most complaints addressed things I don't do on my laptop (gaming, data storage, and etc.) There isn't a huge choice among laptops with displays under 13\"",
                "This one is under 12\" and very light",
                "It does NOT have touchscreen",
                "It's streaming capability meets my needs",
                "There has been no problem watching a program without audio interruptions and/or video freezing up",
                "WINDOWS NOTE: I'm not tech savvy but I was able to update from the Windows 10 OS easily",
                "(If you don't do this, you can't download any non-Google apps.) I had a very hard time registering the product",
                "I kept getting to the point of submitting and I could get no further",
                "I emailed customer support for advice and they got back to me within hours with a link through which I was able to register",
                "I would recommend this computer if your expectations are similar to mine",
                "It is pretty basic and it has been easy to use",
                "I haven't tried features like the SD card or the HDMI so I can't comment on them",
                "GENERAL NOTE: If you don't leave your laptop on when you're not using it, I recommend going to \"settings\" and checking for updates on a regular basis",
                "There were a bunch of updates needed when I first brought it up and that was an on-going need for several days."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "31",
                            "36"
                        ],
                        "polarity": "positive",
                        "target": "light",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "18",
                            "21"
                        ],
                        "polarity": "positive",
                        "target": "12\"",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "5",
                            "25"
                        ],
                        "polarity": "neutral",
                        "target": "streaming capability",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "10",
                            "26"
                        ],
                        "polarity": "positive",
                        "target": "customer support",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Terrible product!!!!",
                "Very unhappy with this product",
                "Bought when they had the black Friday deals, went through the set up of everything",
                "Had the computer sitting for a few days, go to turn it on and NOTHING!! It won't charge, it won't turn on, it won't do anything",
                "I didn't even get a chance to use it yet",
                "I wanted to return for a replacement, but I'm scared of this happening again and then being out the refund time",
                "Very upset with this product and I honestly would not recommend purchasing."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Just trash !",
                "Stay away from Windows 10 S ! Let me tell you what it is ....",
                "trash 🗑!!!!!!! You can’t download anything from browser unless is from their crappy App Store! I couldn’t download Sketchup ! This is the worst part you CANT use GOOGLE!!! Like what the F ! They only allow you to use Bing ,who in the right mind uses that search engine!! No oneeee! You have to pay 50 bucks to upgrade to Windows 10 pro to be able to use your brand new computer like a normal person would like to do! Very very disappointed with this stupid “windows 10s” upgrade! (Not even an upgrade)!!!!! Please do your self a favor and buy a Mac !"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Awesome lightweight everyday task laptop!",
                "For surfing the web, checking emails, streaming music services, this is perfect! Nice construction, lightweight and compact, and beautiful design",
                "I especially LOVE the inclusion of the USB-C port, which I will use to connect to a portable external monitor",
                "For every day tasks around the house, this fits my purposes perfectly",
                "Update 1/15/21 - a few things - the product description mentions \"backlit keyboard\" but I can confirm this model definitely does not have it",
                "Also, the USB-C port delivers power to another device and also transmits data, but does not output video to an external monitor",
                "And I cannot get the NumberPad function to work, but maybe it's because I am keeping the device in \"Windows 10 S mode\" and cannot update the driver",
                "Anyway, for $199, I can't complain much about these omissions/problems",
                "Update 1/18/21 - thanks to one of the other reviewers, I figured out how to get the NumberPad to work properly - you need to very lightly touch each of the numbers and they will appear",
                "I guess I was pressing down too hard",
                "So with that problem sorted out, I'm very happy with this laptop so far!!"
            ],
            "opinions": [
                [],
                [],
                [
                    {
                        "target_position": [
                            "39",
                            "49"
                        ],
                        "polarity": "positive",
                        "target": "USB-C port",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "36",
                            "55"
                        ],
                        "polarity": "negative",
                        "target": "product description",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "74",
                            "82"
                        ],
                        "polarity": "neutral",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "10",
                            "15"
                        ],
                        "polarity": "neutral",
                        "target": "USB-C",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not super fast but good enough - Charger/Connection Error after 1 year",
                "Cheap computer that does enough for my 10 year old",
                "This was a last minute christmas gift for my son",
                "Wanted something cheap enough that if it broke (dropped,etc) we weren't out hundreds of dollars but something he could play Minecraft, Roblox, etc on and do occasional school work on",
                "This computer has gotten a great deal more use this year (thanks a lot 2020) and has been doing full time remote learning (zoom, Google docs, etc) since September",
                "It has not crashed or needed a hard restart once during this time",
                "Purchased for $205.00 plus tax December 2019",
                "[Update --&gt; January 4, 2021] Computer stopped charging, problem with the charger connecting to the computer",
                "Contacted ASUS, explained the problem",
                "They ran me through the same problem solving steps I had already run through but I was happy they were being thorough",
                "At the end, they told me it would need to be sent in for servicing, this was fine by me",
                "However, they were going to charge me $85 diagnostic fee plus what ever the cost was to repair the computer",
                "The warranty expired on 12/25/2020 which was 10 days prior to my contacting ASUS",
                "They would not honor the fact that the warranty was only 10 days expired and refused to help me out",
                "So I now have a brick worth nothing",
                "I for sure won't be buying ASUS anymore."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "5"
                        ],
                        "polarity": "positive",
                        "target": "Cheap",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "42",
                            "56"
                        ],
                        "polarity": "negative",
                        "target": "diagnostic fee",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Waste of Money",
                "Too small",
                "Limited storage",
                "Very slow",
                "Requires external disc drive",
                "Very basic",
                "Would not recommend even for grade school students",
                "Do to very small screen size, font is virtually unreadable in some apps",
                "Spend more or look for sales at Amazon or Best buy",
                "Definitely not for college or business user",
                "I bought it in a pinch",
                "I use my I-Pad Pro 2018 with Ipados 13 as my main laptop",
                "I use the Asus when material I receive is on a cd-r",
                "That's it",
                "Should have returned it but needed it for a trial",
                "Trying now to wipe it completely to give to my niece, for very basic stuff",
                "One pro: highly portable and lightweight."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "4",
                            "9"
                        ],
                        "polarity": "negative",
                        "target": "small",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "8",
                            "15"
                        ],
                        "polarity": "negative",
                        "target": "storage",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "5",
                            "9"
                        ],
                        "polarity": "negative",
                        "target": "slow",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "23",
                            "28"
                        ],
                        "polarity": "negative",
                        "target": "drive",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "18",
                            "28"
                        ],
                        "polarity": "negative",
                        "target": "disc drive",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "24",
                            "28"
                        ],
                        "polarity": "negative",
                        "target": "size",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "16",
                            "24"
                        ],
                        "polarity": "positive",
                        "target": "portable",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "29",
                            "40"
                        ],
                        "polarity": "positive",
                        "target": "lightweight",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "Poor Battery life and unreliable WiFi connection.",
                "The battery life made this a non-starter",
                "However the most frustrating issue was intermittent dropping of WiFi",
                "Spent the better part of two days trying various support suggested fixes, including but not limited to: Re-Doing ASUS supplied power profile to eliminate shutting down WiFi adapter, Updating timeout Registry entry with REGEDIT, Dowloading and installing ASUS BIOS and several drivers, Updating Windows 10 with fixes, ETC",
                "NOTHING HELPED",
                "THis was to replace a 6 year old HP STREAM with a (after 6 years!) broken hinge",
                "Returned this self contained PC TECHNICAL SCHOOL device and BOUGHT ANOTHER Stream!"
            ],
            "opinions": [
                [
                    {
                        "target_position": [
                            "5",
                            "17"
                        ],
                        "polarity": "positive",
                        "target": "Battery life",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "5",
                            "17"
                        ],
                        "polarity": "negative",
                        "target": "Battery life",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "33",
                            "37"
                        ],
                        "polarity": "negative",
                        "target": "WiFi",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "4",
                            "16"
                        ],
                        "polarity": "negative",
                        "target": "battery life",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "64",
                            "68"
                        ],
                        "polarity": "negative",
                        "target": "WiFi",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Completely died after 8 months of use",
                "No abuse...no reason...kaput! ASUS fixed BUT DIED AGAIN!!!",
                "I bought this for my daughter to use at college",
                "She used it for one semester with no issues apparent",
                "One afternoon it just refused to start up ....fully charged...no response",
                "SO I sent it back under the warranty and after about 3 hours on the phone trying to assure the person that I was legitimate",
                "They did fix it and return it within 10 days...YAY...I thought",
                "2 1/2 months later it DIED AGAIN",
                "No warning just had turned on that morning no problem but that afternoon it would not turn on and I waited...no go for two days now",
                "RETURNING AGAIN ....SIGH...if company wants business they may want to back up their products with performance."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect Linux Daily Driver",
                "This is the perfect super-portable Linux machine",
                "I can run Dwarf Fortress and Stardew Valley without an issue (at the same time, even)",
                "I had some trouble with Wi-Fi drivers installing properly using Manjaro/Arch and gave up before going too far down the rabbit hole",
                "Mint works perfectly using the Xfce edition, and I’ve got i3 windows manager installed next to that and it’s flawless",
                "Drivers seem to work out of the box (with the correct distro at least)",
                "Battery life is so good - I’ve never gotten past 50% before my nightly charge",
                "As a point of pride I didn’t even let it boot to Windows before ripping it out and putting Linux on, so I can’t speak to that, but you definitely get a great bang for your buck running dainty Linux vs resource gobbling Windows",
                "Hard drive is big enough that I didn’t feel the need to get a microsd, though there is a port for one",
                "I still have 33 GiB free after the OS and all of my tools",
                "No fans to make noise, no moving parts really which is nice if you like it quiet and clean",
                "Despite this the bottom gets only pleasantly warm but nowhere near hot or uncomfortable with a heavy load",
                "It’s very light at about two pounds, and the size is big enough to not feel cramped while still fitting in practically any bag",
                "There’s plenty of ports despite the small size, and the the inclusion of HDMI is surprising but welcome",
                "The keyboard feels good",
                "The touchpad is fine (though with i3 or similar windows manager I don’t need to use it much)",
                "I even got the webcam and mic to work with out of the box drivers",
                "The screen is very glossy, but the range of brightness is good and so far I haven’t been too bothered by reflections",
                "Everything is plastic to keep it lightweight",
                "It feels well built, not flimsy",
                "I wouldn’t trust it to hold up to rough handling, but I’m not worried about it jostling about in my book bag",
                "Overall I couldn’t be happier with the little guy",
                "It’s exactly what I was looking for, and seems like it’ll serve me for years to come."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "73",
                            "77"
                        ],
                        "polarity": "positive",
                        "target": "HDMI",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "18",
                            "23"
                        ],
                        "polarity": "positive",
                        "target": "ports",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "4",
                            "12"
                        ],
                        "polarity": "positive",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "4",
                            "10"
                        ],
                        "polarity": "neutral",
                        "target": "screen",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "33",
                            "44"
                        ],
                        "polarity": "positive",
                        "target": "lightweight",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "9",
                            "19"
                        ],
                        "polarity": "positive",
                        "target": "well built",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "WINDOWS S is stupid switch to 10 and its good",
                "Bought for my child to use for distance learning kindergarden",
                "I really haven't messed around with it to see how it preforms",
                "So far it's working good for connecting to zoom by wifi, it does not lose the connect or buffer Lagg and the cam I guess is fine his teacher can see him",
                "I don't like the WINDOWS S it sucks and so I got rid of it and switched to the reg windows 10",
                "Windows S is a joke it's trying to be like apple \"safe\" and not let the user dl or install any apps that are not from the Microsoft store and approved by Microsoft, and ur stuck with there browser and them keeping u inside there stupid lil safe bubble monitoring to ensure the computer and user are Microsoft safe",
                "LAME",
                "EVEN AS ADMIN I CUD NOT CHANGE SYS SETTINGS",
                "With that said computer works great if u get rid of S and switch to windows 10 and it's free to do so dont get scared when it says u will lose S forever and can not change back, click swich."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This is perfectly a piece of junk",
                "Had unit for just 6 months",
                "Stopped working",
                "Will not start",
                "After waiting on chat forever, ASUS agreed that this unit is broken and let me return it for repair/replace",
                "However, I do not know how long I will be without the unit",
                "Bad news!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Caution, it comes with Windows Home 10 S",
                "Did not realize this but this laptop came with Windows Home 10 S which doesn't allow you to download and install any un-approved software not in the Microsoft Store; Google Chrome is not approved",
                "So it took me hours of frustration just to install my Google Chrome."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice, but lightweight capability",
                "Nice physical design, slim, lightweight, very portable",
                "Nice display and overall function; however, the CPU is rather lightweight",
                "My intended use is to pair with a Software Defined Radio (SDR) receiver for specific use amateur radio activity",
                "So far I have not been able to find SDR software that does not run the CPU to capacity, even though I have turned off all the background activities I can locate",
                "I don't want to pay twice the price for a laptop with a stronger CPU for this narrow activity, so I will likely redirect it to another amateur radio activity; or I may return it",
                "I like the computer overall but am disappointed the CPU is not more capable ..",
                "particularly since a Raspberry Pi 3 mini-computer is able to do the job",
                "5/21 Update: The laptop performed inadequately in the activity for which I attempted to re-purpose it",
                "Therefore I returned it and purchased a refurbished Dell laptop with i7 core for just $100 more."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "5",
                            "20"
                        ],
                        "polarity": "positive",
                        "target": "physical design",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "46",
                            "54"
                        ],
                        "polarity": "positive",
                        "target": "portable",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "28",
                            "39"
                        ],
                        "polarity": "positive",
                        "target": "lightweight",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "22",
                            "26"
                        ],
                        "polarity": "positive",
                        "target": "slim",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "52",
                            "55"
                        ],
                        "polarity": "negative",
                        "target": "CPU",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great for what it is",
                "For what this is supposed to be and for roughly $200, it's fantastic",
                "This isn't a high performance gaming laptop (or really any kind of gaming laptop) and it would be difficult to do precise graphic design work",
                "However, for internet access and word processing and all of your everyday computer uses, it's one of the best you can get",
                "This runs smooth and feels very snappy due to the solid-state drive, and Windows 10 works well",
                "Streaming movies/shows like through Netflix or YouTube works great",
                "If you want to install programs that aren't on the Windows app store, you'll need to disable \"S mode\", but this is easy and quick to do",
                "Just Google \"disable S mode\" and you'll find the steps easy enough",
                "64 Gbs is more than enough for windows, web surfing, movie streaming, and word processing",
                "However, I wanted to store some photos and other media, so I picked up a 256Gb micro SD card and it seems to work very well",
                "These are relatively inexpensive ($30 or so) and couldn't be easier to install - just insert into the micro SD slot until it clicks",
                "The screen is small for a laptop, but if you've been working with only a smartphone screen for a while like I had been, it seems huge",
                "😂 ASUS is one of the best quality computer parts manufacturers around, so this also should last a good while",
                "Overall, I definitely recommend this for your more basic computer needs."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "6"
                        ],
                        "polarity": "positive",
                        "target": "64 Gbs",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "0",
                            "6"
                        ],
                        "polarity": "neutral",
                        "target": "64 Gbs",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "4",
                            "10"
                        ],
                        "polarity": "neutral",
                        "target": "screen",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                []
            ]
        },
        {
            "text": [
                "I liked its predecessor the X205ta and I really like this little workhorse",
                "The free upgrade to Windows 10 was changed from Pro to Home version, but that may be fine, seems to be",
                "And as another described, is a true \"little work horse\"",
                "A lot of my decision to purchase this was based on my previous and still use of it's predecessor, the Asus 11\" X205ta and apparently minus a couple of the cured X205 little annoyances (track pad, two finger scroll)",
                "With double the space of the emmc HD, 64Gb, there is enough extra for all the programs I'll need",
                "Increased RAM, faster processor and increased capacities and lower costs of available microSD cards providing plenty of storage, make this very portable laptop able do the same or more work than with any PC I've had in the past",
                "Love it so far."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "10",
                            "13"
                        ],
                        "polarity": "positive",
                        "target": "RAM",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "22",
                            "31"
                        ],
                        "polarity": "positive",
                        "target": "processor",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "46",
                            "56"
                        ],
                        "polarity": "positive",
                        "target": "capacities",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "144",
                            "152"
                        ],
                        "polarity": "positive",
                        "target": "portable",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                []
            ]
        },
        {
            "text": [
                "Buyer beware",
                "You get what you pay for...",
                "this laptop really is more of a Microsoft attempt at Chromebook",
                "It doesn't run Google.com or other No Microsoft things",
                "To run TurboTax you have to pay extra for an app from the Microsoft store! Even office software is a subscription service on the cloud (which I knew going in)",
                "So this will be going back...my Chromebook is more user friendly",
                "I wanted a laptop for things like office and TurboTax which Chromebook doesn't do..",
                "but this laptop cannot do them either."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "BROKEN AND NOT TOUCH SCREEN? WHAT A RIP OFF...I WANT MY MONEY BACK.",
                "This company and the seller are nothing but a bunch of RIP OFF and I want my money back",
                "How can you sell something that half of the essential keys dont even work? Let me put this in perspective for you all",
                "For example, 10 keys ( f1-f12) DO NOT WORK, but for the sake of my time and sanity I am only going to cover a few",
                "BRIGHTNESS- when I try to turn down the brightness, it takes me back to previous page and repeat what I already read and the turn up brightness button don't even work at all",
                "VOLUME- I can't turn the volume up or down, I every time I press the key to turn the volume down it goes to a full screen and this mambo jumbo data crap pops up",
                "The volume up key dont work at all so does the mute button",
                "If I have to manually turn everything up and down what is the point of having all these useless keys on here? MUTE- the mute key doesn't even work at either",
                "On top of that this computer was supposed to be a touch screen too, not the case",
                "I bought this because I saw some good reviews, and it was touch screen supposedly",
                "Y'all must be the ones writing your own reviews for this product or something because there is no way people didn't catch these issues",
                "BUYERS BEWARE",
                "I DO NOT RECOMMEND THIS: I AM RETURNING IT ASAP AND I WANT MY MONEY BACK ASAP."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "55",
                            "62"
                        ],
                        "polarity": "negative",
                        "target": "RIP OFF",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "10"
                        ],
                        "polarity": "negative",
                        "target": "BRIGHTNESS",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "0",
                            "6"
                        ],
                        "polarity": "negative",
                        "target": "VOLUME",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It’s a nice computer",
                "I think this computer is fine",
                "It arrived looking new and in perfect condition",
                "If it came broken, it’s more than likely due to shipping",
                "In the description, it says it’s a touchscreen, but if you read the Q&amp;A section (you really should), it’s not",
                "And I knew that",
                "It’s a nice, small laptop and the battery life lasts long",
                "I saw a review with a picture and says the top row keys don’t work, but you have to hit FN button at the same time",
                "(duh) Just do your research",
                "Read the reviews, read the Q&amp;As, look at the customer pictures",
                "Don’t rely on the description and product pictures alone."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "34",
                            "46"
                        ],
                        "polarity": "positive",
                        "target": "battery life",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "13",
                            "18"
                        ],
                        "polarity": "positive",
                        "target": "small",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "18",
                            "29"
                        ],
                        "polarity": "negative",
                        "target": "description",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "The perfect laptop",
                "I'm a first year college student, and this laptop is fantastic for mobile meetings getting work done, or gaming",
                "I play Minecraft on it a lot, and it never tears",
                "I play multiplayer and there is no stuttering on part of the computer",
                "The battery seems to go in a few hours or so, but that's to be expected",
                "Better than the $500 laptop I returned earlier this year."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "4",
                            "11"
                        ],
                        "polarity": "neutral",
                        "target": "battery",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                []
            ]
        },
        {
            "text": [
                "Fun while it lasted(it lasted!!)",
                "Actually it was slow to startup at first and didnt run for a day or two but ever time after that iy has been running smpothly and effortlessly"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Used Product",
                "No where in the discription, posting does it indicate used product",
                "Laptop arrived re-packaged and with someone elses account already on the device",
                "It appears to be in good condition but the computer is currently conpleting a factory reset so we will see how it works",
                "This is more of an issue with the seller as I did not expect great things with this product",
                "If I purchase an item that does not say referbished, restored, previously used, etc, I expect it to be new",
                "I do not appreciate consumer deception by sellers."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "16",
                            "27"
                        ],
                        "polarity": "negative",
                        "target": "discription",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "20",
                            "38"
                        ],
                        "polarity": "negative",
                        "target": "consumer deception",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "Not a Touch Screen and No Battery Life",
                "NOT a Touch Screen as the initial search had indicated",
                "This was one of the main reasons I purchased the item",
                "I purchased this laptop for my son, with schooling now online I had hoped this would be the right size, touch screen abilities and capacity for his needs",
                "He is online for 6 hours a day with breaks for elementary schooling",
                "They play a lot of games as homework and the touch screen was essential",
                "Firstly, the package arrived on time although the shipping was not updated until 2 days before it was to be delivered and caused a lot of anxiety as it arrived the day before classes began",
                "So set up was literally right before class began",
                "Battery: First class was only 90 minutes long, and alread the battery indicator said low battery and slowed down",
                "Attached plug in and allowed full charge",
                "After removing plug it still died just as quickly",
                "Setup: It was an easy step by step setup as any other laptop",
                "The pain came in the updates, it had over 18 listed and it took 90 minutes for the first one to update",
                "So I walked away and set the computer for restart when complete",
                "Restart: It did not restart",
                "It did not turn back on",
                "It indicated the battery was dead and there was no power",
                "I pluged it in to charge for 4 hours and still nothing",
                "Another 4 hours and nothing",
                "Over night and nothing",
                "By this time my son had missed a whole class and I was frantically trying to find anything to connect him",
                "What a waste of stress, money and time",
                "Returning."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "7"
                        ],
                        "polarity": "negative",
                        "target": "Battery",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "17",
                            "24"
                        ],
                        "polarity": "negative",
                        "target": "battery",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "HUGE screen crack right out of the box..",
                "Just returned home from vacation, opened my package, and my entire screen has a HUGE crack/black line going across it..",
                "I love these laptops and this is just such an unfortunate incidence",
                "Please, I beg of the company to help me out and replace this for me and send me a new one..",
                "this was a waste of money and I can’t afford this type of cash loss right now..."
            ],
            "opinions": [
                [
                    {
                        "target_position": [
                            "5",
                            "11"
                        ],
                        "polarity": "negative",
                        "target": "screen",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "A great machine, if you use it for its intended purpose.",
                "I am very happy with this machine",
                "It does exactly what I want it to do, which is be small and light, run Firefox and MS Office, and connect to my printer, all tasks where the Chromebook it replaces fails",
                "It's pretty fast (Power on to desktop in 20 seconds, Desktop to Firefox in six seconds), the sound is excellent for a laptop, using speakers or headphones and it easily provides the advertised 10 hours of battery life",
                "It is perfect for my intended purpose - a machine for use while traveling",
                "This machine is no good for gaming (nowhere near enough storage, RAM or processor speed), video editing (processor and RAM aren't up to it) or any heavy image manipulation",
                "It handles YouTube, Netflix and the like very well",
                "For a basic, on-the-go machine, this one fits the bill perfectly."
            ],
            "opinions": [
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "12",
                            "16"
                        ],
                        "polarity": "positive",
                        "target": "fast",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "93",
                            "98"
                        ],
                        "polarity": "positive",
                        "target": "sound",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "A low end capable laptop (netbook)",
                "This is a descent low end laptop",
                "Of course it is not a powerhouse gaming or video editing platform",
                "Still it fits a light weight easy to handle laptop niche",
                "You can think of this unit as Netbook/NetTop",
                "This was bought to surf the Internet, watch some Youtube, and type up some documents from time-to-time",
                "These tasks are handled well by this Asus model",
                "I would not use this unit as a primary platform and again it isn't for serious gaming or video production",
                "In my case I installed Ubuntu MATE 18.04 LTS and everything worked with zero manual configuration",
                "The system was paired with an external dongle for a RJ45 connection and added port capacity."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Be aware, you can't install some apps without Microsoft approval",
                "Pros...Nice computer for the money",
                "Small and easily portable",
                "Could be faster, but I only wanted it for a Windows 7 replacement",
                "Main Con....My biggest gripe is I have been using several apps for years, without any problems whatsoever, on every computer I have owned running on previous windows OS",
                "With this computer running Windows 10 S, I can not install these same apps without Microsoft approval",
                "I must contact Microsoft to get their permission to Install them, since they aren't on their approved list, as if I am not capable of making my own decisions on programs I want installed",
                "I thought it was MY computer",
                "Guess not",
                "As a senior citizen I don't need a baby sitter to protect me",
                "I really dislike Windows 10 and waited as long as I could before replacing Windows 7",
                "This operating system was described as a Windows 7 look-a-like",
                "That is why I purchased this computer",
                "I would NOT have purchased it knowing I needed Microsoft approval before installing my apps",
                "I game on Steam, but cannot install Steam without seeking their approval",
                "I guess they only want me to purchase games from the Microsoft store",
                "Yes, I am miffed."
            ],
            "opinions": [
                [],
                [],
                [
                    {
                        "target_position": [
                            "17",
                            "25"
                        ],
                        "polarity": "positive",
                        "target": "portable",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Do not buy",
                "Do not buy",
                "I Bought it 3 months ago and it's not working anymore",
                "Customer service is nonexistent",
                "Now I have a piece of junk and ASUS doesn't help",
                "They are not answering phones, neither chat their website don't give customer service options."
            ],
            "opinions": [
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "16"
                        ],
                        "polarity": "negative",
                        "target": "Customer service",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                []
            ]
        },
        {
            "text": [
                "Light and efficient...",
                "This ASUS vivobook is small, light, and efficient, great for computer use on the move, especially when weight is an issue",
                "It isn't the equivalent of a desktop or a larger, more powerful laptop, but it may do until you can get to one",
                "Internet access and word processing is pretty good",
                "This reviewer is not a gamer, but the graphics seem decent",
                "Recommended for limited purpose."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "103",
                            "109"
                        ],
                        "polarity": "positive",
                        "target": "weight",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [
                    {
                        "target_position": [
                            "38",
                            "46"
                        ],
                        "polarity": "positive",
                        "target": "graphics",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                []
            ]
        },
        {
            "text": [
                "You can play World of Warcraft on it",
                "My friends have a Tuesday game day and they use the desktop simulator from steam, I only have Chromebooks and so I bought this one really for the sole purpose of joining them for game night",
                "Then I realized that you could download and play Warcraft",
                "I haven't played it for years but I downloaded it all and I've been extremely impressed considering the specs on this computer",
                "now to be clear, all the settings are on the very lowest, this isn't very important to me but I get fast enough FPS and manageable FPS in the cities on the weekends",
                "Definitely usable for a casual player!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little computer!",
                "I had bought a laptop with a defective hinge last year",
                "Which unexpectedly broke on me",
                "Anyways, I didn't want to pay a lot for a computer, until I have space for a desktop",
                "This was perfect to hold me over and keep me online",
                "Like other reviewers have already said, don't expect to keep Windows on this",
                "I toyed with the idea when it first arrived, considering that's all I've ever used",
                "But quickly realized that wasn't a good choice",
                "Its just not built to run it effectively, you'll find",
                "Replaced with Linux Mint Xfce and it runs great",
                "Does just about everything my full size could",
                "And boots way faster",
                "The only problem I really have is; the video quality isn't the best, at times",
                "There's also a bit of a learning process with Linux, that I'm still getting used to (starting to like it better, the more I get used to it)",
                "If you go in with realistic expectations; It's well worth it, for a computer under $250",
                "Cool to have something so light and portable too",
                "Can be carried with one hand easily without weighing your arm down",
                "And battery life is the best I've ever had with a laptop, honestly."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "39",
                            "52"
                        ],
                        "polarity": "negative",
                        "target": "video quality",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "4",
                            "16"
                        ],
                        "polarity": "positive",
                        "target": "battery life",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "this device sucks!!!!",
                "This device lasted only two months before it died",
                "two months!!! Don't buy one",
                "they overheat and then there's no support!! service center isn't answering phones...",
                "chat isn't answering..",
                "and then there's an automated product return for service ..",
                "to somewhere overseas!!! Tossed it in the trash and bought something else.",
                "definitely never an Asus !"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Completely dead after barely using less than a month",
                "Completely disappointed",
                "Laptop was everything I wanted but quit working after less than 25 days",
                "No warning just stopped turning on and will not charge or show any activity",
                "It’s completely dead and I only used it a handful of times to open excel spreadsheets",
                "Returning for a refund as I’ve seen too many other reviews with the same issue and I’m afraid the next one will die after the money back time has expired or after the warranty is out."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "On 10-21, SUPER Nice little laptop! ALL conflicts resolved! ☺☺☺",
                "Rec'd 10-14-20 &amp; got Asus setup early on Thurs, 10-15 and began running into conflicts getting installation system &amp; password updates to sync correctly with phone &amp; tablet",
                "Saturday i took the time to go back through the VivoBook activation/setup process, which also included the update of numerous passwords to allow the Asus to finally sync in harmony with 2 other devices, my phone &amp; tablet",
                "The Asus VivoBook &amp; i have been able to resolve our conflicts of opinion as of Saturday's redo, and i am so far able to log in the other devices without a problem in continuity",
                "So - at this juncture, as i do intend to KEEP this VivoBook - PLEASE go ahead and re-deduct the FIRST payment",
                "With everything working correctly, this IS a fine little computer",
                "At 69 yo, i am somewhat computer literate but was NOT expecting to invest sooo much time upfront to bring this new device into my com-circle, replacing my 17\" HP..",
                "I would NOT hesitate to buy again 😁"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good value for \"basic functions\" laptop!",
                "Great little compact laptop for the price! I opted to get the 64GB RAM version with Office 365 instead of the one offered with more storage (128GB)",
                "Boots up FAST, keyboard is pretty comfortable, enough \"slots\" for any basic uses (x2 USB, mini HDMI, etc, etc.)",
                "Overall, it performs well and I am happy I went with this brand",
                "I've had it about two months now and I've been pleased with it's performance."
            ],
            "opinions": [
                [],
                [],
                [
                    {
                        "target_position": [
                            "15",
                            "23"
                        ],
                        "polarity": "positive",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "55",
                            "60"
                        ],
                        "polarity": "positive",
                        "target": "slots",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "85",
                            "88"
                        ],
                        "polarity": "positive",
                        "target": "USB",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "95",
                            "99"
                        ],
                        "polarity": "positive",
                        "target": "HDMI",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "65",
                            "76"
                        ],
                        "polarity": "positive",
                        "target": "performance",
                        "category": "",
                        "subcategory": ""
                    }
                ]
            ]
        },
        {
            "text": [
                "ASUS Customer Care is uncaring!",
                "I live outside of the US and bought 2 laptops in September for disadvantaged children through my US skybox via Amazon to facilitate the children's online schooling",
                "One of the laptops stopped charging last month and would only work while plugged in",
                "Lodged ASUS Query Ref # N2011063423",
                "Called 3 times and asked for solution which points to defective battery being replaced",
                "Was told by various persons at ASUS and ultimately by a supervisor today that due to internal procedure, repair policy, warranty etc",
                "that I have to bring the laptop in to repair",
                "I asked for a solution given my special circumstances and the fact that ASUS is a large international company and is penny-pinching me for a $79 part which they can easily ship to my Skybox address in the US",
                "This was a test of their true corporate image and an understanding of the lifetime value of a customer and they have failed",
                "What a shame!"
            ],
            "opinions": [
                [
                    {
                        "target_position": [
                            "5",
                            "18"
                        ],
                        "polarity": "negative",
                        "target": "Customer Care",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Pretty Good",
                "I ordered this laptop so I would have something to work on while I moved before I get my office set up",
                "First, this thing is tiny",
                "I knew it was small, but it is very small",
                "But if you can look beyond the size, it's a pretty good little machine",
                "It does what I need it to do- runs QBO, allows me to edit my websites, and the internet is fast",
                "It also comes with Office 365 which is a plus",
                "If you need something temporary, or just something cheap, this is a good laptop for you."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "31",
                            "35"
                        ],
                        "polarity": "negative",
                        "target": "size",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "19",
                            "29"
                        ],
                        "polarity": "positive",
                        "target": "Office 365",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                []
            ]
        },
        {
            "text": [
                "It's a light laptop",
                "It is VERY light i can work with it in my lap for hours",
                "The product description was completely incorrect, it literally has \"touch screen\".....And there is no touch screen option",
                "Last but not least, the browser",
                "I am really computer savvy and yet it took me quite a while to find the internet browser",
                "That was very annoying",
                "one Last thing, I tried connecting via bluetooth and also tried the C port and the standard USB and it did not allow me to transfer picture files from my phone, and my Bluetooth headphones...somehow they were \"unable to connect\"",
                "It is what it is",
                "Overview, its a well made computer for work under the $200 price range",
                "And its a decent laptop if you plan to run another OS system",
                "Even with the side issues, it still is worth the price you pay for it",
                "I was going to rate it a 3 Star laptop, but the the price factor Brings it it up to 4 stars."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "11",
                            "16"
                        ],
                        "polarity": "positive",
                        "target": "light",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "99",
                            "114"
                        ],
                        "polarity": "negative",
                        "target": "no touch screen",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "59",
                            "64"
                        ],
                        "polarity": "positive",
                        "target": "price",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "WOW! What a powerful little piece of perfect!",
                "I went through 3 different lower end laptops (I only need it to run a couple windows specific programs that don't work on MAC) and THIS one is quite the little powerhouse! Very well built, sturdy, and FAST! Start up was almost faster than my MAC! Touchpad is smooth and responsive",
                "I like that it is a \"full\" touch pad too, with no right/left keys below it",
                "You just push down on touchpad to \"click the mouse\"",
                "Harddrive doesn't sit and run and run like the other 2 I tried out, in fact you don't hear it running at all",
                "No heat buildup either",
                "It is also very light weight and compact but not \"cheap\" feeling at all",
                "It comes with Office already on it and also Windows 10-S but during the setup process it will even ask you if you want to disengage the S part, very, very easy to do",
                "No you cannot run the world with this and it is not meant for high end use with large programs or graphics intensive functions(gaming) but if you are just looking for a basic, email, browser with a few programs/apps loaded (or use flashdrive storage) this is The One",
                "I never thought I'd hear myself say this as a staunch mac user but this little buddy has made me a PC/Windows fan again",
                "That right there is quite a feat!"
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "247",
                            "255"
                        ],
                        "polarity": "positive",
                        "target": "Touchpad",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "27",
                            "36"
                        ],
                        "polarity": "positive",
                        "target": "touch pad",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "9"
                        ],
                        "polarity": "positive",
                        "target": "Harddrive",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "0",
                            "15"
                        ],
                        "polarity": "positive",
                        "target": "No heat buildup",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop for school and leisure time",
                "We bought two of these in July ‘20 for our high school girls to do homeschool on and they’re perfect! This is January ‘21 and we’ve had no problems",
                "The girls carry them on trips and besides doing school, they play Minecraft on them, watch YouTube on them, and listen to Spotify on them",
                "I’m not sure we set everything up correctly on them bc of Microsoft stuff that popped up, but I’m sure that’s easily fixed and it hadn’t affected how the pc operates! Our family has been satisfied with these purchases!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Unbeatable for the price",
                "I paid $190.19 for this, which is almost cheaper than the software itself",
                "Boot-up is fast, within 5 seconds",
                "It does everything I need it to and everything I'd ever need it to",
                "Keyboard is solid, size is smaller than a standard textbook, case is seemingly durable",
                "Programs such as Word start up quickly, edge browser is very quick on a high speed connection."
            ],
            "opinions": [
                [],
                [
                    {
                        "target_position": [
                            "41",
                            "48"
                        ],
                        "polarity": "positive",
                        "target": "cheaper",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "0",
                            "7"
                        ],
                        "polarity": "positive",
                        "target": "Boot-up",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "0",
                            "8"
                        ],
                        "polarity": "neutral",
                        "target": "Keyboard",
                        "category": "",
                        "subcategory": ""
                    },
                    {
                        "target_position": [
                            "61",
                            "65"
                        ],
                        "polarity": "neutral",
                        "target": "case",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                []
            ]
        },
        {
            "text": [
                "Great size for traveling or as a second computer",
                "I'm a writer and can't be without a computer",
                "When my laptop decided to die on me, I transferred my external hard drive to this little guy and it worked perfectly",
                "Just had to download Microsoft Office and away we went",
                "I did buy a regular laptop, but used this small one until I got it",
                "Keeping it as a travel companion and backup computer",
                "The screen is vivid and crisp",
                "The keyboard feels fine, and my external drive just plugged into the usb drive opening and I was good to go",
                "This computer doesn't have a whole lot of memory, so unless you're going to store your large files on an external drive, this isn't that great",
                "For just getting online and doing regular things you're not storing on it, good to go."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "4",
                            "12"
                        ],
                        "polarity": "positive",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [
                    {
                        "target_position": [
                            "42",
                            "48"
                        ],
                        "polarity": "negative",
                        "target": "memory",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                []
            ]
        },
        {
            "text": [
                "The keyboard is really, really mushy.",
                "I got this as a typewriter - literally just a simple machine for typing",
                "Unlike a lot of other Windows laptops, I was able to install Linux with ease and it even goes to sleep when I close the lid (no joke that's a huge deal with Linux)",
                "It's a really beautiful machine; it's compact and handsome to boot",
                "I really really wanted to love it but the keyboard is awful",
                "In every other respect it's a very nice machine but I bought it specifically for typing and it's the one thing it does very poorly",
                "The keyboard is absolute garbage",
                "You couldn't pay me to write a page of text on it."
            ],
            "opinions": [
                [
                    {
                        "target_position": [
                            "4",
                            "12"
                        ],
                        "polarity": "negative",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "42",
                            "50"
                        ],
                        "polarity": "negative",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [
                    {
                        "target_position": [
                            "4",
                            "12"
                        ],
                        "polarity": "negative",
                        "target": "keyboard",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                []
            ]
        },
        {
            "text": [
                "Great little laptop for the price!",
                "This is a great little laptop for the price! I bought it for my teacher wife who carries it back and forth to school",
                "I added a 128gb card to it and it holds all of her needed files",
                "It is fairly quick, but somethings seem to load stuff slowly",
                "I believe this is because it only has 4gb of RAM",
                "Which is not upgradable",
                ":( The laptop is nice and small and lightweight and easy to carry",
                "You just need good eyesight because the screen is really small",
                "This is definitely NOT a gamer’s laptop",
                "You also need to be able to live with the “not upgradable” aspect",
                "We’re glad we bought it and just hope that it last a long time like my last ASUS laptop."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [
                    {
                        "target_position": [
                            "38",
                            "48"
                        ],
                        "polarity": "negative",
                        "target": "4gb of RAM",
                        "category": "",
                        "subcategory": ""
                    }
                ],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "JUNK",
                "Do not buy",
                "I should have checked the reviews",
                "After three hours of use, I was not allowed to enter the PIN",
                "Tried hard restart and refresh and the whole shooting match",
                "JUNK"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Ehhhh",
                "I bought this back in January 2020",
                "Everything was running smoothly up until now which is roughly 7 months to the day I bought this thing",
                "The laptop won't charge and the screen stays black for minutes on end (while I'm clocking and moving the mouse)",
                "Asus is a company that I will no longer conduct business with and will now but a laptop from a more reputable company like apple",
                "I hate to bash a company like this but it's the truth and just thought that all of you reading this should be aware of this."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "What happened? Lights out? So soon?",
                "My wife liked this product for it portability",
                "Seemed to do the job for basic use",
                "Used it for video conferencing worked perfectly",
                "No wifi issues",
                "But after 2 months and one day to the next it stopped working",
                "It does not turn on",
                "What happened? What can I do now? I was hoping to get 4 years out this laptop",
                "Too good to be true, Do not buy this product!!!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        }
    ]
}