{
    "data": [
        {
            "text": [
                "14 inch hp stream",
                "Perfect for the kid that has online classes.",
                "or for editing a video",
                "Perfect for the college kid on the go too..",
                "light weight and sleek",
                "Grest value"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent product and service!!!",
                "Just received my order hours ago and I couldn’t be more impressed with my selection",
                "This vendor is top class when it comes to providing a product as stated! Not only that but I received it almost a week before I expected! Very prompt on taking care of orders, very impressive! Amazing laptop came exactly how it was listed",
                "Very very satisfied with everything from product to service",
                "Thank you antonline for your business and for the excellent service you provided to me as a customer!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It could work..",
                "The laptop looks really nice, it came to me in a box and I could notice that it was carefully packed and also the delivery was very fast! It was kind of difficult to figure it out how the software works and also some apps are not working (like Netflix)",
                "A bit disappointed because of that."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Awesome",
                "I recomend, good battery life and lightweight."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Review",
                "I LOVE this laptop! The color is PERFECT and SO PRETTY!! It’s super fast, so lightweight and did I mention super cute?"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "MADE in the USA",
                "HP is a true American Company, these are made and assembled in the USA.!!!!!! I will only purchase products from my fellow Americans who deserve to work and feed their families."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "God quality!!",
                "I’ve read some negative reviews but so far it’s worked for me good for my college courses",
                "Just make sure to be up to do date on system updates",
                "I had an issue with zoom but it was just due to not having the laptop system updated."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Fast speed and excellent battery life",
                "I had purchase this labtop for my college but i also watch movies it is great",
                "You need to use a sd card with it as their isn't enough storage",
                "Otherwise its great",
                "I love it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop",
                "Love love this laptop"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Very bad",
                "Very poor quality"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Loved the serive",
                "The service was quick."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Do not waste your money on it by a desktop",
                "I got this for Christmas last year and I thought my old Chromebook was bad but this is worse so aside from a garbage storage terrible Ram that can barely open Chrome don't spend your money on this I hate Apple but I'd even say go shell out for MacBook mine can barely even run Doki-Doki literature Club a visual novel so the Rams awesome terrible + this is the problem with most Windows products it struggles to open Chrome it can't use YouTube the amount of problems I've had with Netflix on it is a how old laptop from 2004 probably better than this"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "The worst",
                "It’s honestly the worst laptop I ever purchased for $200",
                "It’s really slow and gets slower with time and I don’t know how to make it better",
                "😔"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect for me",
                "This was the best laptop I could get in my budget",
                "I searched for a long time",
                "I wouldn't ever try in store now I have found this one",
                "I love that its white and thin",
                "It looks like a MacBook",
                "I only need it for web browsing, emails, general home use etc",
                "I love the key board and how long the battery lasts",
                "To me its a perfect laptop for what I need it for",
                "The fact it looks so nice and looks more expensive than it is, is a bonus",
                "It also came a lot sooner than expected, considering it was just before Christmas",
                "I am very happy with it",
                "Thanks!!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Would recommend",
                "Works well and has a great picture",
                "Easy to use and very long battery life."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Slow and the sound quality sucks",
                "It's slow and the sound quality is abysmal."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great value for price",
                "Nice laptop for kids to work on for school"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Très pratique",
                "Pratique"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "What a horrible experience.",
                "I purchased 4 of of these laptops",
                "When I received them, one had an international keyboard, one had a broken mini port, and one of the chargers quit working after two days",
                "What a horrible experience."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Just received and doesn't even work Amazon should be ashamed ...",
                "Just received and doesn't even work Amazon should be ashamed I had a blank screen since I powered it on"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Terrible",
                "This is not a refurbished laptop",
                "Terrible",
                "This is not a refurbished laptop",
                "It is just used",
                "Seller TECHarvard misrepresented this item",
                "The power supply was broken and didn't work",
                "The laptop body is damaged, dents and large scratches",
                "I understand this is a previously owned laptop, but the product description says it will look and work like new",
                "Not even close",
                "I don't know who \"certified\" this refurbishment, but I have a very difficult time believing it was apple",
                "Returning for a refund."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Tried to save some $",
                "Failed.",
                "Buyer Beware",
                "The first sign that something wasn't right was that this product is not being sold by Apple",
                "I took my chances...tried to save some money",
                "On arrival everything started fine, but definitely seemed pretty slow compared to our previous MacBook Pro",
                "First sign of real trouble came when I downloaded Microsoft Outlook for my work e-mail",
                "The computer couldn't handle it",
                "Spinning beach ball time",
                "Force quit (took a long time)..",
                "uninstalled Outlook and things went back to working, but remained slower than a normal Apple",
                "Wife (already skeptical) told me to return it while it was still under Prime return policy",
                "I balked",
                "Held out (again being cheap)",
                "Computer worked well enough for about a month that I was OK with it for the cost savings being somewhat slow",
                "Suddenly nothing worked",
                "Literally you would move the trackpad (mouse) and the spinning beach ball would appear",
                "Couldn't even scroll far enough to open a program without the beach ball endlessly spinning",
                "Return policy became a little tricky",
                "Fortunately the product was backed with a 90 day warranty",
                "It took a couple call to Amazon customer service to: A) Return the product B) Get a full refund (they tried to apply a restocking fee)",
                "In the end was fully refunded which I appreciate greatly, but would not recommend purchasing."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Is it stolen?",
                "Owned and configured by \"Raleigh County School District\""
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "If you're expecting a refurbished computer like you would get directly from Apple",
                "This computer was so beat up, and the charger was FILTHY and split in several areas showing exposed wiring",
                "I didn't even power it up, it went immediately back in the box to return",
                "If you're expecting a refurbished computer like you would get directly from Apple, this is NOT it."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Advertised product is not the same as what was received",
                "Only worked for 1 month.",
                "Its works okay as expected",
                "I understand that I ordered a refurbished product but it was full of dents and scratches",
                "Letters came off that we had to glue back",
                "The picture that was advertised is not the same as what was delivered",
                "Disappointed at this one",
                "Update 9/14/17 After purchasing this in August 2, it stopped working today",
                "I would give 0 stars if I can",
                "Support says return period ended Sept",
                "1."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Basically it is an old version, yes",
                "It ...",
                "Basically it is an old version, yes",
                "It doesn't work fast",
                "But, I have changed RAM and HDD",
                "I mean, I upgraded hardware",
                "Put 16 GB RAM and 128 GB SSD",
                "Now it is as fast as brand new macbooks",
                "I may even claim that it is faster than new ones! So if you buy, upgrade it",
                "That is it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I am SO happy! I've been reading many review before buying this ...",
                "I am SO happy! I've been reading many review before buying this refurbished MacBook Pro from this seller, and saw many bad reviews, as well as the good",
                "Just got mine this morning, and upon recieveing it, the packaging was very protective, large strong bubble-wrap shell for the laptop itself, and for the charger within the same box",
                "Very tiny scratches on the sides and underneath, but other then that, completely clean and flawless! Charger also is clean and working perfectly",
                "Right now I need to update the system to masOS High Sierra, and it'll take a few hours, but after then, I will definitely update my review",
                "But upon delivery, and immediate set up, this is a great product! Exactly as advertised!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Get ready for an honest, but refreshing review",
                "I managed to get the last one that was in stock at the moment",
                "I was super nervous because of the awful reviews, but overall my laptop is great",
                "Listed below are some pros and cons",
                "Pros: Barely any scratches, keyboard and screen looked brand-new, interface works very well, durable laptop, easy to update to Catalina, laptop in general appears new, lots of SPACE!! Cons: The screen won't close all the way for some reason (demonstrated in the photos), the laptop is THICK- meaning it is a pretty huge laptop, it has a CD Rom and I didn't realize that but its also a kinda pro as an artist (I can burn videos onto CDS to show on older TVS), it is an older model which made it difficult to buy a case but I found a nice one on Amazon Overall, I really do enjoy the laptop",
                "I am a little disappointed that it is such a big laptop because it is an older model and I wish they would have disclosed the model information in the title",
                "I also wish the fact that it had a CD Rom was disclosed",
                "However, for my first official mac I own and for being a young college student, it works great",
                "And for the price it was great."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Operating system does not work.",
                "Turned on the computer for the first time and straight to a folder with a question mark",
                "Meaning the operating system was bad",
                "Never got to open iOS once",
                "Mild scratches on the casing",
                "I would recommend buying elsewhere."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Heart4Macs freakin' rocks on a \"Certified Refurbished\" used MacBook Pro",
                "I am a very long-term Mac guy from the early '80s (I worked on beta Macintosh hardware in 1983 and am an ex-Apple employee from the '80s and '90s)",
                "I admit I was disappointed to hear (in 2018?) that Amazon \"captured\" sellers of used Macs with their \"Certified Refurbished\" program, as it seemed a heavy-handed move on Amazon's part",
                "However, I am seriously impressed with absolutely everything about the MacBook Pro 9,2 (mid-2012 13\" 2.5 GHz Intel Core i5) I just ordered and received (in 3 days, cross-country!) from Heart4Macs",
                "This is a clean-as-a-whistle (A or A-, only very light scratches, SUPER clean, EXCELLENT condition) laptop, especially for being 7 years young",
                "The included battery has a reported \"Cycle Count\" of 50 (meaning it is nearly new) and instead of the promised 4 GB of RAM, this puppy arrived with 8 GB of RAM: bonus! I understand it is technically possible to install 16 GB, which I was going to purchase and install, though now I might hold off on doing so, having used a similar but older mid-2010 machine with 8 GB RAM and that seemed to suffice, even with a patched version of Mojave / 10.14",
                "This laptop arrived (correctly) with Setup Assistant (High Sierra, 10.13.5 version) prompting me to create a new account, the nearly blank (except for the ~15 GB of boot System) 500 GB HD ready receive my data",
                "However, I bought this particular machine because of its renowned expandability, and I'm now swapping out the shipped-with \"spinning rust\" HD for a same-form-factor / same capacity SSD",
                "This should halve-or-better my boot time (about 60 seconds with the HD) down to maybe 25 to 30 seconds as well as create a similar speed-up with everyday computing tasks",
                "It will install Mojave (the current Mac OS X version) and even Catalina (now in beta), so this machine is good for at least one more year of current OS and software",
                "But with (kernel extension) patches available, I expect to get two to four more years out of this solid-as-a-rock laptop",
                "The price was quite reasonable (I know Heart4Macs has a right to a reasonable profit margin, that's OK), and with Amazon's certification program and conscientious resellers like Heart4Macs taking the time to include a newish charger, a newish battery, a bonus on the RAM and clean-as-a-whistle condition, I'm happy as a clam at high tide with this purchase of a used laptop, one where I can eke out a few more years of value for a reasonable price",
                "Somebody has \"thought through\" the process of refurbishing older Macs within Amazon, and in my case, it not only works, it works quite well",
                "I'm picky, I'm knowledgable, I'm critical of people taking advantage of me if they think they can get away with a cheap trick, and none of that happened here",
                "An overall excellent experience!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Hard drive not cleaned, unable to reinstall iOS",
                "Computer was delivered with another administrator set up and much of the hard drive space not cleared",
                "When I cleared the hard drive, I was unable to reinstall iOS and received a \"no bag entry\" error message",
                "So unless you want to risk receiving a laptop with someone else's info on it and no ability to reinstall after cleaning, don't purchase this."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great investment.",
                "I was a little bit nervous about purchasing a used/ refurbished MacBook, especially from a third- party seller",
                "The laptop shipped quickly, and arrived well- packaged",
                "No cosmetic damage was noted, and the laptop appeared to be in great condition",
                "Upon powering the laptop on, there were no dead pixels or discolored places on the screen, and all keys lit up and were responsive",
                "The charger that came with the laptop was in good condition and worked well, and the touch pad was responsive",
                "The only issue was that there was still a password on the laptop, preventing me from accessing it",
                "I was able to reach the seller by telephone, and was sent instructions on how to unlock it via email, which did not work",
                "I contacted the seller again, and was informed that this meant the laptop had not been properly reset to factory settings",
                "The seller was extremely professional and apologetic, and assured me that he would be sending me a pre- paid return label, and that he would ship me another laptop",
                "Fortunately, I was able to wipe the hard drive, factory reset, and reinstall the operating system relatively easily after a few quick google searches",
                "After gaining access to the system and setting it up, I was thoroughly pleased with the product",
                "Being an older MacBook, it is a little slow, however I feel it is a fantastic investment for the price",
                "I would definitely recommend to anyone looking for something efficient, easy to use, and decently priced, as opposed to paying full retail price through Apple."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Poor quality for the price",
                "This item was in very rough shape",
                "Outside has been very scratched and damaged",
                "Not listed as being in such used shape",
                "Poor quality for the price."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "has already been returned to the amazon warehouse in USA Product Not recommended.",
                "Equipment totally defective, use it 02 times and then it did not turn on again",
                "make the return of the product",
                "has already been returned to the amazon warehouse in USA Product Not recommended",
                "bad"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Just a few scratches and a skin will cover that.",
                "First I have a tip based on allot of the reviews I read",
                "I always check the prime box and only select items that are fulfilled by Amazon and I have never had an issue",
                "The Macbook Pro came with a few small scratches and a tiny dent in one of the corners but other than that it's like new, works great, and I am quickly adapting to OSX from Windows",
                "I love it",
                "I am going to upgrade the RAM and get an SSD but it's already running perfectly well it just takes a bit too long to boot or open some apps",
                "I am also going to order a skin for it so the scratches and dent will be totally hidden",
                "OSX Mojavie installed flawlessly also",
                "The power cord I recieved with my MacBook is brand new."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "If you’re desperate, it’s ok",
                "But beware of annoying challenges",
                "Very sad with this computer",
                "Even though it does work and has somewhat done its part for my job, it’s slow to respond to clicks and opening pages/apps/multiple web tabs",
                "Also, it needs to be plugged in almost all the time",
                "Within 5 minutes, the battery drained 15 minutes off a full charge, and I only had one application open."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Honest to goodness deal!",
                "No scratches",
                "Runs smooth",
                "Great price for Macbook Pro Quality! Would buy again."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Wasted my money",
                "Bought this laptop a year ago and have used it minimally for about 6 months",
                "Several of the keys don't work, and it has some startup quirks -- ie mouse remains frozen for a minute and sometimes does not engage on selections",
                "Contacted seller who told me to take it to a Mac repair shop",
                "I did",
                "When I dropped it off, they asked if I'd had trouble charging the battery, and were surprised I hadn't because the provided charger was a knock-off! After diagnostics, they said the keyboard needed to be replaced, for over $300 -- Not that much less than what I paid for the thing in the first place",
                "Also, they said it wasn't worth making that kind of investment in a 6-year-old operating system",
                "So -- lesson learned",
                "The name Amazon is not a seal of approval on products from shady outside vendors."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Disappointment",
                "Purchased July 2017 -screen was scratched &amp; keys sticky",
                "Then failed for “no WiFi” hardware.",
                "it’s been out of commission more than working! Purchased the warranty &amp; sent it in for repair, worked for less than a month",
                "“Down”again",
                "I will NEVER purchase a “refurbished” item again."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "OLD Laptop - Good value - Great experience",
                "I half feel like Amazon or the seller has an obligation to make it explicitly clear that this laptop is circa 2012",
                "They don't",
                "I wouldn't have ordered it had I known but I'm writing this to let you know that I would have been wrong",
                "I received a laptop that was in near new condition that included a protective plastic case",
                "The OS is snappy and does everything I could want without the hassle of the non-magnetic USB-C power cable or the flaky keyboard of the newer models",
                "It's heavier than I'm used to for a 13\" laptop but I'm ok with that since it has the DVD builtin",
                "Overall this was a coup of a purchase for me",
                "My first MAC at a much reduced price with modern software and the features that I need."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "So Happy Until",
                "I could not wait to get this tablet I’ve always wanted a MacBook",
                "I found one I could afford and I was so nervous because I bought it without seeing reviews and I got scared because there was about four really bad ones and I got scared",
                "One tablet came really really fast and the condition was like Brand Spanking New",
                "Not one scratch dent nothing immaculate",
                "The charger like new",
                "It’s slow but I will up grade to 16 GB but working great",
                "The reviews from You Tube says this is still one of the best laptop still and will last a long time",
                "It’s Apple after all",
                "The only dislike I have to press down on track pad when I’m using to tapping and it is heavy thicker",
                "But I can live with it",
                "Thank you happy with my buy",
                "So after a couple days 2 tablet would crash",
                "It would keep rebooting and come back up",
                "It’s been getting good reviews well built for a 2012 so I’m going to try to fix it",
                "Came in pristine condition but hardware needs rebuilding"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Scratches, VERY slow, returning soon",
                "My last MacBook was refurbished as well, in perfect condition and ran like new - I guess I got lucky? This one is exactly not that..",
                "runs very, very slow",
                "Did not need a password to log into computer but to edit any settings I need the password??? Obviously an older model, which didn't bother me but the outside is pretty noticeably scratched, on top &amp; bottom",
                "Power cord is slightly damaged as well, but works",
                "Definitely going to return"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Has some issues",
                "Keeps turning off and I will ...",
                "Has some issues",
                "Keeps turning off and I will have to take it to get it fixed at an apple store",
                "Too late to return it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Love it so much!",
                "Apple has been known for making high quality computers and devices for decades",
                "Their computers and phones can last for many years if you take care of them but even most accidental damage/gradual wear and tear can be repaired or refurbished by Apple trained/certified people",
                "I've always wanted my very own MacBook Pro since that's what we have at work and I know that they're high quality and long lasting computers",
                "The software is user friendly and even this refurbished computer can be updated to iOS Catalina (it took awhile but we got there!) These computers are all refurbished (not brand new) to be like new condition and sold by third party sellers not Amazon itself",
                "My laptop had a few minor problems because the seller lacked honesty but thankfully the quality of the Apple product still works and shines through despite the little bit of the undisclosed screen damage, broken key, and dings/scratches on the exterior",
                "So as a product it's really great and five stars but the 3rd party seller wasn't great and has been rated separately",
                "Note: you can make returns during quarantine/stay at home but it takes a little longer, the price you paid isn't necessarily going to be the same when you buy another one, it might be out of stock, or shipping might be unpredictable",
                "So instead of being without a computer I decided to work with the minor more cosmetic issues and overall I'm happy with it",
                "I hope that your computer is even better than the one I received! :)"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great Apple laptop on the cheap! Expect to make upgrades...",
                "I took a gamble with this purchase I’ll admit, and first and foremost I am not an Apple computer guy, all my standards and pro software i use are on PCs",
                "I specifically bought this on the cheap to have access to Garageband for fun, and its turned out great!!! Im used to opening up computers etc",
                "so it was a no brainer for me to make some hardware upgrades when i tested its slow speed and performance, the HDD i swapped for an SSD drive and installed more ram, and its been peachy since",
                "The Macbook came in a sturdy bubble wrap box within a box, and cosmetically had practically no scratches, even the bottom was pristine",
                "Screen was clean and no OS errors, battery is fine, other than a slight dent at the top left of screen corner you barely notice it",
                "I’m guessing im one of the lucky few that didnt get a dud, Im very happy with my purchase and it only cost $100 for hardware upgrades i put in myself."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "skip it!",
                "First off things looked great other than the wrong charger was provided",
                "I contacted the seller and he sent the correct charger",
                "I purchased two computers",
                "My son's charger sparks and doesn't work any longer",
                "My computer, which I've used once, already won't start up",
                "I am a long time apple user but won't be fooled again with a refurbished product",
                "Don't wait your money or time giving this \"deal\" a try."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "DON'T WASTE YOUR MONEY!! MINE BROKE AFTER 94 DAYS",
                "And there is no way to reach customer service",
                "I wanted to try to resolve this with the seller but there is no way to get in touch with their customer service",
                "I bought this system for $675 and it worked great for 94 days and then it started making beeping noises and now won't turn on",
                "I took out the battery and tried changing the ram but nothing worked",
                "The computer is not usable",
                "Don't buy from this seller!! What a waste",
                "Note: I'm happy to update this review if the seller gets in touch with me and offers to fix the defective computer."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Poor quality control",
                "Product works fine, but it had some fairly glaring cosmetic damage",
                "It had a big chip on the back and the charger looked like someone chewed on it",
                "It was also missing the extension to the power cord which isn't terribly bad, but it is still annoying",
                "I chose it because I intended on putting in a solid state and upgrading the device",
                "However, they sent a damaged item originally, so I didn't want to sink more money into the product",
                "Fairly unhappy with the product I received",
                "Would not recommend buying."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "DONT BUY FROM THIS SELLER!!!",
                "MacBook Pro was marked NEW and certified refurbished......",
                "it arrived SCRATCHED ON TOP AND BOTTOM AND COULD NOT HOLD A CHARGE FOR LONGER THAN 2 hours! Very very very upset due to needing a laptop ASAP and trusted the process!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Highly recommend",
                "I was nervous purchasing this laptop because being refurbished, the reviews, and price that this would just be a flop of a purchase..",
                "I couldn’t of been more wrong! The laptop is in almost pristine condition and comes with power chord and works like a charm! I would of given this review a 5 out of 5 but (kind of my own fault) the only thing negative is I purchased this for iMovie and some other editing software programs and since it is a 2012 laptop it doesn’t update to the newest versions! Kind of a bummer and there may be ways around my issue to update so I can download the apps I wanted but again and cannot stress this enough..",
                "don’t hesitate it’s a great computer and in almost perfect condition!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "One Star",
                "The product was defective",
                "Old personal file still on the computer",
                "Could not load new software....etc."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Love my refurbished Mac Book Pro and Great Price too!",
                "A little debris on screen",
                "Some minor scuffing to be expected on apple top",
                "Probably laptop bag scuffing",
                "Beautiful machine",
                "I absolutely love my Mac Book Pro",
                "My first one",
                "The operating system was set to default and have had no problems with my refurbished MBP",
                "Audio is great",
                "Graphic resolution is great",
                "And the price...is great too! I would recommend this company to you and my friends",
                "Thank you for a great computer at a great price."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "GOOD BUY",
                "I bought this for a cousin abroad",
                "She loves it so far and has no complaints",
                "Personally, I'm not an Apple user, but I recognize the value for others",
                "While I did not personally use this computer for any length of time, I did perform a user start-up and a cursory overview just to make sure it was in working order",
                "As far as I know, there were no problems, certainly not during my interaction",
                "I consider this a good buy!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good not great, screen goes scrambled after restarting",
                "I knew I would be getting a rebuilt computer and for most part this does the trick, but it is somewhat slow and unable to REALLY handle the only purpose I got it for, which making music with my seaboard roli",
                "I'm not an Apple fan really",
                "Everytime I turn computer back on from rest so far, the screen has gone scrambled (like you drop and broke it), but I restart and it's fine",
                "If you need this for work or more uses than soley one, spend more money for a better one."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "One Star",
                "It arrived late",
                "Then the screen was shattered",
                "Along with the outside being dented and scratched."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Works fine with minor issues.",
                "The good : The laptop works great",
                "It came with o.s Sierra but you can upgrade it to the latest o.s mojave",
                "I bought an ssd and 16gb ram separately and was able to upgrade the speed",
                "Make sure you format the new ssd first or it won't read.I issues : After upgrading to o.s mojave, my laptop takes a long time to reboot, restart",
                "It also makes a loud whirling noise along with the normal apple sound whenever it starts up",
                "It seems to get very hot when you use it too long",
                "If your copying files to usb for backup ,they will both heat up",
                "Cosmetics : the screen looks perfect, the back is slightly scratched, keyboards and mouse pad are all working",
                "Usb ports and charger works",
                "I Have not tried the mini hdmi yet."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Product was marked up and had visible stains on it ...",
                "Product was marked up and had visible stains on it, also box was opened and didn't have tape on it"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Defective unit.",
                "Disappointed",
                "The unit shuts down randomly",
                "We received someone else's defective laptop",
                "Returning."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "A good buy for the price",
                "First I put more RAM 12GB Swapped out the old HDD for a SSD",
                "Those two upgrades have made this computer run like a brand new model and hasnt given me a problem at all",
                "Boot time is almost instant and it runs smooth without any problems",
                "The only con was the battery",
                "Battery life without the charger noticeably short and the plug in adapter is a 3rd party plug",
                "Other than that its fine",
                "You can find RAM &amp; SSD for about $100 and watch a few YouTube videos you can easily swap them out in 20 minutes."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Incredible value",
                "Mine appeared brand new other than a ...",
                "Incredible value",
                "Mine appeared brand new other than a few millimeter long scratches on the exterior",
                "He MacBook metal material hides them well",
                "Screen is flawless",
                "Open and closes tightly."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Description not what was delivered.",
                "When I purchased this MacBook in December of 2019 the description said it was a 2017 model that had been refurbished",
                "Well come to find out it is a 2012 model",
                "So in a sense this is false advertising",
                "But if your looking for a used cheaper apple laptop this would work for you",
                "But during the holiday season I found this same MacBook but the 2019 model at best buy and amazon and even apples website for $699",
                "So I could have spent $260 more and got a undented, unused, and not been lied to MacBook",
                "So you do the math",
                "I feel like I shot myself in the foot",
                "But I will keep this MacBook and next holiday season I will see if the same deal is going on for the 2020 MacBook and buy a brand new one."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Horrible",
                "I took this with me for my business trip",
                "The laptop failed on me the very next day",
                "I plugged in the power and the light on the charger would not work",
                "I swapped it with a known working one and still nothing",
                "I work in IT so I checked the battery, hard drive, ethernet port and nothing",
                "The problem is the motherboard",
                "Now I'm stuck with a payment for a laptop that is now a paperweight",
                "If you are going to buy a laptop make sure to spend the money",
                "Usually I would say you get what you pay for, but this laptop does not work at all and I haven't had this very long at all!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great product",
                "Great product"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "One Star",
                "The problem was that it had a software issue the laptop never started again"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Exactly as advertised",
                "Other reviewers have recorded horror stories about getting a machine that was low performing, dirty, etc",
                "In my case the laptop has a small dent on the back cover, and is otherwise clean and near new looking",
                "The OS is up to date, and the machine performs well",
                "Therefore an excellent deal compared to buying a new MacBook or buying a pre-owned direct from Apple",
                "It may be that this is hit-or-miss, or perhaps the refurb source got the message and is doing a better job, I don't know."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "The Product Description Is Not Representataive of What Was Delivered",
                "I've bought several of 2012 MBPs to upgrade and give as gifts for friends and relatives and the one delivered was not as described",
                "1) Looks new?? Very scuffed up and seller tried to conceal by using cheap plastic covers that only inhibited my upgrade efforts",
                "It failed the very definition of the Amazon renewed specifications",
                "2) Clean? Filthy on the insides and outsides",
                "Unlike other resellers who make an effort to clean up accumulated inside grit."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Don’t buy refurbished, it doesn’t work",
                "I just left the Apple store yesterday with this product and it was crashing as we tried to install simple tasks",
                "I wish it was working properly",
                "I want to delete my photos that were loaded by apple genius but I cannot log in to remove what Apple installed yesterday",
                "I’m very disappointed in this product overheated the first time we plugged it in and crashed it didn’t work the very first time we turned it on with Apple",
                "I won’t buy a refurbished item again and don’t know if the return will go well or not",
                "Big mistake"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Quit working after 4 months",
                "Power button had issues from the start but we kept it and used it until it finally stopped working just after the 90 day warranty date",
                "Contacted the seller and they wouldn't honor a replacement or a refund",
                "Took the computer to a local repair shop",
                "They said something had been spilled on the keyboard a long time ago (before we owned it) and it eventually fried the motherboard",
                "Contacted the seller a second time and they again refused to refund or replace",
                "Contacted Amazon and they graciously agreed to refund us our money",
                "I am also thankful that Amazon stands behind their products and sales even if some of their vendors don't",
                "I recommend buying Amazon Certified Refurbished but avoid the seller Renovera if you can."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Never again!",
                "Freezes, the mouse randomly moves itself around making the laptop unusable",
                "I’ll attempt to have it repaired, but for the price, I should have bought new",
                "Never again!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "luv it!",
                "picked up a \"refurb\" for a steal via a 'Mashable dot com\" blast; was some sort of crazy, one day special on Amazon so i leapt at the chance",
                "i luv this little sucker but what i dig most is the fact that it still maintains a CD drive &amp; some other plug in receptacles that newer models have (sadly) abandoned",
                "if you can pick one up for less than $450, as i was lucky enough to nab, you just can't go wrong w/ this little MacBook Pro (still, my all-time fav Apple product - ever)! happy hunting."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "About 2 months after buying my Mac it started acting ...",
                "About 2 months after buying my Mac it started acting all off, it wouldn’t charge, it was really slow, took forever to turn on, the keyboard wouldn’t let me type and if it did it would come out in a different language",
                "And right now it has logged me out and won’t let let me log in",
                "So disappointing"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "*****DO NOT BUY*****",
                "I bought this as a gift and have gotten nothing but trouble from the very beginning",
                "When product arrived and I pulled it out of the box it the laptop rattled",
                "One of the keys were scratched off also",
                "So when the laptop turned on it was extremely slow to respond",
                "The first time the computer worked not great but I figured for the price it worked",
                "The second time I used it the screen soon after digitalized the shut off",
                "So I picked up the laptop and moved it something rattled and then the laptop digitalized then shut off again",
                "Upon cutting the laptop back on for a third time, the overheating battery light came on and the laptop shut off again",
                "The charger that it came with you could tell had been used and not cleaned",
                "The laptop was used and DAMAGED UPON ARRIVAL and not cleaned",
                "THESE ARE NOT REFURBISHED LAPTOPS",
                "I have contacted the seller and amazon and have been fighting for a refund with no success",
                "WARNING!!!!!! UNLESS TOU WANT AN EXPENSIVE PAPER WEIGHT DO NOT PURCHASE",
                "Do your self a favor and purchase a real refurbished laptop from somewhere creditable like Apple themselves",
                "If I could give negitive stars I would too bad that’s not an option",
                "1 Star is too good for this review",
                "There are other reviews just like mine that I have been reading",
                "BUYER BEWARE!!!!!!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "CPU malfunction after 6 months - Don't buy",
                "What a waste of money..",
                "this product is supposed to be \"like new\" and \"renewed\" (from 2016) and literally 6 months after purchase the CPU cores burned and could not power on",
                "Also super slow all this time",
                "Apple store is asking $475 + taxes to fix, which exceeds the purchasing price",
                "After I contacted the company, NexiPC, they sent me a cold email basically telling me \"tough luck\" and that it's beyond its guarantee",
                "They were not willing to replace it or give me discount for future products",
                "Feels like a scam and they definitely don't care about customer satisfaction",
                "Be careful with that company and keep all that in mind when you are dealing with them."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not happy.",
                "Returned it, because it had a scratch when I received it",
                "Plus it was very slow",
                "Didn't arrive as expected."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great buy!",
                "This item popped up on my phone as a 'special deal' and since I'd been wanting to get away from my Windows laptop, I ordered one",
                "Then, I read some of the reviews and started having second thoughts, many people sharing horror stories of extensive damage to the exterior of the laptop and worse, machines that didn't work at all or only for a brief period of time",
                "I'm happy to say that the MacBook Pro I received has performed flawlessly, no problems with software loading, my AirPods and Magic Mouse pair seamlessly, and the exterior has only minor scuffing at the corners",
                "I'm extremely satisfied with this purchase",
                "Thanks."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "falling apart",
                "the charger doesn't even work, the cord is falling apart and fraying",
                "the computer is very slow, you can only run one program at a time or it crashes",
                "really peeved about the charger",
                "I hope amazon will replace it",
                "I just bought this computer and I can't afford to replace the charger."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Skeptical at first",
                "I was worried about buying it but i was fed up with my hp",
                "Im glad i did though! I might as well have thought it was brand new with the packaging it came in! Im completely satisfied"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "You would like test out a team lear",
                "My seller was kind and professional enough to give me my full amount back Amazon is one of smart seamless online business and great warehouse, Jeff B is my mentor I have great skills by following him, if leader will give my team members encourage guidance to empower to work efficiently to the job right on time, I want be hired in corporate that my talent gift tecnology A PEACEFUL WORLD WHERE EVERYONE EXISTS DESPITE THEIR DIFFERENT COUNTRY COLOR OR RACE&nbsp; HARMONY’S SWEET MUSIC SO WHY CAN'T WE DANCE TOGETHER UNDER THE BRIGHT MAGICAL STARS SKY OUR WORLD HAS PLENTY TO SATISFY NURTURE THE WHOLE HUMAN RACE IT'S MUCH EASIER TO LOVE THEN IT IS TO HATE RESPECTING EACH HUMANS DIGNITY TO CREATE HEAVEN IS HAPPINESS MORE POWERFUL THEN HELL WAR HURTS US DESTROYS US ALL GLOBAL KINDNESS WILL WIN WITH PROSPERITY FOR ALL &nbsp; PEACE ON EARTH IS OUR MANTRA FOR HARMONY WILL PREVAIL LOVE AND KINDNESS IS OUR NEW WEAPON THAT WILL HEAL LOVE TARO ©TAROSARTS"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Not worth it.",
                "This came defective, the Camera would not connect, and it would state that FireVault needed to encrypt the disk",
                "And for 24hrs it kept bouncing between an estimated 6-7 hours to complete, but never does",
                "I needed this for school because I was going on a trip and it was a big fail",
                "Spend your money buying a brand new one instead save yourself the trouble."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "WORTH IT!!",
                "I was very nervous about buying this computer for such a “cheap” price but I’m so happy with what I received",
                "It’s really unfortunate seeing some of these really beat up computers that people are posting",
                "I hope everyone gets the great quality computer I got",
                "I would definitely recommend for the price!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great Purchase from PrimeBuys",
                "Mine looks and runs like new",
                "After reading all the negative reviews I decided to buy mine from PrimeBuys for $40 more to give myself a better chance at getting a great MacBook Pro",
                "It has a fresh install of the latest version of Sierra",
                "I did not test the battery because mine is always plugged in for Home Sharing",
                "It has a gigabit ethernet port",
                "The only somewhat bad thing is that they didn't name the main hard drive ..",
                "it should have been named \"Macintosh HD\" but it is \"untitled\""
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Misleading: Advertised as MacBooks Pro from 2017, but it is from 2012!!!",
                "They provides materially misleading information: They advertise that this MacBooks Pro is first introduced in 2017, but when u purchased and verify its year on Apple System Preference, it says it is from 2012!!! Also, i just opened it and the Apple pro had a dvd drive with it that keeps making annoying frequent noise all the time even nothing in it",
                "I will further test it and then update back here."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "good to be true",
                "I'll try harder",
                "Sorry Amazon",
                "Now this is my favorite part of my MacBook Pro and I'm hoping to get started with learning how to use it better, I've never been in it and I need to learn more about my phone before I go to the laptop",
                "Yeah, so I have a little trouble signing in and out, and I'm always messing up on my phone as I try to make orders for this stuff I'm buying",
                "I'm hoping to get better and won't be messing up my orders for this app"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Perfect for my son's activities"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Laptop is in like new condition and runs the same",
                "This laptop is a legend",
                "Still the best seller",
                "Works great as is or you can upgrade to make it easily 2020 compatible",
                "This is the last laptop that Apple produced that is upgradeable",
                "My battery is a little jacked but that is an easy fix",
                "It is a little hard to believe these really bad reviews about this company",
                "My laptop and experience with this company was and is just fine",
                "If any issues arise, I will post the results."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Did not work too well",
                "The battery drained after 20 minutes use and the speaker did not work at all",
                "No recommendation here",
                "Could not replace the item",
                "I had to send it back and practically beg for my money",
                "Not recommended."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Goes slowly",
                "Probably best to upgrade the SSD right away",
                "It is a good basic computer",
                "Still needs some updates",
                "Bought it for myself and as a first computer for a college freshman",
                "Make sure you configure it properly (call Apple tech...they can do it over the phone)",
                "Runs slowly so it would be worth it to upgrade to SSD immediately",
                "Got to use the DVD player which is a huge bonus."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "POOR EXPERIENCE",
                "This seller needs to do more on the CPO (Certified Pre Owned) products",
                "The battery is sub par and the keyboard needs replaced already",
                "VERY POOR",
                "Not even 100 days old"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great customer service!",
                "I ordered this computer close to a year ago, I consistently had trouble with speed and function",
                "I finally got fed up, thinking I bought a dud",
                "I contacted the seller-they responded immediately and provided me free 2 day shipping to return the computer and get a replacement (also 2 day shipping)",
                "My new computer seems to be working great, I have only had it less than 2 weeks, but so far so good",
                "I was shocked that they would replace it almost a year later- thank you! Highly recommend this seller!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great computer!",
                "Bought this for our daughter who's in college",
                "Was a little concerned with it not being an \"official\" apple refurbished machine but she's had it for a month now and no issues at all."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Customers Dont Matter",
                "I have had this for less than a month its done nothing but give me issues now it wont connect to the internet and says the network is not configured nothing helps ive done everything that I can find online from my phone to do i spent an additional 100$ for classes to help me learn the system and os",
                "Im out over 600$ and countless hours of time no one wants to help me anywhere im ready to cancel my Amazon accounts everything from prime to my Amazon credit card."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good tape, overpriced here",
                "Got this for our son because we homeschool and he needed a better quality laptop as he is getting older and doing more online schoolwork",
                "He's had it for a little over a month and we've had no problems with it",
                "Some apps won't download because of the outdated operating system, but we knew that when we bought it, so that's not really a complaint",
                "I am happy with the purchase."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Had an issue, but seller was great!",
                "Updated review: The Macbook came with a bad hard drive but the seller refunded the price of a new hard drive",
                "After changing it to a 1TB SSD it works very fast (just as fast as my expensive Windows 10 laptop with an m2 nvme drive in it)",
                "Unfortunately I kinda jumped the gun and wrote a bad review for the seller so I'll say it here: Certified Resellers is a great seller!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "good product, good price",
                "very bad packing",
                "good portable, great value price ratio",
                "Really well conserved (could clean the charger cable that was dirty muu)",
                "very little details, almost optimal",
                "the big problem was the packing, the fdx box with the laptop loose inside",
                "It must have been good, in this case they were very deficient."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Computer life Did not last long at all",
                "I purchased this laptop in February, it stopped working completely in November and I had to get another laptop again",
                "Such a rip off!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Bad Laptop",
                "The bad reviews from all the customers is exactly right."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good deal on a solid machine that can be upgraded to modern day specs!!!",
                "Very pleased with the condition of the laptop when it arrived..",
                "Being renewed I knew it may be a gamble..",
                "There were some light scratches but I have it in a case any way so no big deal..",
                "This particular model of MacBook pro is user upgradable so I installed an SSD and more RAM...",
                "It flies like any recent model machine..",
                "My only gripe would be that one of the ram modules was not fully seated and it appeared that I had less RAM than paid for when I went into system profiler but it was ok because I was upgrading ram anyway..",
                "When I went into the machine to upgrade the RAM I saw that in fact there were two modules just that one was not properly seated...I will buy from this seller again!!!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        }
    ]
}