{
    "data": [
        {
            "text": [
                "Very Good",
                "A well designed and compact laptop",
                "It is taking me a bit of getting used to because it has been five years or more since I bought a laptop and things have changed a little since then I have no real comment to make concerning it's gaming applicability as I do not play computer games."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Brilliant",
                "Purchased three of these doe my granddaughters aged 11/12/13 years old for achool work and facebook / WhatsApp etc Absolutely fabulous value for money as a gift from Nana and Grandy .",
                "Paid extra for virus protection and had them set up ready for Xmas Delighted 😁"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent Home school laptop purchase",
                "Bought this laptop to help my 10 year old step daughter with her school work at home",
                "My friend who has better knowledge of computers recommended this as an excellent laptop and value for money so we looked at it and it seemed like the best value",
                "It feels made of good quality materials and it was so simple for the two of us to set up together",
                "It has improved home schooling and she is extra happy as she can also play Roadblocks and go on you tube",
                "You can set up age restrictions",
                "The webcam and speakers are good",
                "Definitely feel this is what we needed, good value for money and we are pleased with this laptop"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Really good price and works a treat",
                "I really like how thin and light weight this laptop is",
                "It came well packaged and was delivered earlier than stated which I was very happy about",
                "The sound and screen quality is fantastic",
                "I'm really looking forward to using this laptop for my college course",
                "Would definitely recommend!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little thing",
                "Sceptical at first when deciding to order form a producer I've never heard off, but encouraged with all the positive reviews",
                "Arrived in top speed time, good protective packaging both from the producer and Amazon",
                "It was never mentioned, but the screen is antiglare, so another amazing surprise",
                "Starts up quickly, instalation super easy",
                "Keyboard is great, a pleasure to use",
                "I even chanced it to install Digikam and it has no problem running a photo editing software, for as long as the files are not in RAW format, it is obviously struggling with that, but again for the spec and price it still performs",
                "Overall super happy with the purchase, the first impression is really good."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent",
                "Excellent",
                "There was an issue with the order, laptop came with a 2 pin plug charger",
                "Amazon supplied the correct pin a day later",
                "Excellent product and excellent Amazon!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Useless rubbish very slow buffers all the time",
                "It came with a 2 pin charger for the uk usesless now i have to mess about returning it wil prob have to pay postage cause not everyone has a printer to print return label .",
                "update had to buy the charger ..do not buy this lap top its very very slow ...piece of rubbish"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very good purchase, no regrets",
                "I am so happy with my new computer",
                "It is beautiful, compact, light weight easy to handle and travel with",
                "The screen quality is perfect",
                "Images are sharp and clear",
                "It is quick to load programs",
                "The AI is very useful and helps to set up my laptop in no time",
                "The battery life is very good",
                "I am looking forward to using my new computer to do exciting and productive things."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop",
                "I was a bit sceptical about the laptop due to the price, however I can honestly say this is a great machine, better than I anticipated, it has a great screen and sound, it is also faster than I expected, I have already tried this for running some information and it handles it perfectly",
                "The keyboard is American however you get an overlay which is a perfect fit for a UK keyboard",
                "My partner loves it also so will probably never get to use it again",
                "Highly recommend"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good price, arrived in timely manner.",
                "Used mainly to attend meetings, online banking, access to e-mails, watch Netfix etc",
                "So far so good",
                "Caters for all my internet requirements, this laptop offers quick responses to my operating needs, easy to use",
                "I'm happy."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Brilliant for the price!",
                "I bought this for my wife",
                "it was easy to follow the set up process and to set up an office suite for her",
                "The rubberised keyboard overlay to use as a UK keyboard was a surprise, but the feel is much better in use than on other machines",
                "My wife is happy with it so I am a happy man!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good price for this laptop.",
                "&nbsp;Good price for this laptop ; i recommend this laptop to those , who doesn’t really like big laptop because this laptop is really small (good to handle) and it is very light ( really easy to pick up).Also I bought this laptop for my son ; it is very easy for him to do his homework , since most laptops aren’t made to do homework’s.The battery life is great (5/6 hours) , before recharging the laptop."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good economy laptop",
                "Had to send first one back due to an issue with charging",
                "Replacement has been good so far",
                "2months Good for school work and plays roblox",
                "Shame it is an Italian keyboard and comes with a silicone overlay",
                "On the plus side this should stop dirt getting in."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Screen flickered on second day",
                "Now, I wasn't expecting a miracle at this price but having read the reviews I did expect it to work for a while",
                "Let's forget the fact that the speakers are so bad as to be pointless",
                "The screen started flickering on the second day",
                "It just wouldn't stay on ,it just flickered",
                "I took video footage in case anyone thinks I'm making this up",
                "Now, it did stop flcikering and then work normally after about ten minutes but I decided it wasn't worth the risk and sent it back",
                "If you don't care about bad sound and perhaps fault wiring, buy away",
                "It was otherwise quite performant."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Avoid.",
                "Does not come with a genuine windows 10",
                "It came up with a warning saying using a un genuine windows leaves your personal details",
                "It is not supplied with any sort of windows product code",
                "This product is awful and contains fake software."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Outstanding",
                "My laptop recently blew up and I needed a low price machine that could handle my office applications and typing need (email, script etc.) 8GB of RAM really packs a punch and allows me to multitask and also serfe internet with multiple tabs",
                "Space isn't huge but but ample for my needs and I can access all documents on the cloud",
                "Perfect for coffee shop use (if they open ever again) or low risk travel companion",
                "Light and easy to use, a win win all round."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great Value for money",
                "This was purchased to replace my wife's aging laptop",
                "It is needed for doing home accounts, home banking, facebook and emails",
                "It does all of this with ease",
                "A good looking, easy to set up device that does everything we need",
                "I have had very good help from Jumper support who responded to my emails promptly",
                "At first the device was not recognising the SSD card I had installed, but the support desk helped me resolve this issue and all is now ok",
                "If what you want is a compact, basic laptop for simple tasks, this fits the bill perfectly at a very reasonable cost,"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good quality&amp;low price",
                "Size! Size always matters when you buy laptops",
                "This laptop is light weighted and so it is very convenient when you want to carry it around with you",
                "Another good feature is that the screen quality is as clear as those laptops you buy for a cost of 2x or more expensive, which is definitely a good deal for all of us."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great value",
                "Excellent laptop I bought for doing university work and it’s great does everyone need and more! Fantastic price and would definitely recommend as have everything a lot of the very more expensive laptops have too",
                "Really pleased with purchase 😊"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Value for money",
                "Arrived in plenty of time, I'm surprised just how light it is",
                "Only down side is it came with a free gift of which when you look into it it's all written in Chinese without being able to convert into English I've only had a couple of days but so far very happy with it"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "why has no sd slot",
                "it is good for office working, i used use phone or tablet to do my documents work or spreadsheet, but yet, it is very un-convenience and small screen",
                "specially when typing",
                "this laptop is cheaper, and have good deal when i bought it",
                "large screen and 128gb big capacity storage",
                "it saved my time and easy to do my work",
                "only one shame thing, it has no cd slot.",
                "so i have to by external cd for it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Easily set up within minutes",
                "This was a replacement Laptop after my previous one died",
                "I honestly had never heard of ‘Jumper’ but having read the reviews, i thought it was the best deal at the time",
                "I wasn’t disappointed, I was able to set it up myself within minutes (usually have to get someone to do it for) and it was ready to go! Bonus was free annual subscription of Microsoft Office which was really easy to install",
                "So far, it hasn’t disappointed."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Do not buy!",
                "I bought this laptop because I came across lots of good reviews for it and the specs are a lot better than other laptops in a similar price range",
                "When the laptop arrived, it worked fine for a week",
                "However, it suddenly stopped turning on properly and got stuck in a boot loop (screen would turn on, logo would come up then after a few seconds it would turn itself off and that process would start again)",
                "I subsequently returned the laptop and it has taken a while for my refund to be processed",
                "Don't waste your time or money on this product."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Amazon are fantastic for when you have a faulty product",
                "Guaranteed refund no fuss 😊",
                "&nbsp;If this laptop had worked correctly it would have been great",
                "Sadly when it opened up after been in sleep mode it flickered so couldn't use it 🙄 I have just returned the product, be careful because it would not let me do a factory reset at all!! Very frustrating, spent 3 days using you tube tutorials none worked!! Fortunately I knew a man that could otherwise it would have been very difficult to return 👍"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Best value by a mile",
                "Having spent a long time researching I finally decided to purchase, bit concerned it was an unknown make! Shouldn’t have worried does everything brilliantly, with recent events I was perhaps slightly anti Chinese but have to concede they still make the best quality and value for money, would highly recommend"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good picture screen.",
                "Cheap and cheerful, processer fairly fast and expansion bay a good feature",
                "Picture quality very good and sound is reasonable",
                "Battery life lets it down but overall good laptop for price, recommended."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great value for money, gaming and videos too!",
                "I bought this for my daughters 10th birthday, to say she was ecstatic is an understatement!! She was absolutely thrilled with this and so are we",
                "She plays Roblox more often than she should, and watches hours of YouTube too",
                "In between her ‘me time’ it’s pretty good for her school work too!! 😂 overall fab laptop for the money, great investment and massively in very happy child!! Would definitely recommend!!!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop but disappointed.",
                "Great quality product easy to set up and looks like a higher end product",
                "Mine did NOT come with 1 year free Microsoft office 365 as advertised",
                "Beware",
                "Amazon stepped and gave a partial refund as a gesture of goodwill."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent little laptop at the price.",
                "Excellent for the price",
                "The screen quality is very good,you could pay a lot more and not better the quality",
                "Bought it for my granddaughter for school and she is doing everything and more",
                "Really loves it"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Cheap and ideal for Internet use",
                "I liked the price because it made it affordable",
                "I find it works just as good as a more expensive laptop",
                "It is light to carry so it would be ideal when travelling",
                "I use it a lot and it never fails me",
                "I recommend it to students and adults with a limited budget."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Worth the money, great inexpensive laptop.",
                "We needed a new laptop but did not want to spend fortune",
                "This ideal for my sons school work, surfing internet, Netflix, you tube etc",
                "Also I use it for a second work laptop to check emails and teams",
                "Money well spent."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It arrived on time.",
                "It arrived on time its taken me a few days to get used to it but I now like it",
                "The only thing I do not like is it gets quite hot when being used on my lap",
                "Is this unusual? Or do you think it may be faulty?"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent value and performance",
                "Great value for money",
                "The performance is exceptional for the price",
                "Battery lasts well, it is very slim and lightweight and handles multitasking easily",
                "Would definitely recommend."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very affordable price",
                "This 13.3-inch laptop is very light and the product configuration is consistent with the description",
                "It doesn’t have a brand logo",
                "I think its biggest feature should be its high performance-price ratio",
                "If you don’t care about the brand, you can choose"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Easy to use",
                "I bought this computer as a birthday present for my daughter, she liked it very much",
                "It is cheaper and easy to use",
                "Delivery very fast."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "goodforprice",
                "I cannot tell you anything about this lap top as I have bought it for a christmas present so I have not used the computer at all I have only he box to see that it was ok."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Very pleased with the item",
                "Arrived as advised, very well packaged and protected",
                "Product is very good, elegant and neat",
                "Setting up was easy and so far, only had it 2 days, all is good",
                "Very pleased with the item."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Delivered on time.",
                "Laptop received",
                "Looks good",
                "Currently on charge before starting up and discovering what it can do",
                "Ok, started it up and...it's a pre-owned unit, Nicola Guthrie, whoever you are, I can't get past the log on screen as I don't know your password! Seriously! I am about to contact customer services to arrange a return."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Would recommend",
                "Bought my daughter this for college",
                "I have not seen it but my daughter said it does the job",
                "Will see in time if it wears out but hopefully not",
                "Would recommend"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Keyboard",
                "Whoever made this laptop done the keys wrong",
                "They put the @ sign above the number 2! When it’s supposed to go near the enter button above the ‘ key",
                "I know this due to doing business studies for 4 years and constantly working on computers",
                "I also know this because the @ key works if I press it near the enter button🙄 so confusing! But a faulty"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not great at all",
                "My son has used it for school work for 2 weeks and the screen keeps going off",
                "Slow at opening up anything",
                "Really not happy with it",
                "But as you do..",
                "threw all the packaging out at Christmas so guessing no return!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Avoid at all costs! Faulty &amp; unusable within 2 weeks TERRIBLE customer service",
                "Had it one week and the screen is faulty everytime I turn it on (see pictures), I have to turn it on and off several times to get it to eventually work",
                "While waiting to return the laptop for a refund it also stopped charging! In the space of two weeks the screen was faulty and it totally stopped charging! Also TERRIBLE customer service",
                "Avoid at all costs."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Surprisingly great quality for the price!",
                "I’m very pleased with this laptop as didn’t expected much from this price range",
                "It’s arrived in well package",
                "A perfect laptop to do work at home during Covid",
                "The laptop is so compact, thin and very light to carry",
                "Yet the performance is top quality",
                "It’s processed smoothly and fast",
                "The screen quality also high crisp and clear solutions",
                "I would highly recommended “ It’s great value and decent “"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good all round laptop but I'm not a gamer.",
                "Good, positive soft touch keyboard and very responsive",
                "Speedy and user-friendly ",
                "I use mainly for emails and web-surfing",
                "Do all of my shopping on line these days",
                "This is a keen and comfortable machine."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not as easy to set up",
                "Other reviews made it seem this pc was so easy t0 set up ",
                "But if like me, your a bit thick when it comes to tech",
                "It is not so easy, my fault but got there in the end",
                "Who do I invoice for the hair loss lol"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Patience when installing windows updates at 1st as took mine over 3 hours.",
                "Was going to return as it wasnt updating windows, but it did eventually update after a few hours",
                "So have patience if you have the same issue and it will eventually install",
                "Other than that it's good if your just looking for a cheap and simple computer of your not willing paying few 100 more for much better one",
                "Good though and yes can play games on it, but not a gaming computer so of course a limit to fps on certain high graphic games."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "No uk keyboard overlay",
                "Usa key board no overlay for uk in box so as good as useless to me contacted amazon but no overlays kept by them makers office china so no phone contact .will return"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Very good Laptop with excellent storeage upgrade options and faultless custmer Service",
                "Love this Laptop, upgraded to 256 GB with MSata on which I reinstalled Windows 10",
                "Customer service responded to my query promptly and effectively",
                "Highly recomended."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great compact laptop",
                "Really nice compact laptop",
                "Starts up really quick and gave step by step instructions how to set up - I followed it and I’m non savvy ! Great quality and lightweight Only being used for school work and it does the job I was originally looking for a Lenovo laptop, but the reviews were not great, so I went for this one",
                "Really happy with my purchase"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great Laptop",
                "This is an amazing computer for the price",
                "Very easy to set up, voice activated and step by step instructions .Bought this laptop for day to day use such as emailing, web browsing and movie watching etc",
                "Battery life is amazing, screen resolution is really good and is amazing value for money",
                "I recommend this great product to anyone , you cant go wrong if you decide to purchase it",
                "I am reall over the moon with it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Works well",
                "Bought this to try out, amazingly good for what you pay",
                "It works well and good value ",
                "I don’t play game, only for work",
                "It’s spot on."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great product",
                "Bought as a gift for my husband who is just about to start setting it up",
                "One thing to note is the keyboard is not set up properly for UK and so he has not been able to use it yet."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "a nice light weight laptop at a good price",
                "delivered well packed and found it to be a really nice and lightweight laptop.its easy to set up and then works efficently, had Windows 10 and Microsoft Office preloaded",
                "once set up its very fast to turn it on just about 5 secs! and the battery life is better than expected",
                "highly recommend!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Worth buying budget laptop",
                "It is brilliant laptop",
                "I needed a decent, light weight and good screen quality laptop to use daily",
                "This has exceeded my expectations",
                "It is great value for money and battery life is good",
                "Great buy!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nimble and Quick",
                "User friendly, quick connectivity that holds steady, and opens pages at a decent speed",
                "Battery life won't last all day, but that's ok",
                "For the price, it's worth it"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Competitively Priced Small Laptop",
                "This is the second Jumpertech product I have purchased this year - the first was a lockdown necessity for a relative, and has behaved perfectly since Spring",
                "I wanted an inexpensive laptop for video conferencing and this has fulfilled my expectations - easy to set up, battery life is adequate",
                "I haven't taxed the processor too much yet but the speed is OK!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great , now that things have been sorted",
                "My first troubles with this purchase was down to Microsoft login software",
                "No way would it accept1937,my date of birth, the computer is ace and is a powerful little tool",
                "My beef with the software us been sorted"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nifty little laptop",
                "It's brilliant, small lightweight and fast, it does all that the kids need for their schoolwork",
                "Mouse it quite sensitive but with more use we'll get used to it",
                "Fast delivery too which was useful and it was urgently required as both children in isolation from school..!!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great buy.",
                "Excellent buy top quality product, great screen and very good battery",
                "Highly recommended a must buy at this price."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Easy set up, lightweight.",
                "Lightweight",
                "Good laptop for my son to do his schoolwork on",
                "Easy set up",
                "Very pleased with this laptop."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "No free Microsoft for 12 month",
                "Not too happy, I bought this particular laptop because it came with Microsoft 365 for 12 month for free",
                "When installing it said I had 1 month free trial, I activated it, then and update for 12 month appeared everytime i tried to activate it, it said error! And now has expired! Feel like its false advertisement as that was the main reason I bought it."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not bad for the price",
                "This laptop is pretty good for the price",
                "Runs low end graphics games OK, and has only crashed on me once so far",
                "Am pretty chuffed with it."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Mikeys Honesty",
                "Takes ages to turn on, every time",
                "Abit slow to be honest",
                "Spend that bit extra on abit more quality."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good laptop, Microsoft is not free !!!!",
                "Overall I am very happy with that little machine , only problem was that promised one year Microsoft office was not free for one year",
                "I was fuming when found out that subscription was taken off my bank account!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great quality for the price!",
                "A lovely, ultra-light notebook with a good amount of memory for the price",
                "My son uses it for roblox and minecraft which it is more than adequate for",
                "A great quality product at a decent price."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great value",
                "So far so good",
                "Lightweight, quick to charge, good screen",
                "Great for my daughter and school work."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great product",
                "This laptop has some great features",
                "For example, it is light-weighted and so if you work away from home, you have no idea how easy it is to carry it around with you",
                "Also, the keyboard is comfortable to use, especially it comes with a free keyboard cover-it helps to prevent dust entry and overall keeps the laptop clean and tidy",
                "It’s worth it for buying a laptop for this price!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Windows Setup Is The Pain",
                "The product itself is very good value for money especially as it comes with a UK keyboard overlay",
                "All Chinese laptops are made with US keyboards (no £ sign and the @ sign is moved)",
                "This PC has an overlay which makes life easier",
                "The PC itself works fine, but the Microsoft setup is a pain and took four fours as many updates were required and lots of restarts",
                "Once over this, everything works well."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Neat",
                "generally a neat little thing to get",
                "steams videos with only minor hiccups if you load it in too fast, not too small which is great for portability, crisp display, battery on the small side but that an obvious, the laptops thin",
                "might be the best laptop your gonna get for this price Im a happy chappy",
                "you will be too."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not working in 7 days",
                "Had laptop delivered and in 7 days already not working and unable to fix",
                "Awaiting manufacturer to contact me but already wanting my money back so not recommended to purchase this laptop"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Quality item",
                "Bought this laptop for half the price of a Dell or hp etc, from what I can tell it's probably just as good, really good purchase"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Fantastic little laptop!!",
                "Fantastic laptop which I bought for my son to complete his homework on and it has everything he needs! Fully recommend this product as so far it has met all his expectations and more! My son is quite happy with his new laptop! It is lightweight and portable so my son can also take it to school with him! Overall very happy with the product!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Fantastic and easy to use x",
                "I absolutely love my new laptop and I couldn’t be happier well done jumper it’s excellent value who needs Apple"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good value",
                "Not the fastest machine but very useable, size and weight make it very portable."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Ease of set up and use",
                "Set up easy, however problem with @,key to begin with",
                "My daughter finds it very easy to use now",
                "Initial problem resolved."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect for university l.",
                "First of all if you are in prime this laptop will come so quick! One day before the intital date",
                "It’s a great laptop for university",
                "I do computing and this laptop has so much space",
                "It looks good",
                "It runs smoothly",
                "And it’s very cheap",
                "It does more than those expensive laptops and it’s also long lasting",
                "I own two of these at the moment it’s great."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Easy to use",
                "This is perfect for school work especially during lockdown",
                "Quick delivery too"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Well worth the money",
                "Well worth the money , , less to Han £200 , got office for a year, super fast loading can't say enough"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Faulty Screen - pixel problem",
                "Bought this for my son - found really hard to return as no amazon contact - labels would not be accepted for the post office or Hemmes and no local UPS..",
                "trying to contact someone to find out how to return item - so far spent 4 hours on this and no further forward..."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "good",
                "Ordered 2 laptops 1 is excellent quality, 1 has stopped working, trying to get hold of someone has been a nightmare! still not sorted yet"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great buy",
                "My son loves this",
                "He can play roblox and Minecraft",
                "He hasn’t tried other games but I was surprised it could do Minecraft",
                "He does his school work on it, uses word to Erie stories and watches videos"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Quality at a great price.",
                "Easy quick set up with office 360 installed and included for free",
                "Great quality nice bright display."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good product for less price",
                "I havent used it much so far but it looks good",
                "Decent size and screen quality",
                "All the specs u need are there."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice laptop",
                "Had trouble setting up Microsoft 365 but great customer service and got it going fairly quickly"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great value",
                "I bought this for my 12 year old daughter who wanted a PC that was quicker than the old one",
                "This laptop does exactly what she needs for an affordable price compared to the well-known brands",
                "She says the camera is a little poor quality but I would still recommend the PC as value for money."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Fantastic quality",
                "Brought this for my son for school work and it is amazing",
                "Great quality and a fantastic price",
                "Highly recommend to anyone looking for a good budget laptop!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent Value",
                "Fantastic ,excellent buy and with a years free office! Light and nice and slim."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "reliabilty",
                "to date surprised if not relieved this laptop is proving reliable, when considering the price paid it seems to be produced with quality in mind",
                "I'd never hears of 'Jumper' so it's with confidence I write and suggest it'd worth consideration for a budget buy."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Big name performance on a no brand machine",
                "Too early to talk about reliability but really pleased ,does everything we need it to do,very fast and light."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Very very slow starting up .",
                "System takes around 30 minutes to boot each time I turn it on",
                "It installs updates cleans the hard drive and his knows whatever else",
                "Only worth of you have tons of free time on hand."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Sleek and portable",
                "Its sleek and portable, easy to set up and very light",
                "The only downside is the battery life its not giving me the 7hrs so far, it could be because I am still downloading my apps",
                "Othe than that it does what other high-end laptops do."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "great for homework",
                "having only a 1 month microsoft word subscription but apart from that all good"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Nice little laptop",
                "Initial one was faulty but was replaced instantly."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "You get what you pay for",
                "I guess you get what you pay for",
                "Very sluggish so ok for basic stuff but not for delivering live lessons via Teams as I have found out!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Broken after 2 weeks",
                "Laptop is fine but keyboard broke after 2 weeks",
                "1 month later and and I am still waiting for Jumper to action a replacement",
                "Amazon have been helpful but Jumper are non existent",
                "Also cannot type a | which I need for our business website, and cannot find a way around it which is irritating."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great quality and runs well",
                "Great quality, highly recommend, used for work purposes"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent buy",
                "Early days yet but impressed with build quality .seems speedy enough for a low spec computer..zoom works well",
                "For the price it’s great"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        }
    ]
}