{
    "data": [
        {
            "text": [
                "Perfect for School",
                "Started school and have a couple of online classes so I bought this so I can work on homework/reading at work during my lunch and so I can take it on the go if I leave town",
                "It's a very convenient size and I'm really liking the keyboard",
                "I'm used to clacking away on the keyboard for my PC, but these are much softer, but you still get the \"I pressed it\" feel and sound",
                "I don't mind the Windows 10 S at all since I'm not really interested in downloading a bunch of apps",
                "Usually use google chrome, but Microsoft Edge isn't bad at all."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Poor screen, OK laptop.",
                "Pros: sound quality is pretty good",
                "Lightweight and small",
                "Speed is OK for office work",
                "Cons: screen quality is poor",
                "Only a very small angle of view is decent for videos or pictures",
                "The contrast and color have much to be desired",
                "I wish I spent a few dollars more for a better screen, but it's not bad for what I need."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect Go-Between Laptop",
                "I was looking for a small-yet-sturdy laptop that could be tossed in my bag and easily transported to and from work, the library, a coffee shop, or just within my house",
                "I mostly use it for the Microsoft Office suite and web browsing, occasionally some light video streaming, and that's about it",
                "This little guy runs beautifully with Windows 10 S, everything loads quickly, resolution is gorgeous, and the battery life is outstanding",
                "Honestly, unless you need a full on gaming laptop or something for intense video editing, this is probably all you'll need",
                "Couldn't ask for better, especially for such a great price!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I don’t hate it",
                "It’s a very basic tiny laptop",
                "I wanted a Lenovo 2 in 1 but the one ordered arrived with 4 keys that didn’t function",
                "I ordered this as a replacement",
                "In a world of touch screen laptops and tablets this isn’t one",
                "The entire shell feels very cheap",
                "It will probably be fine for what I bought it for ( reading and storing old business emails ) but I’ll never love it",
                "I wish Lenovo 2 in 1 wasn’t garbage"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "In 2 month The charger don’t work",
                "after 2 months of use only for virtual classes of child in second grade, the charger stopped charging, does not work, I contacted the seller and never answered",
                "I do not recommend this product and much less for the lack of attention of the manufacturer who is supposed to give me a 3-month warranty",
                "I do not recommend this product no matter how cheap you see it or at least this seller"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Meh for Windows, 5/5 for Linux!",
                "If anyone's going to use this and hasn't done so (or doesn't plan to do so) look into beginner Linux distros, this thing is the most amazing combination of cheap, portable, and competent once it's free of window's aggressive battery/resource demand",
                "The ports on this are fantastic and should remain useful for the next 5 years at least, with HDMI &amp; 3.5mm AUX for audio and HD video outputs, bluetooth, USB 3.0 slots, a USB-C slot, and a microSD slot to increase storage to something a little more reasonable",
                "I can, and have, used this as a portable media center to \"hijack\" TVs at friend's houses for movies/TV",
                "If you don't plan to try out Linux, it's bearable for a quick news or facebook check, but if you spend a decent amount of time on laptops, this is the ultimate work pony."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Don't get this!",
                "It already started with it's very flimsy design of the laptop",
                "Then, after logging in for ten minutes of unnecessary time, it presented account making errors and couldn't download even Google Chrome",
                "When we tried, it said to purchase that feature for $199",
                "My MSI did all this in mere minutes and didn't do any of this so it couldn't be a Microsoft issue",
                "The real reason we sent it back is because it couldn't even run Google or YouTube smoothly",
                "The description is inaccurate",
                "The processor is completely out of date",
                "The description is false",
                "Don't get this",
                "While versatile and good looking, it isn't even worth the posted price at all."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "7 Hour battery life",
                "Battery life is a plus",
                "The antiglare screen makes it subpar for movies",
                "The ASUS L203MA-DS04 VivoBook is great for movies, which I also have, but battery life became poor",
                "I would purchase again."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Piece of junk",
                "I've had this laptop less than 90 days and it started giving me problems after two months",
                "It is requiring a hard restart every time I have to turn this thing on",
                "It's slow as molasses",
                "And I only used it for my school work",
                "I really want my money back but after 30 days you can't",
                "I got the warranty and that's a joke",
                "They told me to do a factory reset",
                "This thing when I do get it to turn on is saying I tried to use my password several times and no one has it was off",
                "So I'm thinking how is a factory reset going to fix this especially if this thing has been hacked in some kind if way",
                "Just totally avoid this laptop."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Do not buy",
                "I take back my positive review",
                "It's damaged",
                "Bought in February and has packed up in October"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "excellent computer for basic work",
                "i needed a computer for basic work",
                "MS office, internet, and the like",
                "i did not want a chromebook",
                "the size is small, but the screen resolution is so good that it's not an issue",
                "it's easy to get to normal windows 10",
                "the solid state hard drive is fast, but storage is limited",
                "however, there is plenty of storage for basic work and programs/apps",
                "the battery lasts forever",
                "i'm very happy and would highly recommend this."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "DON'T RECOMMEND",
                "IT'S NOT WORTH IT",
                "I purchased this laptop on 18th of September 2020",
                "I purchased it for 1 reason, for my 7 year old to do his online schooling, was able to download microsoft teams",
                "So he could get his classes on",
                "I was able to get my son to used that annoying laptop 4xx",
                "The size wasn't the problem cause it was small enough for him",
                "But this won't turn on at all",
                "Like it's upsetting",
                "Within less than a month, it only came on 4xx",
                "And now it won't charge nor turn on",
                "Thankfully my son had a tablet to do his schooling",
                "Waste of my money Why sell a product to people when you guys know it's a waste",
                "I'm pretty sure you guys know the issues with these laptops",
                "But still put it out here so people like me can buy",
                "That's not right",
                "I'm highly upset that fact that I spent all that money for a laptop that just stopped working",
                "Won't charge, nor turn on"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Just what we needed!",
                "I ordered one of these for my youngest son to do his schoolwork after the schools were all closed, so he wouldn't have to keep using my work laptop",
                "It works really well",
                "We haven't had any issues",
                "I liked it so much I ordered another to replace my older son's 4 year old laptop, and I got one for myself",
                "We still have not had any issues with any of them",
                "Set up was super easy",
                "Both kids are able do their school work and they're able to play some Steam games so they're happy",
                "I was able to download Skyrim and it seems to work just fine",
                "The laptops don't have a ton of memory so I also got some 128 GB mini SD cards to use and that was super easy to do as well",
                "Overall, for this price, this is a really great laptop",
                "I would recommend these to anyone that needs a laptop, maybe not for anything heavy duty, but for personal use it's great!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Wonky mouse, no keyboard backlight",
                "This is an overall great laptop for the purpose in which I purchased it--writing documents",
                "My biggest complaint is that the mouse seems to be a bit wonky",
                "I saw that this was mentioned in previous reviews, and yet I still threw my dice",
                "Aside from the VERY iffy mouse (I am still debating if I will honor the warranty for it, as it is that bad) it is great",
                "The only other minor tweek I believe it could really benefit from adding a back light for the keyboard",
                "I'm a writer, and write primarily in the dark/at night, as do many other writers, so a backlight is significantly appreciated."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Internet speed is slower than dial up!",
                "Great for taking minutes at work and the keys are easy to use",
                "However, the internet speed is slower than dial up and it's to time consuming to use for internet research",
                "Returning!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This computer is a lemon.",
                "The power switch was erratic, often not powering the computer on",
                "Now the Motherboard has to be replaced",
                "This was suppose to be a new ASUS, not a refurbished one",
                "The failure of a two month old computer is something I have never experienced",
                "I am waiting for the repair shop to complete their evaluation of all that is wrong."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little laptop",
                "This is perfect for a traveling writer",
                "It has enough horsepower and memory to do some lightweight games, like older isometric games, or board games for when the work is done",
                "I plugged in a 256GB MicroSD to get extra storage for kindle books and docs",
                "I used a 500GB SSD external drive with around a 5 GB/s transfer rate, hooked to the USB-C to store and run some Steam games from, and it seems to work fairly well",
                "All in all, I'm extremely happy with the computer",
                "The one and only complaint is no lit keyboard, but that is easily solved with a small USB powered lamp for $9, like this one I ordered",
                "\"USB Reading Lamp, PIKADO Premium 14 LED, 3 Brightness Setting Touch-Switch Laptop Light with Flexible Gooseneck (Black)\" For what this laptop is designed to do, you will love it, with ASUS quality!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good computer but office365 is a problem",
                "I got this as a small laptop I can take and do work away from home",
                "It would be great with the free year of office365--its not really office365---you HAVE TO BE ONLINE to use it",
                "That really ruins the portability of a laptop--can't use it on planes or coffee shops or trains unless you pay for the wifi",
                "You can't even type in the excel or edit an existing word doc unless you are connected to the internet",
                "They should update the description to microsoft lite or whatever it is."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great -- WHEN it works",
                "It DIED after 35 days....",
                "Great when it works and was the ideal little laptop to take on business trips",
                "BUT....",
                "The computer DIED after 35 days and was temperamental before then (grey screen, flickering screen, apps closing unexpectedly)",
                "NOT impressed with ASUS",
                "Thankfully I have a MAC as 'backup'",
                "Going through the warranty process now....."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Pay attention to the bad reviews.",
                "I seen the bad reviews but there were more good than bad so I purchased",
                "This was in JUNE",
                "Loved it! Now we're in AUGUST and it stopped working",
                "Not even a good 3 months! A freaking refurbished laptop would've lasted longer than that",
                "Don't waste your money."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "if it doesn't turn on or wake up, try this.",
                "If yours ever stopped working or doesn't turn on though the charging light is still on, unplug everything including power charger, USB, etc",
                "Then press power button for 10 sec",
                "Then put the power charger on and turn it on",
                "It worked for me when I thought I bought a bad pc",
                "Thanks to Amazon tech support! I didn't know it is a common issue on pc."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Lightweight and small",
                "This laptop was smaller than I expected",
                "But that's my own fault for not being great at measurements",
                "The laptop is super lightweight",
                "It doesn't weight much",
                "I was planning on returning it because it wasn't what I had originally wanted but I've fallen in love with how easy it is to carry and move around since it's so compact",
                "This might be the laptop I take with me on trips when I don't want to lug around my huge laptop."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Wonderful Laptop With A Small Price Tag",
                "Replaced an older Chromebook with this laptop",
                "I am very happy with everything about this computer so far",
                "It loads up fast - has a nice feeling keyboard - all the features of Windows 10 - it is quite lightweight",
                "It holds a battery charge all day",
                "So, for right now I am so thrilled to have a laptop again",
                "I use Chrome as my browser and that was easy to load and works quite well."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Mouse pad is faulty",
                "Great laptop to use once a week",
                "Bad laptop for daily use.",
                "Computer was great at first",
                "Mouse pad started to just not work after a month and a half",
                "Ive tried adjusting all touchpad options and sensitivity",
                "Now the arrow just randomly stops and if you lightly smack the touch pad (which eventually gets tiring) the mouse starts working great again",
                "Wont buy this computer again."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "10 hour battery life with linux",
                "I wanted a slightly smaller sized and much better battery life laptop to code on in my free time",
                "I was looking at macbook airs but at 4x the cost",
                "The cons: the trackpad is not the best, but not the worst",
                "Definitely workable, but a huge downgrade from a mac",
                "Better than some lenovos",
                "the screen resolution is fine but the screen feels a bit...",
                "odd",
                "i can't put my finger on it",
                "the video card isn't a beast, nor do I need one, but it feels like the refresh rate was obviously low",
                "2 gigs of ram is enough for what I need, but barely",
                "Getting a windows license was a headache, it didn't come with one and the support was bad",
                "the pros: actual 10 hour battery life",
                "I'm using this for web browsing, coding and small tasks",
                "it handles them perfectly and I get an actual 10 hours of screen on time with this laptop using linux",
                "perfect size and weight to go: Its easy to throw into a backpack or just carry out",
                "usb c and 2 full usb ports",
                "Thats really all there is to it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop worth the money",
                "This is a great little laptop",
                "Don't expect to be playing games on this though it is designed for remote working and light video watching",
                "Speaking of video watching it looks absolutely fabulous if you're standing right in front of it",
                "If you are off to the side you really can't see it",
                "I upgraded Windows s to Windows home, then I booted to USB and did a clean install of Windows 10 home",
                "This took off all the stuff that I don't like about buying a assembly line product, so after that it was great!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Light and Portable",
                "I bought this so I would have a small computer to take with me to write and surf elsewhere",
                "I work in my office all day and didn't want to stay in there after work on the desktop",
                "I didn't need anything fancy",
                "Just a reliable laptop for word processing and occasional surfing",
                "It's perfect for those needs."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Ok",
                "The quality is fair for an inexpensive laptop",
                "However the issue that I am having is when the laptop restarts or is put in sleep mode, the screen goes completely black and the power light stays on",
                "In order to get it working again you have to forcefully shut it down"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "No refund for a defective laptop",
                "Despite an obvious defect in the laptop that was delivered to me and discovered immediately, the customer service did not respond properly",
                "They tried to refer to some unrelated issues instead of simply providing a refund",
                "Even though they got the returned laptop no refund is issued so far."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "No Back Lit Keyboard",
                "This was a MAJOR selling feature for me since I work nights",
                "Description needs updated."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Screen gets a “C”; price gets an “A+” - BUY IT!",
                "Buy it for the price and size",
                "The screen leaves a little to be desired",
                "This is a companion PC, there when you need a Windows laptop to get away from your desktop or larger/heavier primary laptop",
                "I considered a Chromebook, but decided it was not what I was looking for since I also have an iPad &amp; iPhone",
                "I bought this to run along-side my gaming/DAW desktop, and it’s fantastic as a “2nd screen” that has little real estate and can be placed just about anywhere",
                "Love the 11” size!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "meets my needs",
                "I have had no problems with this computer and have been particularly happy with the battery life",
                "I have only owned it for a few weeks but so far it has performed very well",
                "I have used it primarily for web surfing and occasional Netflix viewing with few complaints",
                "Downloading seems a bit slow but that may also be due to my internet provider",
                "I am happy with my purchase."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "A good simple little laptop",
                "Bought this for my boyfriend as a gift a few months ago",
                "It was a nightmare to watch him use his original laptop (considering I work in tech)",
                "The RAM could hardly handle Chrome and Microsoft word for more than five seconds",
                "He’s a simple guy so he was in the market for a simple laptop",
                "He uses it for school and that’s about it",
                "I have heard nothing but good things from him about it",
                "I’ve used it a bit myself and it’s a fine computer if you’re looking to do simple work on it",
                "It still does not operate at the ideal speed I would prefer",
                "However, like I said, it is a simple laptop for those doing simple work."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great for on the go person, must have for a starter kit.",
                "Great size and does not take up much space",
                "Batterie life last about 12 hours depending on what I am doing and how many thing I am doing at once",
                "Use it for accessing the work programs when I am not in the office",
                "Great for a starter computer and to see if it will be worth spending the money to upgrade to a bigger screen, hardware, hard drive, CPU, and other functions",
                "I will be upgreading to a better Laptop that will be with me and this on will stay at my 2nd jobs desk",
                "This way I will always be prepared"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Someone in my household purchased this and the feedback she gave is...",
                "She really likes it, it came with Microsoft 365 on it &amp; it works perfectly, she uses it to surf the internet, store files and so much more! Her needs were meet after purchasing this and she is getting the things she needed to get done online with this stream book! She Highly recommends this stream book especially if your on a budget",
                "👍🏻👍🏻"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Thank you ASUS",
                "Thank you Asus for creating an affordable computer",
                "This computer is far from perfect",
                "The touch mouse can get spotty after several minutes of use",
                "The camera quality is borderline acceptable for online exam proctoring",
                "However, this laptop is unbeatable with priced performance",
                "It works well enough for timed online education proctoring or casual use of web surfing",
                "My last minute decision to buy this laptop was a happy purchase to this day."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Powerfully small laptop!",
                "Amazing deal for this little powerful guy",
                "I do YouTube videos and edit a lot so I needed something with good power, and this is one of the smallest if not the smallest laptop I’ve ever had and it’s great",
                "I love it."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "NOT TOUCH SCREEN",
                "Not a touch screen, cannot use Chrome",
                "I can't review anything else because I'm too disappointed I was misled",
                "EDIT I never initiated a return, yet there is a return status on my account",
                "I don't know if this is Amazon being wonky or if the seller is",
                "I AM considering a return, as the laptop has all these apps for touch screen (including on screen keyboard) but no touch screen functionality."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice device",
                "Very nice for the price! The power of a PC in a small and lightweight package",
                "After a couple of weeks, I have not found anything I can't do with it",
                "Battery only lasts 3 to 4 hours, which is a minor inconvenience",
                "But the power supply is not heavy to just take with",
                "All in all, it's working well and my tablets are just collecting dust now."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Issues after a few months.",
                "I initially liked everything about this computer",
                "Unfortunately, just a few months in and I am having problems",
                "First, the security icon in my task bar indicated a \"quick scan\" was due",
                "When I clicked the button to scan, nothing happened after several minutes of the little blue dots going across the screen indicating the computer was working",
                "This happened after several attempts to scan the computer",
                "Then, I shut it down and restarted it and the security icon showed everything was up to date",
                "Thought my problem was resolved, that is until a few minutes passed and I was back to showing a scan was needed",
                "No help from Windows tech support worked to resolve this issue",
                "The next day after using the computer for a few hours all of a sudden I could not enter my password after the computer went into sleep mode",
                "This computer is now worthless to me! Very disappointed and going to spend the extra money to buy a Mac!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Small, light &amp; very portable.",
                "So far it’s exactly what I was looking for",
                "Small, light, and extremely portable",
                "Even the power cord is small",
                "No crazy power brick on this one! I have other computers to use for heavy lifting stuff so I got this primarily to check emails and for writing on the go",
                "Speed seems great for what I want to use it for, and setup was a breeze",
                "My plan is to not clutter it up with other apps and use it strictly for writing and email",
                "So far I’m psyched about the purchase",
                "Will update review in a few weeks."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice laptop for online schoolwork",
                "The product arrived on time and as described",
                "This was a replacement laptop for my pre-teen and it works pretty well for her to do her schoolwork online",
                "She also uses it to play Roblox and has no lagging issues",
                "I intend to get a 128 GB mini sim card to boost storage but this little machine is compact and can easily be taken with her anywhere she goes."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "JUNK!!!! Stopped working in less than 2 weeks",
                "Gave it to my daughter for her 13th birthday September 24th today October 6th it stopped working",
                "Won’t turn on won’t charge."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Waste of money",
                "It only worked for 3 days!! Then computer would not respond to clicks",
                "Now I know what brand never to buy again."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Battery NO GOOD",
                "Was working great until within the last week the battery quit charging",
                "Nothing",
                "I've checked the charging cable",
                "No issues with it",
                "Checked the battery and nothing",
                "Any options? Ordered the end of March 2020",
                "Return window closed on May 31, 2020",
                "Looks like maybe the first and last time purchasing ASUS",
                "Any options?"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Bought in September, stopped working in November",
                "Don't waste your money",
                "I got this September 2nd",
                "It was the only computer available less than $800 because of the pandemic and everyone having to work from home",
                "It was clearly cheaper quality, but we had no choice",
                "It isn't used for more than some schoolwork",
                "We use the Microsoft edge for about 1.5 hours a day maximum, Mon-Fri",
                "The battery died on November 6th, it has been charging for the last 5 days and won't turn on",
                "This is a waste of money",
                "It is too late to return on Amazon so I'll have to waste my time trying to figure out the manufacturers warranty just to get another one of these",
                "Like I don't already have enough to do",
                "This is a complete waste of money, I wish I never bought it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Used had no windows license or 365 key.",
                "Bought used in original packaging",
                "I usually have no problem with Amazon reissuing items that were returned",
                "This product arrived with a Windows 10 non-usable license and no window Microsoft 365."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Battery Stopped charging after a year of ownership",
                "I bought this laptop last year to use for Arduino projects and for browsing on the road",
                "I used it roughly every week or so for work",
                "I haven't used it much in the last month, and today it stopped charging",
                "It will run while plugged in, but the battery will not charge, and the charge light just blinks showing it cannot connect to the battery."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It’s small And enough for me",
                "This was my first laptop and I just love this",
                "My daughter set my laptop up and was able to switch it from Windows S so I can put my anti virus on my laptop",
                "The pages run quickly",
                "I read other reviews some were helpful so for now this is enough for me"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Fun while it lasted...",
                "Thought I got a good deal.",
                "But unfortunately not.",
                "Used it for one day and now it won't start up.",
                "Very small computer as well.",
                "It ran good.",
                "But I guess it has some bugs.",
                "Thanks again Will be returning today..",
                "Sept28 2019"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "What happened to ASUS ? 🤔",
                "After 6 months it stopped working as of today because doesn't come on or anything",
                "It sad because this laptop was portable to carry around and performanced efficiently with power points, Mircosoft word, emails and so on",
                "I had to take it to the tech shop to get it charged again",
                "Which works fine now."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It's lightweight",
                "That's all I can say for it.",
                "If you love chasing a wandering cursor around and if you don't mind that the cursor strays from where you left it, perhaps you'll like this",
                "I am considering throwing it out",
                "I bought it because my old laptop needed a Windows version update",
                "I so wish I'd just done that, now."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "overall",
                "small, lightweight, easy to bring around and to travel",
                "the computer overall runs smooth if you don't have too much running on it",
                "compared to other laptops this one will be on the slower side, but if you keep space clean and not too much going on the laptop then this one should last",
                "Not gaming computer",
                "More for a email, surf the net kind of laptop."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Dead Again!",
                "Although I typically make a point of writing positive reviews, this time I am not completely able to",
                "This device works for a certain amount of time, &amp; unfortunately, dies after a certain amount of time",
                "It is not even a year old, &amp; this is the second death that has occurred",
                ":( On the upside...when it is working it is great!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Black screen",
                "Do not purchase this laptop",
                "I bought it for my daughter and it stopped working after 2 months",
                "I contacted the seller and was told to contact ASUS but when I did, I was told that they would send me an email to fill out a form but after filling out the form, I did not get any confirmation or anything",
                "They made the process so difficult for you to return it",
                "I’m just going to do away with it and get my daughter another laptop(HP)"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It's What I Prefer to My Full-Sized (and generally lovely) Laptop...",
                "I am so thoroughly pleased with my purchase, I cannot likely begin to adequately cover it to make the point I optimally would about the darling thing",
                "It is powerful, small, lightweight, easy-to-use anywhere and more",
                "If you want a perfect laptop to carry with you when preferred, this is the one - and for the price? It's great even at a much higher one, so that is just ANOTHER gift!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Stopped working after six months",
                "Extremely light use",
                "Left it it untouched for about a month and now it won't turn on",
                "The light turns on when the AC adaptor is plugged in but no response from the power button",
                "Quite disappointed",
                "Avoid this product."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "not touchscreen",
                "Not touchscreen, despite what it says in the ad",
                "Returned it for this reason."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great Battery",
                "I bought this when the pandemic first started here because we were going to start working remotely and it has not disappointed! The screen is great quality, the keyboard isn't too tightly fit and my fat fingers doesn't hit random letters, the webcam is clear for Zoom calls, and the batter basically lasts forever! It was one of the best purchases I've made."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "No card reader!",
                "I have not yet been able to figure out how to view GoPro videos from the card",
                "I did try a USB attachment device that has a SD card reader but the pc doesn't seem to recognize it",
                "These are small, lightweight and inexpensive laptops that I take on motorcycle trips - it stands up well to vibration and provides basic service."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Horrible",
                "Had it for 9 days then i come home from work and it wont even turn on with or without the charger only used it for netflix and youtube , I know for a fact nobody else messed with it because it was locked away where security cameras can see 2nd I only used it 3 days out of those 9 days for no more than 3 -5 hours completley dissatisfied and disappointed"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good Computer For Light Tasks",
                "I bought this computer strictly to use as an affordable music server and to watch the occasional movie",
                "For this purpose it works nicely",
                "For more serious applications I would spend another few hundred for a computer with a faster processor and more memory",
                "Also, forget about gaming since its processor is too slow for it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice little laptop, great for some couch programming",
                "I needed a small laptop to run linux for some couch programming",
                "It seems perfect for that purpose",
                "I'm dropping one star due to it not supporting the 1920 x 1080 pixels resolution as stated on the details page."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Power Supply Went Bad in a Little Over a Week",
                "Wouldn't ship a free one..",
                "Whats the point of warranties and stuff if you have to jump through hoops to get anything?"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Battery doesn’t stay charged for a whole day!",
                "I had to return this computer because the battery couldn’t stay charged for a day",
                "I’ve owned other laptops and the battery stay charged for at least three days before charging it again",
                "OS is fine and it wasn’t a touch screen",
                "Seemed to flimsy to carry",
                "It felt like toy which could break",
                "Don’t recommend this unless it’s only at a desk and stays plugged the whole time",
                "Then what’s the point in it being a laptop."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "WIFI connection Required to use computer programs",
                "Extremely disappointing",
                "Computers MICROSOFT window software has complete control of laptop",
                "Needs to be connected to WIFI before use",
                "Then After on internet MICROSOFT windows require passwords to use each program on computer",
                "Short of it, If NO WIFI connection cannot use computer",
                "Portable only if WIFI available Still have time to return ? Problem : computer works \" turns off and on.\""
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Broke after 5 weeks",
                "Battery doesn’t hold a charge after 5 weeks of use",
                "Has to be plugged in to use",
                "I would not recommend!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "can’t download google chrome :/",
                "it is not a touch screen",
                "you can not download google chrome onto this computer",
                "if you don’t mind using internet explorer or firefox this is the computer for you",
                "other than not being able to download google i love this laptop"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great value",
                "I have to move between two locations with multiple floors and this laptop is so light and small that you can carry it around very easily",
                "I use a 128Gb micro SD card for additional memory for programs other than the OS",
                "Very quick",
                "I had to switch from S mode to used other apps."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Decent computer",
                "This is a decent computer that serves as a video loop for our Food truck",
                "It is a basic computer, that will meet the needs of a basic user",
                "I will recommend this product."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "In the blink after just 6 months! AVOID",
                "Loved this at first and then barely used for 5 months",
                "Now after using again for a week, it sometimes refuses to start, regardless of battery or charging",
                "I think the power button is faulty",
                "Do not get this for work! Cannot rely on this at all for anything now",
                "Will be contacting Asus."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Slowest laptop I've ever had",
                "I like it because it is very small and great for traveling, however the screen size is also a big minus! I have to scroll a lot to see everything",
                "It is also the slowest computer I have EVER had",
                "Buyer beware! Spend a tiny bit more and get a decent computer",
                "I have had this for only 9 months and I hate it",
                "I am ready to purchase something else."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Need a little help",
                "It says it's supposed to come with Office 365 personal",
                "I don't really know how or where the code is to install it",
                "I have had a little bit of a hard time reaching out to anyone."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "WARNING - DO NOT BUY!!!",
                "Bought laptop on November 9th for my younger sister to do her homework",
                "Only for the laptop to break down today as I write this review",
                "Did not even last for a full year!!!! The laptop just suddenly wouldn't turn on, no lights nothing",
                "Tried rebooting, holding down the power button...etc Just up and died like a goldfish got from a fair",
                "Bit of good advice, spend your hard earned money on a better laptop than this cheap, unreliable hunk of plastic",
                "This has been the worst trade deal in the history of trade deals, maybe ever."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I guess Windows 10s is bad or the computer",
                "Kept freezing the tracking, opening windows I didn't asked etc - all within one week of buying it."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "How it works",
                "The laptop I bought worked only A few times ( checked email, etc) After that turned off and ..",
                "only problem",
                "Can’t get my money back."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This computer is very nice",
                "I love this little computer",
                "Its small but packed with very useful apps and bells and whistles",
                "Its very convienent , it has some weight to it but its not too heavy",
                "My favorite option is voice to text so I dont have to do the typing",
                "As a author its great to just speak my mind and it catches it an keeps up with me",
                "It linked with my cloud from my old computer and my phone and loaded up all my data on its own."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I like it",
                "I like this notebook, very lightweight and easy to use",
                "I like the features it comes with, although I did update to windows home",
                "Only issue I have is this thing is constantly updating",
                "Not a bad thing, but I live in a rural area, using antennae based broadband, and it takes forever to update",
                "I have made one trip to the local library, and again at a car dealer while waiting for a repair to be done",
                "The wifi in those places is much faster than I get at home, but it is what it is",
                "Primary use is as a back up or for traveling, so it's OK for use in those situations."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great value for the money",
                "Overall a very competent machine",
                "Usually paid about 700 to 800 bucks for a laptop in the past",
                "This one performs just about the same as those, except that the screen quality is lower overall",
                "Aside from a slightly inferior screen no difference that I can tell between my former 750 dollar laptop and this one for 300 dollars",
                "Very usable machine for 300 bucks",
                "Good value overall."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great until its not",
                "Pros: great price for an ultra compact all day battery life laptop",
                "Keyboard feels great for the price and the screen, although a little dark, is usable and good enough for anything you'll do on the laptop",
                "Cons: After 2 months of being awesome, it wont turn on",
                "I've tried everything short of taking it apart to find the actual issue."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Do not buy",
                "This laptop has only ever worked for me once for about 2 hours",
                "It always has a blue screen saying there was an error from the first time I turned it on",
                "Was an absolute waste of money."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Portable, and that's it.",
                "It's small and portable",
                "If you're looking for a very portable computer, this works well",
                "Other than that, there's not much to get excited about",
                "The screen isn't all that good, the built in camera is extremely low resolution",
                "The memory is very limited, even for its price."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Don't Buy This For Your Kids/Siblings to Do Schoolwork",
                "I tried to give this product the benefit of the doubt when my sister couldn't access Zoom on this but its because Microsoft put MICROSOFT EDGE completely stopping the laptop from letting her access any apps",
                "Seriously what's the point of Edge if it bars the user?? Not to mention it constantly shuts itself off and NEVER charges completely",
                "She'll charge it overnight for school and will still have to charge it while in meetings",
                "On occasion it crashes, too",
                "Please don't buy this",
                "It's not worth it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Doesn't work after only 4 months",
                "Only had this computer for 4 months and no longer works!! I have contacted the seller about warranty and still havent heard back",
                "It won't power on",
                "I have taken very good care of it and bought it for college use."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very good laptop for the money",
                "It is a little slower than I expected, but I'm not a Gamer and I don't watch videos or put any heavy use on it",
                "Honestly, I pay bills, cruise the internet, check my email, do a little research",
                "It is light, charges quickly, and does everything I need it for",
                "When I'm ready to replace it I will invest in a little more speed, but for now, I'm very happy."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Love it!",
                "I love my little computer! I’m on my last semesters of school and it’s perfect, it fits all my needs",
                "I can take it with me anywhere because it’s so small",
                "At first I though such a tiny screen would bug me but I don’t want videos or movies a ton so it works great for what I need."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This laptop won't turn on after on 4 days!",
                "Wow, we purchased this laptop four days ago and this morning it won't turn on, it was working fine yesterday, nothing happened out of the ordinary, strange",
                "Buyer beware!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little computers",
                "I purchased two of these for my 7 and 9 year olds after the schools closed for COVID19, so they could remote learn, and do educational games (Khan Acadamy, Prodigy, etc.)",
                "They work great for them",
                "One of the computers had an issue with the mic not working, but I got an exchange with no problem."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop",
                "It is not touch screen Screen quality is great",
                "Small and light, very portable."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Lame",
                "Product stopped working after 3 months",
                "Woot has been a pain to deal with",
                "Do not recommend."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Scammers",
                "It doesn’t have a webcam, you don’t get free windows for a year, the laptop is actually a refurbished item",
                "Don’t waste your money",
                "Because you will"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Broken after 3 months",
                "Won't turn on",
                "Very disappointed",
                "Avoid."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not a touch screen as advertised",
                "The description states that it is a touchscreen - but it is not",
                "Has S-Mode in which you MUST use Microsoft products only, but if you exit it, you can never go back",
                "The size, weight, screen quality are all great! Keep in mind, this is a SMALL laptop."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Horrible product",
                "Worst laptop ever",
                "It will not connect to wifi",
                "I have to call the company on a daily basis",
                "I have sent the laptop to ASUS for repair when they were not able to fix it on the phone",
                "It was gone for months and still does not work",
                "Don't waste your money."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "no touchscreen",
                "Description says it is touchscreen, but it is NOT! Touchscreen was the only reason why i bought this for my kids, and if i knew it is not touchscreen I would have bought something else",
                "Other than that it seems fine",
                "Seller really should take out the description of touch screen!!!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little computer",
                "When I retired I no longer needed a full size computer",
                "I bought this little guy for ease of carry on trips, but still accommodate printing and other peripherals",
                "It was also priced right",
                "It does the trick and I would recommend it to anyone who travels and needs an easy to carry computer that provides excellent functionality."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Please DON'T BUY!!",
                "Back story: I bought the product only for school on 01SEPT2020 and it was delivered on the 04SEPT2020",
                "I started using it on the 07SEPT2020",
                "The product is light and is portable",
                "The color is very beautiful and the keys feel great",
                "It was deliveried undamaged",
                "Why such a low rating? So today on 16SEPT2020 it doesn't work anymore",
                "It was used only for school",
                "When I was done with school work I shut it down, unplug it and put it away when not in use."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        }
    ]
}