{
    "data": [
        {
            "text": [
                "Très bien",
                "Ok"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop!",
                "MacBook showed up in great condition and runs nice and fast ! I’m very happy with my purchase! Just like new!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Don’t buy! Rip off!",
                "laptop sucked, wasn’t working right as soon as I got it, stuck through it cuz I needed it then couldn’t return and now I’m stuck with a laptop that doesn’t even work"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "THE DARN COMPUTER DID NOT WORK and we shipped it back",
                "Very unhappy.",
                "Yes, they promised us a refund",
                "But what a nuisance."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Look over the product carefully.",
                "We were happy with the product",
                "However there was a part or screw tumbling inside it",
                "Affected the DVD slot."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Mint condition",
                "Love, love, love this Laptop!!! Came in mint condition and is so user friendly..."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Ottimo prodotto",
                "Ottimo prodotto"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Not working",
                "Sorry hasnt worked since i got it."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Gift",
                "Bought as a gift for my gf and it works great! Does everything it is suposed to do!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "A terrific Christmas gift",
                "Recipient was thrilled with this excellent product."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Its garbage",
                "I use this product for work and home but instead it was garbage in my home it blanks out its very slow it runs hot and battery last only 1 hour"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Best decision in a while.",
                "Pleasantly surprised that this refurbished laptop was in perfect condition",
                "Saved a bundle of cash rather than buying a new one."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good computer",
                "Good computer for the price",
                "Scratches on the “S” key but other than that it works well",
                "It gets warm quickly after running."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Amazing Product!!",
                "I use this product for my photography business and I absolutely love it and would defiantly recommend it!!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Thank you",
                "I needed to get a return as it was not to my standards and they went above and beyond the call of duty!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Rapidité de livraison, produit parfaitement reconditionné et opérationnel",
                "&nbsp;Parfaitement satisfaite de cet achat",
                "MacBook pro en QWERTY totalement formaté, reconditionné en parfait état de marche",
                "Prévoir un adaptateur prise UK",
                "Réception du colis moins d'une semaine après commande, colis neutre et device dans un pack à bulles",
                "Produit Garanti une année donc vous êtes tranquilles Je recommande IT Trade +++"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great deal for a Mac",
                "Delivered promptly",
                "It is is really great shape."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very slow",
                "Extremely slow not worth the buy..."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great product",
                "Exactly as discribed",
                "Fast shipping."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "the dimension and thickness of device",
                "i like the device it is looks like new",
                "i don't like the devices thickness",
                "it is too thick"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good value for the money.",
                "I am using this as a home computer and I am pleased with its performance"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Trash",
                "It arrived and it didn’t even work at all, I returned it and have not gotten my money back"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Magnífica compra",
                "Muy contento",
                "Él portátil funciona a la perfección y está en muy buenas condiciones"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good service",
                "Love the service and the product",
                "Excellent",
                "Thank you very much."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Easy to use mac book",
                "Easy to use and add programs needed for work/ school."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Super",
                "Très bonne qualité"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Looks like old",
                "The laptop looks like used one why ?????"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "I need a good plug please",
                "I don’t have the good plug"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Happy with my purchase",
                "Good"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Bon qualité",
                "Très satisfaite"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Damn good mac",
                "Arrived a day early - happy days",
                "In mint condition, not a scratch - happy days",
                "Works just like a MAC should",
                "Well worth it if you want a damn good computer at a bargain price if you don’t mind the model being slightly older."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Excellent condition",
                "Included uk power adaptor",
                "Very good machine."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Fantastic",
                "Works and acts like new",
                "Really happy with it",
                "10/10."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Sign in ability",
                "Worked right out of the box and allowed me to personalize it."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "The item arrived in good condition and in good time",
                "The product arrived as advertised and came sooner that expected."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Lightweight",
                "I need a laptop for my 13-year-old child to conduct online courses at home",
                "It has everything needed for a basic school",
                "The built-in cam is very suitable for Zoom chat",
                "To complete her online school assignments",
                "Excellent screen quality, webcam quality and online lecture sound quality",
                "Use Google Docs, Slideshow, Drive, etc",
                "Everything went very smoothly",
                "Pros: A very beautiful appearance",
                "The layout of the home scoreen is very simple.The setup is very easy to get started",
                "Light weight",
                "Disadvantages: average memory and speed",
                "Certainly not a gaming aptop."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent for Multitasking",
                "&nbsp;This laptop is on the cheap price to meet my budget, this is a fairly decent laptop for everyday tasks",
                "It has a very modern look",
                "The great graphics are good for gaming and office work",
                "It is very thin and light weight, good quality",
                "The keys are so comfortable to the touch",
                "Camera and speaker are very powerful, they are clear and do not lag when I have a zoom meeting with my co-workers and friends",
                "For general purpose it is great, so far........"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little laptop/tablet",
                "2 weeks in and so far so good",
                "My mother's Laptop started having problems after an update was made and we are having issues getting into the computer",
                "I decided to get this one so she can at least have access to internet to do her bills, etc",
                "It's slightly slow to start but runs great",
                "Has a microHDMI, so I bought the converter micro to regular HDMI so I could hook up to her monitor",
                "Doesn't allow to use monitor as separate screen (unless I missed something) so, for now, it just mirrors the laptop screen."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Pleasantly Surprised - Good Value",
                "I purchased this for my wife and she absolutely loves this laptop! It is lightweight and has a clear and crisp display",
                "The hinge is one piece which is great as those kinds of hinges tend to last longer (her previous HP laptop had two small hinges below the display and one of them snapped)",
                "She likes that this laptop is upgradable and operates flawlessly",
                "We followed the recommendations of others and did not connect to WiFi while initially setting up this laptop",
                "If you do, setup will take much longer as it needs to download Windows updates",
                "It’s much better to let it update when you are not planning on using it such as late in the evening",
                "It has a really nice feel to the keys and and they seems to be very good quality",
                "We never purchased this brand before, but we thought we would give it a try as it was in the price range we were looking for",
                "All I can say is this if the wife is happy, then all is good!!! Very pleased."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good value laptop for browsing/videos, I needed a replacement power cord",
                "I love the lightness and smaller size of this laptop (13,3\" screen), makes it very easy to take with on the go and just tuck into my binder",
                "I haven't had any issues with browsing, emails, or netflix/youtube watching with this yet, but as others have said, this would not be a good laptop for more serious gaming or computing",
                "Seller doesn't sell a replacement cord",
                "I bent and broke mine just a few weeks into having it and was able to purchase a replacement from another vendor",
                "(I wasn't able to find this answered in the questions or feedback yet, but the Soulbay universal AC/DC adapter multi-voltage with 8 selectable adapter plugs worked for me on size H &amp; 12V, but I'm sure there are other vendors as well that would work)",
                "I would also recommend purchasing a miniHDMI to HDMI cord if you like to hook up to your TV; it doesn't have a regular HDMI port",
                "Overall, for $300, this works great for what I need it for."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "excellent",
                "I bought this small computer for the first time",
                "During this period of use, I was very satisfied",
                "The design is very good",
                "It is light and thin",
                "The healthy disk is very easy to operate",
                "The speed is also very fast",
                "I like this computer very much",
                "It is recommended."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Thin, light and Cheap",
                "&nbsp;I need a new computer for the new semester",
                "After comparing them on Amazon, this laptop is thin, light, and very inexpensive",
                "It's hotter at times, but I think it's good for the price."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Small but powerful",
                "I'm very happy with the purchase, the package came in very quickly",
                "I purchased this computer for my father, he doesn't use many features, he uses for web browsing, youtube, and etc",
                "I helped him to set up after we received this computer, super easy to set up and everything went very smoothly",
                "I'm very impressed with how fast program runs, no problem with browsing",
                "The quality of the image is excellent, it is very clear! This is such a great deal, even though the price is cheaper than what we would normally pay for any other computers, but the overall quality and performance are the same or above than the other ones I used before that’s a lot more expensive than this one",
                "Highly recommend to anyone who wants a simple, basic features computer at a reasonable price."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very satisfied with my purchase and would definitely recommend it to anyone!",
                "Amazing budget laptop! If you’re looking for a good performance laptop for work or school or whatever it is, this laptop here is probably what you’re looking for",
                "The specs on this laptop are pretty great",
                "The 8 Gigabytes of RAM are really efficient in making this computer faster than the average cheap laptop",
                "The design is very sleek and nice, really catches your eye and in my opinion just gives you a good feeling about just owning this computer",
                "I use it for work and pleasure, it works great for my writing as well as web browsing! Very satisfied with my purchase and would definitely recommend it to anyone!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Works well except when it doesn’t.",
                "We have two of these laptops",
                "One was gifted",
                "The one we purchased must be a lemon",
                "It was bought in August and the last two weeks it keeps encountering errors and shutting off",
                "It will also randomly freeze and the screen scrambles",
                "Blue screen of death",
                "It was working very well for an elementary age child for school at home until all this started",
                "Probably would not purchase again",
                "Would not recommend to a friend."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Ultra slim laptop",
                "I was looking for a laptop to replace my behemoth",
                "My criteria were: lightweight",
                "I wanted it mostly for web browsing, word processing, and some fairly light gaming",
                "It took like like 3 days to settle on what laptop to buy but I finally figured out this one would be it",
                "This is a great laptop for personal use",
                "It is super thin and light, the screen frames are very thin, it is very stable。 while might use with heavy use so much it's good though",
                "Overall delighted with my asus I love their laptops."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very cost-effective laptop",
                "The silver-gray laptop looks very beautiful, the design is very thin, the performance is very powerful, the keyboard is very easy to use, the performance is enough for home entertainment work, the battery life is also very good, this is a very cost-effective High laptop, I like it very much"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "perfect size and working fast!",
                "This is what I expected! Very easy to setup, I can put this laptop in my backpack and still have many room left, perfect size to carry around, not heavy and very thin",
                "This laptop is working great with my brother printer",
                "The laptop runs fast as expected",
                "Great laptop for the price!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good price",
                "The price for the laptop is low",
                "Love that it has windows on it already",
                "It's lightweight",
                "The only thing I wish, that isn't the fault of the product or company, is that there were protective cases for it",
                "They have protective bags but it's nice to have a case that snaps onto the body of the laptop for protection when it's in use"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Decent laptop value for the money",
                "very decent laptop for this price.I have been using it for months with no big issue so far",
                "Of course I did not do heave jobs like gaming or computation",
                "It serves me very well for daily works like internet surfing and writing documents",
                "I also took it while I was traveling last month."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Charger died after 1 month....",
                "One month review: The laptop seems to be working well for my son",
                "He’s only using it for school so no major programs running or anything",
                "However, the charger has already died and is not giving any power to the laptop",
                "This is very disappointing",
                "If it wasn’t for the charger, I would give it 4 stars",
                "For the price, this is a good laptop."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little laptop",
                "It just arrived a few hours ago, and I haven't finished setting it up yet, but I can already see that it's going to be my favorite among my various larger screened ones that are much heavier (and cost much more)",
                "I'm very pleased with it in every way."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "EXCELLENT COMPUTER AT A GREAT VALUE!",
                "THE PRICE OF THIS COMPUTER IS A STEAL",
                "IT IS VERY FAST AND POWERFUL.PEEFECT FOR MY EVERYDAY NEEDS",
                "THIS LAPTOP IS AS POWERFUL AND SLIM AS MANY OTHERS THAT ARE HUNDREDS MORE",
                "IT IS ERY VALUE FOR THE MONEY",
                "I AM VERY IMPRESSED."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Impressive laptop!",
                "Low price and works great! I use it primarily for internet, photos, and word documents",
                "Not sure how it works for gaming, etc, but works great and fast for my purposes."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice power for a small inexpensive laptop but some issues with keyboard",
                "The mouse pad quits (lose cursor) and certain keyboard characters act funny (\"L\" suddenly repeats, certain keys hard to press)",
                "L key and mousepad ok after reboot",
                "Everything else is fine."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great value for money",
                "I am far from a computer wiz but this laptop meets all my needs",
                "Its userfriendly, lightweight and its a great price",
                "Highly recommend for basic computer needs."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Jump for joy for Jumper",
                "I don’t have much money to spend on a laptop so value for the money counts lots",
                "Much faster than my last one",
                "The set up is easy &amp; the color resolution is just fine."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "My son loves it",
                "&nbsp;I purchased this laptop for my son for school.He loves the color, which surprised me",
                "Nice and slim",
                "Not heavy at all",
                "Enough ram and storage just what he needed",
                "The speed is good and has not had any problems with it, so far so good."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It work good",
                "This computer is a gift for my dad",
                "He does not need a very advanced configuration, so this computer is very suitable for him, simple and lightweight, and the battery is also very durable",
                "He likes it very much."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "User-friendly convenience without breaking the bank!",
                "I received my brand new Jumper EZbook X3 this afternoon and set it up after charging the battery for an hour, easy peasy",
                "This lightweight laptop is a great combination of performance and affordability in one sleek, compact design",
                "I'll be re-immersed in my studies in no time!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Fast,Good quality laptop",
                "I like this laptop it is pretty decent,and good.Its battery last up a long time so I am able to use it for a whole day.It is good for work and play.Easy to control the mouse.Charges up really fast and easy to use.Really thin which is easy to put in my backpack and I can carry it anywhere I need it.Good quality.It loads up fast as soon as I open it in at least 10 seconds it loads up."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great buy for the price",
                "My daughter wanted a laptop to play roblox on and this has worked out well",
                "It was affordable and came with windows",
                "It's very lightweight and slim",
                "I love it for her."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great for school work and normal use, can only run simple games like league of legends",
                "Great for school work and normal use, can only run simple games like league of legends, so if you are wanting to play games as well this is not your computer",
                "However if it is a good reliable computer you are after then this is it."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great for Sims 4 mod/cc players!",
                "I purchased this laptop to play Sims 4 with mods and custom content",
                "I have about 10 mods and hundreds of custom content items",
                "So far, everything works just fine!! My game doesn't glitch and everything works and shows up just fine",
                "Edit: it's been a few months now, and I have about 20 or so mods and hundreds more cc, laptop is still running fine!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not Zoom-worthy",
                "Within 20 days, the letter T would only type the number 2",
                "Also, the camera was of really low quality on this laptop",
                "Video images appeared out of focus and very dark on Zoom."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not worth",
                "Within 3 months keyboard having issues.",
                "slow speed, had to restart multiple times.",
                "add couple hundred dollars and get good branded product."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Need a refund! Sending back!",
                "Does not work ! The mouse doesn’t move! It goes black when I’m looking online!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "It's a nice laptop for that price.",
                "Just got this laptop",
                "I cannot say much about it now, but from first glance it looks supre clean",
                "It can do much task, but no heavy lifting from the few moments of using it",
                "I got it for my nephew so it's not like we have some big requirements, but it should suffice for now",
                "Good price for this product."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Be careful about the specifications and screen size",
                "Screen size of the laptop I received was 15 inch however the description says 13.3",
                "I’m on the go most of the time and care a lot about the screen size and cannot keep this laptop",
                "Big disappointment."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Love it!",
                "Love this Laptop! Would buy again! Simply great!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great value!",
                "Only had for a few hours but so far excellent"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop",
                "Great laptop and a great price",
                "Light and fast",
                "I'm very impressed."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Stopped Working in One Day",
                "Without a doubt, the worse purchase I have ever made in my life",
                "I bought this laptop for my son",
                "It didn't even last 48 hours",
                "It won't power up",
                "The low price and the 8 gigs of RAM were the incentives to buy, but this experience proved the old adage, if it seems to good to be true, it probably is."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I’d buy a larger model",
                "Not as bad as I’d thought and has a few secrets to its success"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great product for the price",
                "This laptop was bought to provide class online services to my 7th grade son",
                "He loves it and uses it everyday for school on line classes and homework",
                "Very slick and well design."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great",
                "Great little laptop no complaints"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Worth the price",
                "Compact and easy to bring along to class",
                "Fast start up and has expandable memory",
                "Happy with product."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great product",
                "This computer was fast,the set up was easy",
                "My 14 years daughter did it by herself",
                "The price was beautiful",
                "Really surprised at the quality and value of this laptop computer."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "2/10",
                "The laptop would turn off by itself and then the screen completely turned black."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "No",
                "Slow and clunky, even for the most basic functions, which is all we do",
                "Not worth the money"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "good product",
                "The battery is week"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Not too bad",
                "Pretty good.",
                "A good computer here is what I can say For games: its not bad, I can run Minecraft and like Left 4 dead Battery Life: To be honest it doesnt last the long but its not bad either",
                "Dont expect it to last all day."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Mousepad issues",
                "The mousepad is not working only got it last week."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great",
                "I would recommend to anyone looking for a laptop."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "VERY DISSATISFIED",
                "I did not like that I had to order this item 2 different times because it stopped working &amp; the screen stayed black when you tried to download your stuff to the laptop",
                "No matter what you did the laptop would no longer function",
                "Returning the 2nd one today for another refund."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I love this laptop",
                "I love the fact that this laptop is so lightweight."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Slim&nbsp;and&nbsp;light&nbsp;power&nbsp;device",
                "studying&nbsp;and&nbsp;need&nbsp;a&nbsp;Windows&nbsp;devices&nbsp;&nbsp;price&nbsp;I&nbsp;believe&nbsp;there&nbsp;is&nbsp;suitable&nbsp;to&nbsp;this&nbsp;laptop."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Arrived as expected",
                "Can’t comment on functionality yet",
                "It was given as gift for the holidays, but well packaged, arrived as expected, turned on and activated well."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Brand new",
                "Light weight heres hoping it runs well"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect Laptop",
                "This product is great for the price, works extremely well and is perfect for day to day use."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "decent for price",
                "great value"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Minecraft? Yes",
                "I am going to answer my own question before buying this laptop",
                "Yes it can play Minecraft just fine",
                "It does get a bit warmer than I would like bit everything runs pretty good",
                "I am happy with this purchase."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Function is 5 star to me w/ replacement",
                "Laptop is fast and works great I had a issue with my first one I received my replacement in 1-2 days and a warranty and free gift",
                "Customer service is excellent so far I have no complaints will update after a couple of months!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good value",
                "Good value"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Died within two months.",
                "Died within two months",
                "Totally waste money."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Waste of money",
                "After two months, it suddenly stopped recognizing any wireless networks available",
                "Says no wireless adapter installed",
                "Piece of crap."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        }
    ]
}