{
    "data": [
        {
            "text": [
                "Easy set up, light weight, long battery life",
                "I got these laptops for my kids which are homeschooling",
                "The battery last ALL day which is a huge huge plus",
                "The laptop was easy to set up and is very light weight",
                "Screen has nice image, so perfect for doing work or watching videos."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great Investment",
                "I purchased this laptop for my son",
                "He loves it",
                "The screen has awesome clarity",
                "My son loves it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great",
                "Wonderful"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Worth it",
                "I don’t know why people complain about it, I’ve been using for few months for work and it’s working like magic never got any problems with it! It’s light easy to carry around and the battery life is good longer than bigger laptops",
                "Overall I would highly recommend it"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "good value",
                "good performance"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect as a back-up for work at Home",
                "Perfect",
                "But remember small screen"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little notebook",
                "Great price",
                "I use it a lot."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "A very good product",
                "The size is perfect for my granddaughter to do school work",
                "I should have purchased a touch screen",
                "However for now, it will do."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Overall ok slow processing",
                "Slow processing."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Just right for what it was needed",
                "Small lightweight and easy to use perfect"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Very simple transaction",
                "Excellent delivery time .",
                "My grandson for school."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great deal would recommend!",
                "So far very happy! Buy an external mouse the pad isn't super responsive but I don't use it much anyways it works when I need to print something off and didn't bring my mouse with me",
                "I went for the higher gig and I wouldn't have done it any other way after reading through all the reviews online",
                "I spent a great deal of time trying to find an affordable laptop that was actually a laptop and not a Chromebook as those do not run with windows10 and do not have the capabilities of a standard laptop depending on your needs after a very long time I decided on this and I am extremely happy so far that I did especially with the included windows 10 and office 360 I really don't know you can get a better deal than this just remember before buying the actual size of this laptop is very small so if you want something big this isn't your deal however its size makes it perfect for travel and lugging around!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Small, Relatively Lightweight, Gets the Job Done",
                "As Expected.",
                "Overall this is what I wanted/needed",
                "I was primarily looking for something small and lightweight that I can use to edit papers (grad student/copy editor)",
                "It isn't super fast or fancy but it works well, carries easy, and looks nice",
                "The track pad isn't super responsive but that hasn't been too much of an issue because I use a mouse, but might be annoying for others."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "ASUS L203MA-DS04 + Office + Windows",
                "ENGLISH: Be aware that the included Office is Office 365 Personal, meaning a subscription-based version, and they give you only one year free",
                "But still, it might be worth it, because the subscription includes OneDrive storage and 60 min/month of Skype to Phone calling",
                "By the way, the included Windows 10 is in S mode",
                "But this is not really a problem, because when you try to install any 3rd-party software, you will see a screen asking you if you want to switch out of S mode",
                "The switch is free",
                "FRANÇAIS : Sachez que l'Office inclus est Office 365 Personnel, c'est-à-dire une version sur abonnement, et qu'il ne vous offre qu'un an gratuit",
                "Mais ça peut quand même valoir le coup, car l'abonnement inclut du stockage OneDrive et 60 minutes/mois d'appels téléphoniques Skype",
                "Par ailleurs, le Windows 10 inclus est en mode S",
                "Mais ce n'est pas vraiment un problème, car lorsque vous essayez d'installer un logiciel tiers, vous verrez un écran vous demandant si vous voulez basculer hors du mode S",
                "Le basculement est gratuit."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Parfait pour Linux / Perfect for Linux",
                "English follows ------------------------------ Le modèle reçu est L203MA-DS04",
                "Processeur 2 cœurs max 2.6GHz avec GPU intégré 8GB, 4GB RAM, stockage 64GB eMMC, 2 ports USB3 + 1 port USB-C",
                "Clavier ANGLAIS - Les touches françaises ne sont pas indiquées, donc à considérer si vous ne connaissez pas les combinaisons de touches par coeur pour les accents ou si c'est pour offrir à un enfant",
                "Attention, les spécifications sont très minimales pour Windows 10 et la majorité des critiques négatives tiennent de cet aspect",
                "C'est toutefois un excellent appareil pour la bureautique, navigation Internet et travaux scolaires des enfants",
                "Je n'ai pas essayé Windows, j'ai immédiatement installé Linux à la place",
                "Selon ma compréhension, le système d'origine est Windows 10 S, ne permettant d'installer que des applications signées par Microsoft, avec possibilité de passer à une licence Windows 10 Home gratuitement",
                "Accès facile au BIOS avec F2 pour désactiver Secure Boot et démarrer sur clé USB",
                "J'ai démarré sur un Live USB et fait une image intégrale (dd) sur une clé USB3 en environ 1 heure",
                "J'ai essayé ElementaryOS et Xubuntu qui fonctionnaient parfaitement bien",
                "Touches FN pour luminosité, volume, etc",
                "fonctionnaient très bien",
                "Tourne les vidéos YouTube 1080P sans problème grâce au GPU intégré au processeur",
                "Diffusion sur Chromecast depuis le navigateur Chrome/Chromium",
                "Qualité du son correcte, volume assez fort au maximum",
                "Le trackpad n'est pas le meilleur mais fait le travail pour le prix et est aisément remplacé par une souris sans fils",
                "Webcam SD (non HD), qualité très moyenne mais correcte pour une utilisation occasionnelle",
                "Libreoffice et VLC tournent aussi parfaitement bien",
                "Mise en garde: Installation de Linux relativement simple depuis un Live USB si vous en avez moindrement l'expérience",
                "Toutefois soyez avisés que si vous n'avez pas les connaissances requises pour faire une copie intégrale du disque interne au préalable (ex: dd if=/dev/mmcblk0 of=/cleusb/image.dd), l'opération est irréversible",
                "Vous ne pourrez plus revenir à Windows par la suite et ce n'est pas couvert par la garantie du fabriquant",
                "Si vous avez faite vos recherches et êtes conscients des limites de ce système avant de procéder à son achat, vous devriez en être pleinement satisfait",
                "------------------------------ The model I received is L203MA-DS04",
                "2-core CPU 2.6 GHz max with 8GB integrated GPU, 4GB RAM, 64GB eMMC storage, 2 USB3 ports + 1 USB-C",
                "Keyboard is English only so keep that in mind if you needed French characters and don't know the proper key combinations by heart or you're buying for a French user",
                "Take note that the specs are really minimalistic to run Windows 10 and most negative reviews about this laptop reflect that aspect",
                "I didn't try Windows as I immediately installed Linux instead",
                "From my understanding, the base system is Windows 10 S, which only allows to run software signed by Microsoft, although you are allowed to upgrade to Windows 10 Home for free",
                "Easy access to the BIOS with F2 key to deactivate Secure Boot and boot from USB drive",
                "I booted on a live USB and made a disc image (dd) on USB3 within about an hour",
                "I tried ElementaryOS and Xubuntu, both ran exceptionally well",
                "Function keys for brightness, volume, etc",
                "were supported without any problems",
                "I played YouTube videos on 1080P without any problem thanks to the CPU's integrated GPU",
                "Using Chromecast from Chrome/Chromium was not a problem",
                "Sound quality is ok and loud enough at max setting",
                "Trackpad isn't the best of its kind but does the job for the price and is easily mitigated with a wireless mouse",
                "Webcam is standard définition (non-HD) a quality was average but still ok for the occasional use",
                "Libreoffice and VLC also ran without any issue",
                "Please take note: installing Linux from a Live USB is relatively easy if you have experienced it before",
                "However, if you don't have the knowledge to make a disc image of the entire drive beforehand (hint: dd if=/dev/mmcblk0 of=/cleusb/image.dd), removing Windows will be irreversible",
                "You won't be able to get it back and that's not the kind of situation that would be covered by the manufacturer's warranty",
                "If you have done your research properly and are aware of its limitations before buying, you should be plenty satisfied."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "My laptop ya no funciona, tengo usandola un mes y ya no carga la bateria",
                "Qué hago ahora? No puedo usar mi laptop, no carga y no enciende, la he usado apenas un mes porque cuando llegó salí de vacaciones, no la usé hasta el siguiente mes a mediados de enero, entonces ahora resulta que no la puedo devolver y menos reemplazar",
                "Así que alguien me diga que debo hacer si no funciona, a quien le reclamo, ya no debo comprar en Amazon porque no cuida a sus clientes y decirle a toda mi comunidad que no compre nada electrónico, esa es la solución porque no hay garantías, tal vez si sea la solucion, cambiarme de empresa para mis compras",
                "No compren nada electrònico porque es muy CARO PORQUE NO SIRVE"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not bad for the price.",
                "Bought this laptop mainly for school and for watching tv shows or youtube",
                "Videos may lag once in a while because the processor is not too great",
                "and 4 gigs of ram is not enough for chrome",
                "Great laptop for web browsing, writing papers and some very low end games."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very nice for the price",
                "Extremely light and portable, fits great on airplane trays, fast enough to run chrome with multiple extension (4gb model)",
                "The keyboard is nice and does not flex like the other Asus 11.6 from the previous years",
                "Love that it's using a micro SD and not a full size SD that stick out like every other laptop this size",
                "Very lous speakers but no bass at all",
                "The only downside is the screen viewing angle is quite bad and the battery is only good for 5 hours",
                "Would love to see the same laptop with IPS display and 12 hours battery for 100$ more",
                "USB C charging wouls also be great."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excelente producto básico para necesidades básicas",
                "La compré con un descuento de bonificación bancaria, y me parece que es exactamente lo que necesitaba",
                "Pude instalar la versión completa de windows (de fábrica tiene Windows 10 S, una versión que te limita muchísimo), paquetería de office, antivirus, dropbox y firefox y no es nada lenta",
                "Le puse una tarjeta SD de 64 GB clase 10 para que guardara archivos temporales y descargas de internet",
                "Incluso he podido abrir sin problemas programas de edición básica de imágenes",
                "Puedo usarla en la escuela y es super ligera",
                "Definitivamente es un producto básico, pero cumple al 100% si tus necesidades son básicas y tienes idea de cómo evitar que una computadora se haga lenta (eliminación de caché, eliminación de archivos temporales, etc.)."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I'm loving it",
                "This laptop is perfect",
                "I have a hard drive and good monitor for home use and it's so lightweight and fast I'm really enjoying it",
                "Obviously I chose the best of the options but I use my machines constantly and need then to handle and keep up and so far Asus has me impressed."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good battery deacent screen good for youngens",
                "Works just fine a little on the slow side works fine though",
                "You can run pretty much any application as long as its not performance heavy",
                "Any kids/teens looking for a cheap way to play windows games this might not be for you though it can run roblox ok counterstrike ok in the low 30 fps range i wouldent get your hopes up and on the very liwest setting on unreal tournament it can run at 28 fps",
                "Spread sheets pdfs anything work related other than cad rendering large or particularly detailed videos and most intensive tasks arent reccomended",
                "Overall its a pretty good laptop if your on the cheap and dont want a chromebook for school or just watching youtube its a great laptop i will say that the screen isnt great but its functional also the keyboard has no backlight so its a little difficult to use in the dark",
                "Battery life in practice its probably like 6 hours idk in that range",
                "If you get this laptop id reccomend going into your windows license and turning off windows 10s it lets you install applications from outside the Microsoft store anyway thanks for ready my poorly structured review",
                "Ciao"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Asus L210 is a keeper!",
                "I was in the market for a budget, tiny and good looking laptop for my every now and then computing requirements",
                "Most of my everyday computing needs are taken care of by an Acer desktop which is a beast",
                "So, I didn't need a powerful laptop",
                "All I wanted was one that is as small as possible and doesn't cost much",
                "Luckily, I found this laptop",
                "I picked the 11.6 inch one that runs on Intel 4020",
                "First impressions are extremely pleasant",
                "It looks and feels good, doesn't feel 250 dollar cheap",
                "It can easily pass off as much costlier one",
                "The design is very minimalist and very practical, also fairly sturdy",
                "The screen is decent for the price (I have realistic expectations",
                "Some reviews complain about display but I don't see the point.)and the device is fan-less which is a big plus for me",
                "Since I already have a primary computer, I am leaving this in S mode",
                "The boot times are real quick, almost close to Surface's instant on speeds",
                "In my limited use, the battery seems to hold very well",
                "It can last all day with low to medium usage is my guess",
                "My only gripe about the device is the memory",
                "I wish they had put a SSD instead of eMMC",
                "But again, this is not a complaint but wishful thinking",
                "I knew it only had eMMC memory when I bought it",
                "The model number made me believe that the keyboard is backlit but it isn't",
                "It is not a huge deal breaker for me",
                "I wasn't expecting a backlit keyboard in a CA$250 laptop",
                "There is certainly some confusion with model numbers",
                "May be another variant of this base model has backlit keyboard",
                "Amazon might have to take a look at the product page to make sure the information about the laptop is right to avoid unnecessary negative reviews",
                "One other detail they need to check is mention of touchscreen feature",
                "While writing the review, it asked me to rate the touchscreen",
                "That's weird because this isn't a touchscreen laptop",
                "Again, another reason for unnecessary negative reviews",
                "In my honest opinion, anyone buying a 250 dollar laptop shouldn't be expecting a touchscreen, FHD screen or backlit keyboard",
                "You get what you pay for",
                "All said and done, this is a very good laptop for CA$250 (including taxes)",
                "I will not pay more than that for the device",
                "At this price, this is one of the best bang for your buck device",
                "A perfect choice, if you are looking for a secondary device for light task, or for school use."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excelente calidad",
                "El equipo es ligero y compacto, bien construido y cómodo para escribir por períodos prolongados",
                "La batería permite utilizarla todo el día sin preocuparse por cargarla de nuevo y en general se trata de un equipo completamente portátil",
                "En mi experiencia es bastante capaz con distribuciones de linux y una memoria sd para ampliar el almacenamiento."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great Little Computer but Amazon Help has been totally Hopeless",
                "I've had this computer now for over week",
                "It's exactly what I need for work",
                "It's light weight, decent keyboard and screen",
                "However, it comes with Microsoft Office which requires a product key to activate it",
                "They key was not included and I've been dealing with Amazon help for over a week having multiple chats and multiple emails to get the key code",
                "Each time it appears things are resolved, I find out they aren't",
                "The level of incompetence at Amazon's help desk is incredible",
                "I've now spent hours trying to resolve this",
                "They're trying to send me to Asus and Microsoft",
                "Of course they won't have any record of this transaction",
                "Amazon has offered to send me a new computer",
                "That's an incredible waste of time and energy and there's no guarantee that a replacement would come with a key",
                "How difficult is it to send me a key? I can recommend the computer, I really like it, but suggest if you are interested in the software package that comes with it to look elsewhere."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not touchscreen.",
                "It’s not a touchscreen model, however if it’s supposed to be then the one I received wasn’t",
                "Its a great little unit for Netflix, the online shopping browsing and the minimal tasks",
                "This laptop could not handle anything big but it would do well for a kids homework computer",
                "If you are looking to run big programs or run major projects this isn’t the unit",
                "Overall, its a decent machine for the price."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "great little laptop for daily business tasks",
                "I purchased this laptop as it was just being understood that working from home was going to be for an extended period of time",
                "This laptop is light, good feedback on the keyboard, and great for simple tasks of email writing, word documents, PDFs etc",
                "Screen is OK, and can handle Netflix, twitch other streaming platforms",
                "This Camera is not much but can get you through in much lighter backgrounds",
                "The sensor does not work well in very low light situations",
                "Do not expect to look 10/10 on your Zoom/Webex meetings",
                "For the price to have a Windows 10 Laptop, it cannot be beat, with the decent build quality of ASUS."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "The Breaker of Chargers",
                "I'm writing this review on my phone because this laptop is dead",
                "The charger it came with charged it 3 times then stopped working",
                "So I bought another charger from Amazon, and it broke too",
                "Not sure what's happening here, but I'm annoyed",
                "But hey, if you like buying new chargers every time this laptop dies, then this is the laptop for you!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "very slow",
                "very slow"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Nice little laptop",
                "It’s works perfect for what I need, just normal everyday use and streaming, battery lasts long and it’s super light, it does get a little warm on the lap but not to hot, screen brightness is great can’t go wrong for the price"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Fine desktop computer/bon ordinateur de travail",
                "I buyed this computer 6 months ago to work on the bus",
                "Working mainly with music sheets (Musescore) and Word",
                "The computer is working great so far",
                "It does all a computer with these specs are supposed to do",
                "Don't expect to play videogames (if you want that, don't buy a PC with 64 GB of space disk/4 GB RAM with poor processor and graphic card) or run a lot of tasks at the same time : it's NOT a multitasking computer",
                "However, it's really lightweight, so really nice when you want to do simple tasks in the transport",
                "*** J'ai acheté cet ordinateur il y a 6 mois pour travailler dans l'autobus",
                "Je travaille principalement avec des partitions (Musescore) et Word",
                "L'ordinateur fonctionne très bien jusqu'à maintenant",
                "Il répond très bien à ce qu'on peut attendre d'un ordinateur avec ces spécifications",
                "Ne vous attendez pas à jouer à des jeux vidéos (si vous voulez jouer à ces jeux, n'achetez PAS un ordinateur comprenant 64 GB d'espace disque/4 GB de RAM et un processor et une carte graphique médiocres) ou à faire plusieurs tâches en même temps sur cet ordinateur : ce n'est pas un ordi pour faire rouler plusieurs programmes et pages web à la fois",
                "Par contre, le poids très léger de l'ordinateur le rend très facile à transporter et plaisant pour ceux et celles qui souhaitent avoir un ordinateur pour faire des tâches de base dans le transport."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Light, good battery life, value for money!",
                "I use this as an extra laptop for work",
                "Battery life has been pretty good, able to last a full work day on just surfing, using Office programs and some video clips",
                "Although it's not as slim as depicted in pictures, it is fairly light and resistant to scratches",
                "I'm loving it so far and no regrets on this purchase",
                "Should have gotten this instead of a MacBook when I was studying, serves its purpose and costs 10x less",
                "If there is one thing I would change, it would be the font on the keyboard.."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Una excelente netbook de entrada",
                "La computadora inicia muy rápido, su hardware la hace perfecta para tareas de ofimática y algunas aplicaciones ligeras, excelente para reproducir vídeos, el puerto HDMI tamaño normal se agradece",
                "La recomiendo ampliamente",
                "Viene activada en modo S-Mode, pero este se puede desactivar de una forma muy sencilla para poder instalar cualquier tipo de software."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Defective",
                "Took a long time to arrive (I understood during peak covid times in May/June) Worked good for the first few months, all of a sudden it won't turn on even when charging",
                "It's was not dropped or damaged in anyway so makes no sense as to why it suddenly just won't turn on",
                "Called the support number rang for 5 min no one picked up, online support is garbage",
                "Super unhappy and extremely inconvenient to go without especially during these times."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good for schoolwork",
                "This is a great computer for schoolwork",
                "It is lightweight and portable",
                "The downside is that the the it does lag from time to time, including the cursor",
                "Furthermore, it cannot handle heavy work and many files",
                "However, it works well to for school work since it is easy to carry around",
                "I recommend using it for writing essays, making presentations, and internet browsing."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great for the price!",
                "Using this for my business' Quickbooks Premier",
                "Working great and very happy with the product",
                "Would have like side number keyboard, but no big deal",
                "Liked the smaller compact size."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Buena para ofimática",
                "Me gustó el tamaño y el peso de la laptop, la verdad no esperaba mucho, sólo que se pudiera usar para lo básico de office, para otras cosas iría muy lenta y el único detalle es que para prenderla tienes que apretar fuerte el botón por aproximadamente un segundo."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent quality",
                "Love it",
                "Screen is a bit small for a laptop but otherwise perfect for home use",
                "I'm retired so don't know about business applications."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I love it, but no touch screen",
                "I love this laptop, I had to send it in for repairs due to a keyboard issue but besides that it's amazing",
                "I have been unable to get touch screen to work though and actually seems not to have touch screen",
                "UPDATE: 3 months down the line, it actually starts slowing down"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Decent machine.",
                "Is not bad for what it is",
                "I ama little annoyed with being forced to use the microsoft edge browser",
                "Will not let me install chrome",
                "Runs kind of slow but for the price it's not that bad."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great Laptop for light use",
                "Would like to have been able to add another stick of RAM but it is not possible",
                "Will have to add external capacity",
                "Otherwise I just love it"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Go ahead and waste your time",
                "Real review: I will keep it simple",
                "Service was bad and my product was defective",
                "Will never buy from this provider anymore."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little laptop!!",
                "Great little laptop",
                "Arrived 4 days later then the guaranteed delivery date",
                "But the wait is worth it."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Ligera, cómputo básico, ágil con Linux.",
                "Me gusto pero salió defectuosa la pantalla y tuve que regresarla",
                "El desempeño es bueno para el procesador que incluye",
                "Muy buena computadora para Linux",
                "Conseguiré esa computadora de nuevo."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Slim",
                "I like the size of it, the screen quality and the speed!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "It is a basic laptop computer but good value for the price!",
                "A great little computer for someone who isn’t big on technology or touchscreen! Works well for what he needed",
                "Good value for the price!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Pretty good so far",
                "It looks more expensive than a $300 laptop for sure",
                "And so far the paltry celeron has been holding up with my excessive tabbing in chrome",
                "Only downside is the terrible keyboard with little to no key travel"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "small size perfect for school",
                "for my daughter",
                "Perfect for school."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Pour le prix très bon produit et rapide",
                "Bon portable et de bonne qualité"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Excelente calidad-precio",
                "Buen producto con buena calidad, cumple con lo necesario y es rápida incluso usando Windows."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Falsely advertised",
                "DOES NOT COME WITH OFFICE 365",
                "Nor is it touch screen",
                "Other than false advertising, it's a nice tiny laptop",
                "Good for a student."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "shipping",
                "very happy"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Parfait",
                "Parfait"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Graphics",
                "Que quand c’est tellement chaud et quand tu joue un jeux tu lag"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Love this laptop",
                "I bought this to stream movies online and it does the job so I am happy with it",
                "It's light and compact perfect size for me."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Bon petit laptop mais ecran terrible",
                "C'est pas pire pour le prix, la batterie dure vraiment longtemps mais j'aime vraiment pas l'ecran, les couleurs sont fades, l'ecran a l'air tres cheap."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "My son's loves it.",
                "We haven't use for touch screen, mostly on the key board which is perfect and fast."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "GOOD PRICE",
                "GREAT little laptop for the price needed an extra computer for the wife's crafts its well worth it 🙂"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Nunca llego",
                "Nunca me llego el producto, no se porque me piden que lo califique"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "a cessé de fonctionner après 3 mois",
                "Je ne recommande pas."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Grear",
                "Perfect"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Buen producto.",
                "Justo una portátil con lo necesario."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Just perfect for a former programmer at retirement.",
                "Excellent product."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Muy buen equipo por el precio",
                "Me gusto por lo práctica y el precio"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good value",
                "Good for the kids and schoolwork."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Slow &amp; Issues less than one month in",
                "Extremely slow and the sound no longer works."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Worth the purchase",
                "Worth it"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "64GB non pas 32GB",
                "C'est 64 GB et non pas 32 GB comme dans la description alors tant mieux! Très bon produit par rapport à son prix!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Nice!",
                "For the price it’s a super good computer! Lags a little but i am satisfied! Good deal."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Love it!",
                "Good price and good laptop"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "It is much too small",
                "It's not a laptop I would like to return it",
                "It's very small and not what I was looking for",
                "I'd like to return it."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "👍🏾",
                "My son needed something for online courses",
                "The price was right and it does the job."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excelente compra",
                "Super bien 👍"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Avoid buying this laptop",
                "Not worth the value at all"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Lap desechable",
                "7 meses duro la lap, ya no prende!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Highly recommended purchase",
                "It’s very handy and wise buy for this item.."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "That happy",
                "Have used it alot happy so far"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Rien",
                "Je l’aime bien pas plus"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "You won’t think it is refurbished, looks like you brought it home from the Apple store",
                "Ease of setup is amazing.",
                "Looks brand new, wrapped and sealed in Apple packaging",
                "Plugged it in and turned it on and let it go",
                "Absolutely no problems, it was automatic and wonderful to have the computer set itself up",
                "Has performed flawlessly as expected of an Apple laptop."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Machine possibly opened, cheap aftermarket charger",
                "The laptop arrived in fair condition",
                "The screws show signs of wear so it may have been opened up during the \"renewal\" process",
                "Old stickers were left on the bottom",
                "Also, the laptop was shipped with a cheap knockoff Chinese charger",
                "I have no reason to trust this charger so I'll have to order a genuine Apple one instead",
                "Fortunately I don't need this machine to be a workhorse or I would send it back",
                "This should survive a year at least but I don't trust it as-is - I will wipe the hard disk, NVRAM, and SMC just to be safe."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very disappointed with Mac purchase",
                "I'm very dissatisfied with this purchase",
                "I can't use the Mac because the hard drive was not reset and the software on the Mac dose not allow you to use it",
                "Also there was no charger",
                "Again very disappointed."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "refurbished products are often faulty.",
                "Product was faulty",
                "The charging port wouldn't hold the plug",
                "I returned it",
                "I don't think the refurbishing process is very competent."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great product!",
                "Idk what I was thinking not having an apple in the first place",
                "This laptop is very easy to use, fast, and I’m excited to see how productive I can be with this format",
                "I feel free, nothing holding me back now!! Unlike old pc with unresponsive interface, slow speeds, and constant crashes, this one gives me no problems!!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great deal",
                "This laptop was literally like brand new out of the box",
                "So far my daughter is so thrilled with her graduation gift",
                "She is ready for college now!!!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great so far, I've had it for 3 months",
                "This is exactly like the MacBook I was given for work that was stolen on a plane flight",
                "No problems with this as a replacement so far, smooth sailing for 3 months already! I got the protection plan just in case, but I'm very satisfied with this cheaper than new replacement",
                "Will update if there are any issues that arise",
                "Would recommend."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Our first ever Mac but so far its been quite impressive.",
                "Our first ever Mac but so far its been quite impressive",
                "It was easy to setup and get it going",
                "It works well and very easy to use, turn on/off, carry around and day to day life",
                "Wish the battery would last a bit longer."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Operating System is not Most Recent",
                "I bought this for my daughter for school",
                "The description states that this is the most recent version, which would lead me to believe the OS is the most recent, and it is not",
                "She needed version 13, and in order to get that she needed to do two updates while at school",
                "Before we realized this, she lost all of her work that she'd done up to this point because the OS was not compatible with Google Chrome (version 13 is), the computer froze, and she lost her work",
                "She's an hour and a half away, so I had to troubleshoot a computer I was not familiar with from a distance",
                "Hopefully it will work for her after doing these updates-it will be updating overnight so she won't even know if she can use it for her online class in the morning",
                "I exchanged computers with her so she has no back up",
                "So hopefully she is able to go to online class in the morning and IT can recover her lost work",
                "Also-there were cheese puff crumbs on the keyboard, so I had to clean it with electronic wipes and electronics canned air before giving it to her",
                "Very disappointing."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "LOVE MY MAC AIR",
                "i was a little leary",
                "i had purchased 2 other macs that were refurbished and thy were both defective",
                "i was so hppy that it tunrned on and didnt die within a week",
                "this is a great computer and has never ffailed me",
                "i love the mac book airs but there a bit pricey this was perfect",
                "IT EVEN CAME IN THE MAC BOOK AIR BOX!!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Like new in box",
                "This looks and feels brand new, came in original box with wrapped cords and instruction booklet",
                "Love it."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Waste of money and my life ready to sue",
                "Sold me a broken computer Keyboard don’t work Mouse don’t work Can’t download things Reach out to seller no answer do not buy from them scam"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Pretty good laptop",
                "I bought this computer for my daughter to do her school assignments",
                "Honestly, I was a little apprehensive at first, specially because it’s a refurbished product, but so far it works pretty well",
                "Battery life is good",
                "I bought it on Sept, 28th and waited for a while to write a review just in case something goes wrong",
                "So far, the laptop works great",
                "It works and look like brand new besides a small dent ( please see second picture)",
                "It came in a plain box and generic charger",
                "I’d give a 5 star if it was a newer version",
                "I’ll update if something changes."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice computer- low end charger subbed in.",
                "&nbsp;Package came in a neatly packaged box but the charger is an OEM charger which stopped working 3 weeks into use",
                "(Loose coonection in the base and 2 prong plug-sparks when used) I have tried to contact seller through Amazon but no response and can't send the whole thing back as I need it for work",
                "Bought a spare charger to replace the defective one",
                "Can buy same item at Best Buy and NOT have the warranty - return issues",
                "Won't buy from this seller again."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Affordable Solid Purchase I am happy",
                "I purchased an Apple 13in MacBook Air, 1.8GHz Intel Core i5 Dual Core Processor, 8GB RAM, 128GB SSD, Mac OS, Silver, MQD32LL/A (Newest Version) (Renewed) mine was a 2017",
                "It arrived 4 days early during the pandemic which I was super happy with",
                "Computer was in great condition, a couple of the keys on keyboard stick slightly",
                "The computer did not come in original box and a generic charger was given., but for the price I paid I am okay with that",
                "The computer was super easy to update and is running Catalina now which I am super happy with."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Worse battery life than may 2103 MacBook Pro",
                "First time using this the battery lasted about 3 hours",
                "Returned it the same day",
                "Disappointed in the refurbishment quality not the product itself."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Better than expected!",
                "I just knew there would be dents or scratches since it is used, but there are literally no scratches or dents",
                "It looks new! I love the battery life",
                "The battery lasts so much longer than my old MacBook Pro."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Wouldn’t even turn on",
                "I opened the computer out of the box and after making sure it was charged it wouldn’t even turn on",
                "Incredibly disappointed",
                "I’m not sure how they could ship a computer that won’t even make it past day one of turning on."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "So far perfect for my needs",
                "Looks like new, works perfectly, no battery issues",
                "I've had it for about 6 weeks now and so far so good."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Didn’t work",
                "Didn’t work, had to send back."
            ],
            "opinions": [
                [],
                []
            ]
        }
    ]
}