{
    "data": [
        {
            "text": [
                "Would buy it if it were android.",
                "Thought this unit was android like most others",
                "Windows 10",
                "Other than that it appears to be great unit for the price",
                "Great color also."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good deal",
                "The computer is fine..it took awhile to be delivered though"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Really Like This Laptop",
                "I love this laptop",
                "It's super durable and easy to work with",
                "Once the laptop came it was super easy to set up and do some work on",
                "It came fully charged, and the battery life is great",
                "I'm in love with the color",
                "The computer is pretty efficient which is super helpful when I have work to get done",
                "The computer does come in S mode, as they all do, but it's super easy to switch so you can download apps outside of the app store",
                "Would definitely recommend to anyone looking for a durable computer for a low price."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Purchased for 1st grader",
                "My son is in 1st grade and needed a computer for homeschooling due to COVID19 school closure",
                "He absolutely loves it."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Beware of this seller",
                "Computer functions fine but speakers are defective with a squealing noise right out of the box",
                "Seller super uncooperative about return for exchange",
                "Several emails trying to negotiate a replacement for a non defective product with no success Told me all laptops have poor sound and I would need to use headphones."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Like a friendless bully",
                "Microsoft is like the friendless bully who thinks they can shove someone in a locked room and make them be their friend",
                "The HP Stream comes with a setting that prevents the user from downloading apps from any source other than the Microsoft store even though they have nothing useful there except the the Microsoft Office Suite apps",
                "If you want anything from Google Play, you'll have to disable the \"S\" mode on the HP Stream and you can't go back once you do it",
                "Microsoft warns you of all the bad things that will happen if you do, but the devices was not useful to me otherwise",
                "In addition, they bundle a lot of bloatware in and make it very difficult for you to uninstall it",
                "I found a way to get rid of much of it, but I am still getting low storage warning despite the low number of apps I have and the fact I store all my files in the cloud",
                "If the price on Chromebooks is reasonable now, go with it; otherwise, this is a cheap option that essentially does the job...just with a bit of frustration."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "GREAT",
                "GREAT!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good laptop!!",
                "So I got this laptop initially to write minutes (I’m the secretary for an organization) and since COVID hit I’ve been using it to work from home (I work for a school)",
                "It’s working great for everything I need it for",
                "The battery lasts the entire school day and I’m constantly on a video call!! That said it doesn’t have a lot of internal space, but I didn’t need much since I save everything on my flash drive and on my Google Drive",
                "I did switch it out of S Mode because I needed Google Chrome for work",
                "It was really simple to do, and it’s been running smoothly since."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very low desk space, not useful",
                "I bought this as a budget laptop for the school year",
                "I didn't care about processor speed or memory as it was to be used mainly by an elementary school child for school work and classes",
                "Unfortunately once I downloaded microsoft teams on it which is the district software for online learning, it consumed almost all desk space",
                "I have to cleanup storage every single day multiple times",
                "I had to delete most of the pre installed apps just to gain one GB of free space so MS teams won't keep on crashing and my child missed his classes",
                "I'm glad I borrowed a district device for my son to use that this one is a total disappointment",
                "Please be aware of this incredibly low desk space."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Cute but not worth it",
                "Purchased this a few months back due to the good reviews",
                "The color is lovely and it’s very lightweight but this laptop ran painstakingly slow from the moment I First booted it up",
                "I’ve had multiple issues that have taken a lot of googling and troubleshooting to resolve",
                "I’m a very computer literate person and work with a different model HP laptop for work every day with no issues but this is so frustrating to use that it stays in a case in a drawer untouched most of the time",
                "I broke it out again last night hoping to play a game on it and out of nowhere the internal speakers have stopped working so I can only use it with headphones",
                "I deeply regret wasting my money on this thing",
                "Save up and get a better laptop"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "So far, So Good!",
                "Just received my laptop today(I am actually typing from it now lol)",
                "I was hesitant at first because it did not have any reviews",
                "It arrived a day early, easy set-up, Excellent condition",
                "So far, so Good! I am glad I made the purchase",
                "Thank You!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This is an awesome laptop for a child!",
                "My daughter needed a laptop for e-learning this school-year",
                "Last spring, she used my old HP Stream, which was a bit clunky both in weight and in ease of use",
                "We found this newer model in a shiny pink, which thrilled her",
                "The keyboard is big",
                "The screen is big",
                "We could load her school apps onto it, and she can carry it around when she needs to move from room to room",
                "This was a great buy",
                "I can't believe that, for the money, we got a touch screen! Score! Overall, we're very pleased with this laptop",
                "I feel fortunate I found it before school started, and it shipped so quickly",
                "Thumbs up from everyone in my house!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Its a basic unit, pretty slow but works",
                "Arrived and was fairly easy to set up",
                "Lot of crud you dont need on it taking up space",
                "Has window S mode security, not real fund of it myself",
                "I dont understand why they can just put the charge plug on the back of the computers like they used to",
                "It never fails that they are on the wrong side",
                "This unit has it on the RH side on laptop, not where I needed it",
                "Time will tell."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Satisfied",
                "It was shipped in one-day",
                "The product design is sleek and chic",
                "Very light weight",
                "It takes a lot to set up the desktop",
                "I assume its for privacy settings",
                "Overall positively satisfied."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "WAS IN NEED OF A LAPTOP",
                "We got an HP last year in gray but since I have a brother, I had to resort to using my Windows 7 Dell and it's slow and just very old",
                "I'm a broadcasting student and I had a semester project in which I have to shoot and edit a commercial so I needed a laptop in which I don't have to worry about having it plugged in while using it",
                "Have had no problems using it works just as fine as the other HP we have",
                "I prefer using chrome so of course there's no way around S mode, you have to disable it but I'm fine with that",
                "I can go about 4 days without charging since the battery is really good and I've shut it down a few times but mostly have put it to sleep as I've been working on my project since finals are soon."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "No Network Connection - Removing Battery",
                "My network connection kept turning off randomly",
                "It wasn’t through my internet service but issues with the laptop itself",
                "I had to remove the whole back of the laptop, remove the battery hold down the power button for a few seconds then place the battery back in to get it to start working again",
                "FYI, I did this 4 times already and haven’t even had this laptop for 2 whole months yet",
                "I’m looking into the issue a little more before buying a new battery (if that’s the main cause of this)",
                "I am extremely disappointed and overwhelmed with this constant issue! Pro: Beautiful rose gold"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great computer",
                "I Bbught this laptop for my son so he could complete his homework due to the pandemic and its perfect and the color is exactly as in the picture",
                "I recommend this buy if you need a computer."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Moving slowww and I've only downloaded Chrome",
                "This laptop has a nice sleek design, not too big or small, was easy to fit in my school backpack",
                "Bought it to use for school, had an exam, it took 20 mins for this thing to load/not download the website I needed for a TIMED exam",
                "Beyond pissed, but loads as slow as a turtle just trying to load any page in Microsoft Edge or Chrome",
                "Oh yeah, you have to get everything through the Microsoft store or switch over to some other type of Microsoft, I forgot to use Chrome",
                "Chrome eats up all the RAM on this PC.Can't wait to return this thing."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good for the price",
                "We already enjoying the laptop,very easy to use,this is for my daughter online school,is so practical and easy to work with!a plus on the color she loves her pink! I highly recommended this laptop.."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Do Not Buy This",
                "The computer has only 32 GB of storage",
                "The Windows 10 operating system takes up all of the storage space",
                "There is not enough storage for updates",
                "It would not update to Win 10 #1909",
                "You cannot install other programs such as Norton, Word, Adobe, etc",
                "It is not possible to upgrade or expand the memory",
                "Using an external drive is not possible",
                "Many others have said that this was a design error by HP",
                "Many work-arounds have been suggested by HP and others, but they all failed",
                "For example, when downloading updates HP says you can select \"FIX THIS\" and chose an external drive",
                "This does not work",
                "I could not change it to 32 bit from 64 bit",
                "I am very disappointed in HP."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Don’t Do it",
                "This product seemed good at first, but now I'm having nothing but issues with the computer",
                "Mouse pad having issues, poor speed and performance for normal items",
                "The laptop won't even turn on",
                "I have small business &amp; need it for mostly shipping",
                "Definitely not a good product",
                "I Would not buy again",
                "I am extremely disappointed and overwhelmed with this constant issue! Never again"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "After googling and monkeying with sound and audio, it’s great for zooming",
                "Very light weight",
                "Keyboard responsive, keys are big and typing is surprisingly easy",
                "14” monitor is a good size",
                "I bought this just for zoom meetings",
                "I wanted to keep it in S-mode and log into zoom from the website, but the video and audio were very poor, sound and video often lagged and weren’t synced",
                "I had to take it out of S-mode and also do some googling on sound and video quality in order to get it where I wanted it",
                "After googling and monkeying with the settings, I now can say I’m pleased with this laptop",
                "It’s doing what I bought it for! I’m zooming successfully now!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Computer was crap and then I got hit with restocking fee for crap computer",
                "Ordered for Christmas, got in timely manner",
                "My daughter didn’t get to open till January 3rd",
                "After opening and charging computer couldn’t do simple things without over heating and slowing way down",
                "So bad that mouse pad was glitching",
                "Price vs ability is very poor a 5yo chrome book out preformed this computer",
                "I know different operating systems",
                "$150 5yo chrome book vs $320 3mo HP and chrome book is winner",
                "Also I don’t recall the unit having touch screen",
                "If it did it didn’t work",
                "I returned it after my daughter had it for 4 hrs of use",
                "Then get hit with a restock fee",
                "So watch out they gonna send out again ."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "For the price, it's great",
                "For the price, I think it's a very good laptop",
                "I had to disable S-mode, but it still works very well",
                "I purchased mine because I needed one for college and it's been really good for doing schoolwork, watching videos, and it can play smaller games without lagging."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Disappointed",
                "I am absolutely disappointed in my purchase and I regret it",
                "It took forever for me to receive it, I am so unhappy",
                "It’s unfortunate that people don’t make it right when they disappoint their customers",
                "My computer touch screen is non existent and does not work",
                "The battery life is less then two hours",
                "I have used it twice and it is already freezing and being slow",
                "I wish that I was a happy customer but I am the exact opposite."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Love this little gem",
                "After gifting my older (Much heavier) 17 inch HP laptop, I am loving this little gem",
                "Does exactly what I need and is so light and versatile",
                "My neighbor ordered one of these after seeing mine",
                "Works great on my kitchen breakfast bar for streaming (which makes working in the kitchen more fun)."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good buy w/little upgrade needed",
                "Got the laptop w/the N4020 processor vs the N4000 version",
                "The slight difference in speed is proven ",
                "Also get off the s version of Windows 10 and get Windows 10 home",
                "Free upgrade available w/this laptop in Microsoft App Store",
                "Look at youtube video for easy instructions",
                "Buy a cheap external cd/dvd player burner then get/use old version of MS office cd to install software",
                "I Could NOT GET the \"free 1 yr version preinstalled to work on this PC 😡 as advertised...only a free month of Office Family 365",
                "Once done this PC is fast, light and 5 stars under $315 ready",
                "Product arrived earlier then promised",
                "👍"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good Product, Note One Bad Description",
                "I may have received a newer model or something, but the version I received did not have three full sized USB A ports like depicted in the description",
                "I did have a need for three USB ports for my application, so this was important in me choosing this particular model",
                "Instead, my version has two full sized USB ports and one USB C port",
                "This is a higher speed port, which is why I think the version I received is a newer version, so might be a good thing for most, but in my case, that difference meant I had to buy an additional $9 cable to convert the USB C to USB A",
                "Also, no big deal, but the version I received has the SD card reader on the right side of the unit, not the left side of the unit like depicted in the product description",
                "Otherwise, computer does everything I need it to do at a budget price."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "NOT NEW",
                "THIS IS NOT NEW",
                "I got the computer and it’s asking me to sign in as Ronald ...",
                "using the PIN number",
                "Also the stickers on the computer are flapped back",
                "Not new at all",
                "Pretty pissed tbh."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Ehh",
                "Screen color and clearness isn’t as good as its suppose to be",
                "Kinda disappointed, going to try and return."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Disappointing for HP, Easy to Set Up",
                "Laptop color is nice, smaller than I had expected, easy to set up",
                "However, there are several problems with this laptop",
                "The memory is very small",
                "Especially if you have many videos or files to load",
                "The internet runs very slow, even when connected with WIFI",
                "Overall, the price is right but having bought from HP before this is an inferior product."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "TouchPad is no bueno.",
                "I've had it a few hours now and I've already ordered a mouse to use with it",
                "If I want to click on a link I need to find the teeny tiny sweet spot on the TouchPad that works",
                "After four or five times, it might work",
                "If I don't want to click on a link, breathing, blinking my left eyelid, or mental telepathy seems to open every link on the website",
                "I only need it for writing so I'll make it work."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Beware: the 32 GB storage size claim is incredibly deceptive....",
                "Bought this computer for my teenage daughter thinking it had 32GB storage",
                "Turns out that the the computer's operating systems take up 21+GB of storage, leaving you with only 11GB of actual storage space",
                "That's just ridiculous."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Not impressed",
                "Love hp, but would not recommend windows s",
                "Even when you disable it, you don't completely disable it",
                "4 gigs of ram isn't enough to do much more than check email and run basic apps, especially if you have it connected to a docking station with 2 monitors",
                "Keyboard and mouse",
                "Apparently you can't upgrade ram on this laptop."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "This is not worth the money but for $260.00, I should not has expected more.",
                "Camera is not good quality at all.......Do not waste your money."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Having issues with quality and performance",
                "This product seemed good at first, but now my wife is having nothing but issues with the computer",
                "Mouse pad having issues, poor speed and performance for normal items",
                "Would not buy again."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "A bit slow...",
                "I am happy with my laptop, there are just a couple things",
                "It's NOT touch screen like I thought it was",
                "I upgraded for the extra memory and speed but it's still a bit slow which makes online research frustrating when you're in a hurry",
                "But, it's still a good little laptop so far and worth the money I paid for it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Buy:)",
                "Box damaged from shipping so I was nervous, but laptop is perfect",
                "Pretty pink, light weight and voice set up",
                "So far I’m impressed:)"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Would recommend",
                "Well the Laptop overall is good",
                "Fast, no scratches and works well (At least for right now",
                "Dont know what will happen with continued use...lol)",
                "The mouse is a little sticky though, even after having turned up the sensitivity/speed but it's good still."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Slow",
                "I saw other reviews talking about how slow it is and thoughts to myself that it probably their WiFi connection but, I was very wrong",
                "I have strong WiFi and the computer was still running slow!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Love that this is so lightweight!",
                "This is a great laptop! I would recommend it to anyone",
                "My daughter uses it for school",
                "It is very light weight and works well."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "WOULD NOT RECOMMEND!",
                "Battery life is poor",
                "Computer is excruciatingly slow",
                "I had to remove apps that came on it but that did not help at all",
                "The mouse pad is awful (most times I try to click something it just highlights it)",
                "It came in S mode which was easy to remove",
                "Camera quality is okay if you're not used to having anything better",
                "Mic seems to work good",
                "Design is sleek and beautiful but doesn't negate the many issues",
                "Overall, I WOULD NOT RECOMMEND",
                "I guess you get what you pay for",
                "I was being cheap but next time, I'll invest in something that actually works, especially when bought brand new."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Inexpensive option",
                "I was looking for a laptop for my mother (70's) so we could have video calls and she wouldn't have to be tied to a desk in her \"computer room.\" This laptop works great for that reason",
                "She will also only be using this laptop for checking email and some light surfing of the web",
                "For $200, it is a good value."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop",
                "&nbsp;Perfect size and although there isn't that much space you can get a cheap hard drive for more storage! Which is what I did, and so far if had no issues it only took me a few minutes to fix the storage issue and I never even had a pc before! I recommend for light gaming and school work just make sure you have an external hard drive!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great look computer",
                "Been pretty pleased with this labtop does everything needed for school",
                "My only complain is a lot of the computer memory is taken up by all the installed programs I dont use and cant seem to get rid of."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great, just quiet",
                "We love this laptop, and it's rather user-friendly",
                "One flaw that it has is that the speakers are rather low and weak",
                "We have had to add an external speaker to help boost the volume",
                "Otherwise, we like the computer just fine."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great Laptop / Fast Shipping",
                "I'm speechless about this product for the specs of this laptop the price was great, shipping and packaging was superb, and unboxing and setup was a breeze.",
                "the vibrant colors on the screen and cosmetically it is without a scratch...I gave it a well deserved 5 stars...I will purchase again with ANTOnline"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Keyboard won't work",
                "Keyboard went out"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect",
                "Super nice"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Questionable",
                "&nbsp;It is oly 5 months old and my screen is defective..The Screen just went out and I dont know why..When I try to turn it on the screen pops...This should not happen after 5 months..I just started using it regularly 2 months ago..."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Hp laptop",
                "I bought this laptop for school",
                "It worked well for awhile",
                "I've only had this almost 2 months",
                "I couldn't download Google without it glitching all before I did the update",
                "After the update it started glitching some more",
                "My friend was doing something to it with the Microsoft Word program, she turned it off and wouldn't turn back on unless I plugged it in",
                "I give it one star for delivering in a timely manner and it came in good condition",
                "I absolutely regret this buy",
                "Terrible investment."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "The laptop is affordable",
                "I like the ease in which I can touch the keys to type",
                "I liked the price",
                "I do have a problem in that the screen consistently magnifies",
                "Other than that, it's performance is good",
                "The laptop is lightweight and I'm pleased with the color, which is a deep rose",
                "I was disappointed in that there's no compartment in which I can insert cd's, and I did think that Microsoft 365 was free for a year, and it was free for only a month",
                "It's disappointing that I have to pay a yearly fee for it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great",
                "Works great",
                "Love the color"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "You may not want this one.",
                "This is not a Windows 10 as we all know about it's a Window10S as listed",
                "This means transferring your Windows 10 data will require you to jump through many hoops",
                "I took mine to my specialist who is like a rocket scientist on Red Bull and it took him hours to transfer files."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Affordable and useful",
                "This Laptop has all the features I need to create my poems, keep pictures organized and surf the web, and listen to music",
                "The rose gold is adorable and its light weight to take any where."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice product",
                "It works efficiently",
                "However, it doesn't have much storage space",
                "I have to save files or downloads in the One Drive/Cloud or my external hard drive."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Laptop",
                "This is my 3rd HP laptop, my late husband always bought HP's, so that is really all I know",
                "Our family motto is stick with what you know! This was the easiest laptop to set up &amp; use! I love it!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Disappointed",
                "I loved this laptop, little slow but for most part worked for I needed",
                "Now I can't use for more than 5 min without it completely freezing",
                "Once it freezes there is nothing I can do but power it off",
                "I am extremely disappointed ☹️"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Wrong color...",
                "Thought I was getting a blue laptop, as it was displayed, but the laptop inside the box was black",
                "Other than that, there were no other issues with it."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Bad bad bad",
                "A bad investment, I wasn't working 8 had to return it",
                "Don't buy it."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Important information missing",
                "As of right now we don't have the information we need to register the Microsoft office which was the selling point for us"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great HP laptop computer for school",
                "This is a great laptop for school aged kids",
                "It is not that expensive and does its job",
                "The battery life is amazing!!!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good Lightweight laptop for Lightweight Use",
                "I purchased this laptop for secondary use with a hobby of mine",
                "This unit seems to fit the bill for size, weight, and ease of use",
                "I have not tasked it with any memory-hogging apps",
                "I am very happy with it",
                "I do not know why Amazon is asking me to rate the touchscreen, as this model does not come with one."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Awesome laptop!",
                "Great laptop",
                "It is the perfect size and i love the color",
                "It works awesome and I received it WAY faster than they said",
                "10 days faster."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Perfect, beautiful colour and wonderful performance",
                "It's an amazing little laptop and is beautiful and works wonderfully, so easy to use, I love this little laptop."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Shipping Issues!",
                "It’s being held in “customs” in Anchorage, AK",
                "Why? It came from the U.S",
                "as far as I know",
                "It went to TX and KY with no problem, but now Anchorage is holding it",
                "My son needs this for school so this is very frustrating."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little laptop",
                "I am using this for my side business and other google stuff",
                "Fast and light weight",
                "And it is cute (just sayin)",
                "Buy it!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Too Modern!",
                "Too hard to get used to where to ick or touch or not click or touch! Too \"modern\" for me! :("
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great buy",
                "I love it!! I was worried that it would take awhile to get here after reading someone’s comment but I actually received it a week earlier than the date it advise",
                "Love the cuteness.",
                "can’t wait to get all setup"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Everything I Wanted!",
                "I was nervous about ordering a cheaper laptop from an online service",
                "I read other reviews and got cold feet for a minute",
                "I only need this to publish on my blog",
                "I don’t game or anything crazy that requires lots of storage",
                "The computer started right up, was a breeze to set up and sync to my iPhone, and got down to business",
                "I am very happy with this purchase!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Blue Screen of Death on Day 2 of Ownership",
                "Good looking PC",
                "Too bad that the blue screen of death appeared on the 2nd day of ownership",
                "Now I get deal with HP to return it."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Jerk seller, faulty product",
                "The power button on this was faulty, and I had to pay return shipping to send it back",
                "And now, my kid doesn’t have a laptop for class because everything else in this price range seems to be sold out."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "SHORT LIFE",
                "Had this laptop less than a month and it crashed",
                "Had to send it back for a refund",
                "Support team could do little to help since it would not even turn on",
                "I purchased an HP a couple of months ago, a little more expensive, larger and not from this vendor",
                "Not sure what the problem is with this HP Stream but it's disappointing."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Just no.",
                "Camera is horrible",
                "Looks like it was made in 2010",
                "I ordered a blue one they sent a white one"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Highly recommend",
                "Product comes brand new, which I did not expect",
                "It was easy to set up and very clean",
                "Much worth the money! 10/10."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Beautiful color",
                "Beautiful dusty rose pink, lightweight, and packaged in new and perfectly working condition!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Worked for a week and quit.",
                "This product was not touch screen and within a week it stopped even booting up",
                "Very disappointed in the laptop and sent it back."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great value",
                "Great laptop without breaking the bank ",
                "Includes Office 365 for year ."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Very good.",
                "This laptop is very good, it has a very good battery, a light weight, a good screen, it serves the basics of a student."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good buy!",
                "Easy to set up and use! But it's not a touch screen."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "arrived with middle of keyboard raised (warped)",
                "arrived with keyboard raised (warped)",
                "closing top does not shutoff screen so its always running and draining battery"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Meh.",
                "Battery life isn’t great",
                "Two months in, and it’s having issues booting up",
                "Not terrible for what it is, but probably would not buy again or recommend to someone."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "The best product",
                "I love this computer , I’m a collage student and I had to purchase a new laptop and I saw this one and I bought it ",
                "The Battery life is amazing Really fast laptop A high quality screen A high quality product ",
                "I love it ."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "love",
                "This computer does what I need it to do."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good size with decent power",
                "This is a great laptop",
                "Can handle most standard tasks and programs with ease."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Won't turn on after 2 months",
                "Bought it 5/21/20",
                "Return window closed 6/26/20",
                "Won't turn on 8/1/20."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "pretty color",
                "i love my laptop computer"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "This product does not have a CD player.",
                "I love that this laptop is lightweight",
                "It is so easy to carry around the house which is how I use it",
                "I also love the color of it, that is why I chose it",
                "I did want a CD player but the description does not list it so it is my own fault not the manufacturer's fault."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "screen cracked",
                "Opened box and trhe screen was broken..",
                "could not see anything for about 50% of screen..",
                "cracked all the way through the middle."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Just Right!",
                "Love it so far so good !! Lightweight, pretty blue, easy, fast hope it is a keeper !! It's just want I wanted for home, fun, easy use :) Great packaging"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Not bad",
                "It’s a nice laptop for browsing",
                "However, it’s a little laggy and slow when multitasking"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent",
                "Excellent"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Not perfect",
                "because",
                "of course, it's soooo inexpensive, but you won't beat it for the price."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great",
                "Love it and works great for the price"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great",
                "Great"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great service",
                "Excellent product"
            ],
            "opinions": [
                [],
                []
            ]
        }
    ]
}