{
    "data": [
        {
            "text": [
                "New Purchase = Battery Replacement on Day 1?",
                "Brand New purchase with caution sign for battery to be replaced? How?"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Floppy screen",
                "The laptop works as expected, but the screen is lose",
                "As a result, it can be hard to use because the screen tends to fall",
                "I tried to get it fixed but was told by an authorized Apple repair company that there is no way to tighten it."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good so far",
                "So far everything is great but the mic is super low, I have to have headphones in or use one razor mic just to talk on voice chat otherwise no one can hear me, it know it’s not the programs I’m using so so far all I use is headphones so it doesn’t bug me too much, just sucks a bit is all",
                "Otherwise it’s good battery life speedy, great for just going in social media, watching videos, etc."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Low Battery Life, Can Not Update OS, Flickers",
                "Some kind of hardware issue is leading to the following behaviors: 1) Flickering Screen",
                "2) Battery Life that is below (by far) the projected or advertised 80 percent batter life",
                "3) Can not update the OS due to some kind of hardware issue",
                "Assuming that the first 2 are of a direct consequence from the hardware, within the sellers domain of expertise or purview for maintaining in order."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great price, perfect condition",
                "Excellent deal--the laptop came in perfect condition",
                "It only came with the short charger, and not the full-length cord, but I had the long cord from my previous laptop, so that wasn't a big deal."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice laptop",
                "Really enjoy my laptop although the battery doesn't last as long as I had hoped",
                "Also my charger died right after the 90 day warranty which I feel is poor considering my other MacBook Air laptops' chargers (through my job) that has lasted four+ years",
                "I guess the charger was not new when I received it."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Is not changed",
                "I need to return this computer no good"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great purchase!",
                "Very few, hardly noticeable scratches, wouldn't even notice that it's refurbished",
                "Had to update to newest software, which I expected, but besides that everything so far has gone off without a hitch",
                "Wonderful purchase!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Could have been better.",
                "Had some minor scratches and the screen was dirty."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "I think it’s a new notebook.....",
                "After reading reviews I was apprehensive about getting this “renewed” notebook",
                "I can’t say it’s NOT a refurbished unit, but there is no evidence that it is",
                "Packaging was perfect and the notebook looks factory new",
                "It looks perfect and works perfectly."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Like New",
                "This product Arrived in tip top condition",
                "Honestly it seems brand new no chips or scrapes or anything",
                "The system it self runs very smooth it’s very fast I am really loving it so far."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Exceed expectations",
                "The laptop exceeded our expectations due to it being refurbished",
                "The quality is great",
                "I would recommend the laptop, and I would buy another one",
                "My daughter uses it for nursing school and it handles everything she needs to do."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent computer to have!",
                "My husband bought me this as a birthday gift",
                "I am very pleased with it",
                "The battery life is very long and it is a very fast computer",
                "I love it!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop, so-so refurbished quality",
                "Saving $200-$300 bucks isn't worth it when you can buy new and get the 1 year warranty",
                "The laptop wasn't super clean, and the battery health was so-so",
                "This is a great laptop to buy NEW."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "this is not really refurbished, have issues",
                "this laptop have issues, fan makes loud noise, and now its not starting up, unable to login",
                "I will return this macbook, as this is not really refurbished, have issues - bad product"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Reliable product that gets the job done",
                "Arrived in a timely manner, has worked at a high level and feels new I love it."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Computer is in great condition",
                "One very small ding on the car, but otherwise this computer is in great shape",
                "I had no problem setting it up for my mother to use",
                "Battery life is good, too",
                "It came with a generic power cord, but haven't had an issue with it",
                "Overall, I would recommend using a MacBook Air."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Lovely, solid, lightweight and fast machine",
                "So far, the computer has worked well for my 9th-grader",
                "It's solid and extremely lightweight and persuades to switch to Mac myself, but I hear from trusted reviewers that Microsoft is beating their newer systems in building quality",
                "Lovely machine, this."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Love it!",
                "I've been loving this computer so far! I've only had it for about a month but it came quickly and was in great shape! So far it's running really smooth!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "It was used.",
                "I didn't see, it was used...It has some damage (scratch)...I returned..."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Glitching problem",
                "Everything is great with this computer",
                "Nothing is wrong with it",
                "Until last week (I got this computer on August 28) it had started glitching",
                "I’m not sure what caused it but after I got home which was around 8 hours later, it was fine",
                "This a great computer",
                "If the glitch happens again I will definitely add it to this."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Save your money!",
                "It works the battery life is about 30 minutes, if that",
                "This really sucked for me as a teacher teaching virtually and having my laptop go dead several times through out the day in the middle of class",
                "Save your money people!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "fake",
                "not a real Apple product."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Honest, swift and gracious about retuned item",
                "I had to return a perfectly functional computer due to a problem on MY end",
                "It was a swift, gracious, straightforward process, and I felt I was in good hands with an ethical seller",
                "Noor took me clearly through all the steps",
                "Honesty is so important when buying big ticket item ON the 'Net",
                "I will not hesitate to buy from Tek Galaxy again",
                "I trust them."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Optimizing storage space",
                "It said I was getting a 128 Gb ram it only has 121.12 GB..what’s up with that???? I feel I got ripped off",
                "I needed it for running Logic Pro x I’ve got it installed, but even before then the the notification saying not enough space.",
                "utilize space.",
                "I’ve done as much as I could but now I need to download the updated software,, and cannot",
                "No space..if someone could help me out, it would be appreciated."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Let Aunty buy it.",
                "We are all sold from day one",
                "We’d bought one for our young’s and aunty bought him the same Mac at the same time",
                "We let aunty buy it for him."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Bad air or wifi card",
                "The wifi card stops working and needs replaced"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Practically brand new",
                "Bought this for my husband for school",
                "He was a bit hesitant but we have been extremely pleased with this purchase",
                "We have only had to charge twice thus far and it was in excellent condition when we received it",
                "It is Amazon Certified Refurb which the description does not specify."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Value for you money",
                "Good quality product, easy to set up and in very good cosmetic conditions and very good battery life",
                "Totally worth it to buy it!"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great but renewed",
                "I didn't realize this was renewed--no wonder it was such a great price!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great purchase",
                "Computer arrived quickly and appears lightly used, if not new",
                "Everything working well so far."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Scary and Dangerous",
                "Do NOT purchase from this store",
                "The charger they send my refurbished MacBook with stopped working after two weeks and started sparking",
                "It could have seriously injured me or one of my kids."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Five Stars",
                "Good product , arrive on time"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Thumbs Up 👍",
                "Bought this for my husband for home use",
                "Reluctant at first to purchase a refurbished laptop, but it was exactly what was needed",
                "It arrived in excellent physical condition",
                "All I did was update to the latest operating system",
                "I’m very glad I bought this MacBook Air."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Ok!",
                "Ok!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Description significantly wrong",
                "This was advertised as the newest version",
                "It is definitely not the newest version",
                "I'm returning it for a refund."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Love it!",
                "I got this computer for school after my other one died on me",
                "I got it on time, its reliable, quick and easy to use",
                "I got it in great condition and in the original Apple box!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great!",
                "I really like the condition that my laptop came in",
                "It looks brand new, al the accessories were included and it was easy to set up",
                "I’m very happy with this product."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Charger not working properly",
                "The computer is working good, but the charger isn't working",
                "I decide to buy a new charger instead of return the item since my daughter needed rush",
                "I tried to obtain a new charger from Amazon, but it was not possible."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It’s a lap top",
                "What more do you want.",
                "Really good computer",
                "However, I can’t run adobe editing products on it."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Newest update slowed the laptop down.",
                "Ran slow after updating to Mojave",
                "Will be returning"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Pretty good deal",
                "No complaints so far! Works just as it should and looks new",
                "I wanted this precise model for various work reasons but couldn't spend a ton of money on it, so I'm happy this purchase seems to have worked out",
                "I hope that feeling doesn't change, lol"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Adorable Mac Computer and reliable shipping",
                "Overall, I had a great experience with this purchase",
                "It does come as described, there was no scratches or dents on the laptop",
                "And the laptop will not get left at your house unless it can be signed for! Otherwise easy to get too pick-up location! Thank you!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Apple is the first the last and the best",
                "Always wanted Apple Mac book I feel that they are more secure Better quality than other makes The renewed apple laptops from Amazon enabled me to finally own one as they are available at a reasonable price and look and work like new"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "MacBook Air",
                "Good condition considering used"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Disappointed altogether",
                "I couldn’t get past the set up page",
                "Notebook acting strange",
                "Would not respond to any keys."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "First time user",
                "I like being able to have my phone synced to a device",
                "Its easy for me to navigate and it helps with my writing",
                "Its light to carry around, and easy to use."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "My son loves it",
                "I bought the MacBook after looking online at other stores and seeing how expensive it was",
                "It was refurbished but it works just as if it was brand new",
                "I got for my 13 year for online learning",
                "Its been great",
                "We are satisfied."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Sorry iMac laptop used no good for the price",
                "Computer isn’t working properly has some very visible cracks and scratches it is very slow",
                "Very bad buy"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great buy",
                "Great value for money and very easy to use"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "nothing",
                "everthing"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Nearly perfect",
                "It is a perfect nearly brand new model with a tiny scratch on the top",
                "I love it! I only wish it came with a manual",
                "It’s just the computer and the charger well packaged."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It wink won’t work",
                "It sucks don’t buy"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great Product!",
                "The best money investment I made in recent years"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Accuracy of item description",
                "Item as described"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Try this guys",
                "Very good laptop I really like it"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Pretty good!",
                "Got this for my cousin for her grad and it seems to be working just fine! no scratches or anything."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "The product is good",
                "Battery life is excellent",
                "No scratch or dent Very nice I'm happy with it"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Reliable!!!!!!!!",
                "Psychology, and statistical analysis, and to surf the web, I've never used apple products before, so, we'll see in the long run, thankfully, Thomas Scott Pharr"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great!",
                "Looks and works like brand new!!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Apple 13in MacBook Air",
                "Just as described, looked brand new, and worked great for what it was intended for",
                "Item shipped fast with no issues",
                "Thank you!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great !",
                "there was a little dent near the apple logo but its fine ! however it did not come with original box or charger :( i saw reveiws saying that but it did not come with it for me"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Reconditioned didn't work for me",
                "Screen had several dead pixels",
                "Returned it and bought a new one not reconditioned one."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good and affordable",
                "Few knicks and scratches but it is refurbished",
                "Works like brand new"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great Renewed Laptop",
                "Looks brand new",
                "Works brand new",
                "10/10 recommend"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good condition",
                "In great condition, only thing is there was a small dent on the top where the apple symbol is, otherwise works great."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "excellent!!!",
                "like a new....."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Slow Shipping",
                "Shipping took longer than expected but the computer finally arrived today and so far I have found no problems with it but will review again if I find any."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "It’s good! Just had a minor hiccup",
                "I’ll just say that the laptop was still logged in so I had to go to an Apple store and hard reset it",
                "Soooo..",
                "maybe check the products..?"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "speeeeeeed!",
                "Some apps are a bit laggy, but it doesn't freeze up nearly as much as a PC."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Tutorial was defective",
                "The computer tutorial doesn’t work."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "just like everyone said I would",
                "I am loving it over my old slow PC, just like everyone said I would."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Beware",
                "Three months of use this happens!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Expected better",
                "The up arrow key was broken."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "LOOKS BRAND NEW! I love it!",
                "The Laptop looks brand new! I love it so far."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "great stuff",
                "clean and works well."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "must buy",
                "really great product !"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Met all my expectations",
                "Like new condition."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Purchase it",
                "All I have to say is purchase!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Exactly as advertised",
                "Like new!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Yep",
                "Worth the money 100%"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "YES",
                "YES"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "NOT the newest version.",
                "Wrongly says it is the newest version - it is not",
                "Newest version start with MV...",
                "model number for 2019."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Another great Mac",
                "This is the most recent of a series of Mac ;laptops I have had and it continues the usefulness of the previous ones",
                "The new keyboard is a HUGE step up."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Apple is doing everything it can to prevent me from setting up Google search.",
                "At the moment Apple and Google are at odds, so I have stopped trying to set the new Mac for now."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "no hay problemas hasta ahora se ve bien",
                "una muy buena computadora gracias Jemjem"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Product quality",
                "Love this MacBook, so far no issues *crosses fingers*"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Quick Delivery great condition",
                "Gavenit as a gift very satisfied of the product"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Compter not working.",
                "It did not work",
                "Returned for refund."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Low Space",
                "I purchased this because my son needed my laptop",
                "At first, I thought it was great",
                "All I really did was search the web and visit sites",
                "It's fast and nice for that",
                "Once I downloaded my Silhouette Studio program, I have trouble now doing anything due to low disc space",
                "This is pretty upsetting since this is the only program I have downloaded",
                "I don't stream Netflix or anything like that",
                "I didn't realize how bad it was until months later now that I need to work on projects with this software",
                "I don't recommend using this for a cricut or silhouette."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good laptop but little storage room",
                "I purchased this computer purposely for school and web surfing",
                "The computer has nice looking features and it hasn’t given me any problems",
                "However, I would not recommend it for anything other than web surfing, reading articles, doing research and typing up documents",
                "This computer has very little storage room",
                "I am unable to save all of my school related documents due to this issue",
                "Other than that, it’s great",
                "Also, you’ll have to get a mouse",
                "Using the finger touch mouse on the lap top can get annoying."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "simple and fast laptop!!!",
                "this laptop is amazing!! it's already charged and ready to use",
                "all software is already programed into it so there is no need to download anything",
                "it already has some pre installed apps like Netflix! really happy with this laptop!!"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Do not purchase",
                "I bought this laptop for my daughter to use for school",
                "She is ten",
                "We received it and almost immediately, it stopped charging",
                "I thought, no big deal, it's probably a defective charger",
                "I bought a new charger",
                "Same thing",
                "So I contacted HP Support",
                "They fixed the computer and sent it back to me",
                "However, they reinstalled Windows 10, which deleted my one year free trial of Microsoft Office",
                "I contacted them about this and they said that I would just have to download the one month free trial or purchase it for $69.99",
                "I specifically purchased this laptop for the one year free trial and HP refuses to fix the problem that is THEIR fault",
                "If it hadn't been for a faulty laptop in the first place, it wouldn't have needed to have Windows reinstalled",
                "I will never again purchase an HP product",
                "Buyer, beware!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Can not find good apps on App Store.",
                "I really wanted to love this laptop but I am a bit disappointed",
                "It’s great quality for such a low price",
                "However, all of the apps I want to download, such as Facebook I can not find on the App Store."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great investment!",
                "One of the best investments I’ve made",
                "Perfect condition",
                "Rose Gold is flawless",
                "Great quality!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Best computer on amazon you can find!!!",
                "Honestly if you wanna computer for school with the basic needs this computer is for you",
                "I don’t get how people complain about the storage but honestly you can buy the SD card and put it in your computer and you can have more storage at the beginning I was debating Whether to buy it but I ended up buying it and it works amazing and it looks fabulous on my desk",
                "love the color couldn’t ask for more ",
                "The way they pack the computer to ship it to you is well done.I’m really happy with my purchase :)"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Amazing investment",
                "Brand new and super quick to set up! Definitely got my money's worth too!"
            ],
            "opinions": [
                [],
                []
            ]
        }
    ]
}