{
    "data": [
        {
            "text": [
                "Excellent item",
                "My daughter loves her new laptop",
                "Perfect for her online schooling"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little laptop",
                "Great product, does everything I need.."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop",
                "This is my second laptop for both children as it’s been great value, reliable and does everything I’d want from a laptop",
                "Recommended."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Worth the money",
                "It’s a great little laptop good battery life"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good basic laptop",
                "Needed a cheapish laptop for browsing the web and this one seemed to have had good reviews",
                "So far I have been pleased with it",
                "The screen is bright and crisp and seems perfect for browsing."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Sleek design and robust piece of tech",
                "Sleek design and robust build",
                "So far, so great",
                "No issues and works seamlessly",
                "I was initially reluctant to purchase from a non-high street brand, but it seems like a great piece of tech."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "It's OK for me manly for everyone",
                "Its neat its compact it does Everythink I needed to do"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "slow",
                "it just does the job ,but quiet slow.i exspected it to be a lot faster"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Amazing!",
                "Amazing laptop and very easy to set up - this is the 2nd one I’ve bought due to homeschooling",
                "Both of my children can use them with ease",
                "Would definitely recommend."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "good buy",
                "easy set up, lightweight and a useful add to my collection"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Fantastic bargain.",
                "Really good piece of equipment for the price",
                "Good screen and sound quality and does everything that is needed",
                "Looks a lot more expensive and good specs",
                "Very pleased with it so far."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Value for Money",
                "I wanted a reasonably priced laptop mainly for shopping on line and zooming",
                "This fits the bill perfectly - very very pleased with it",
                "Thank you"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Awful laptop and company",
                "I have had nothing but problems with this laptop since it arrived",
                "The touch pad is now not working and my son has only been using it since Christmas a week ago",
                "Terrible laptop and the company do not reply to emails so no hope of having a return or refund",
                "Don’t buy."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent",
                "Excellent laytop for home schooling."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Decent",
                "A great bit of kit for the price"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Happy with product",
                "Great laptop easy to use"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great budget laptop",
                "I bought this laptop for university work",
                "It is lightweight, boots up quickly and is easy to set up",
                "The 1 years office subscription is a huge advantage too",
                "In comparison to my daughter's HP its is a lot quicker and easier to navigate",
                "Highly recommended"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Okay for a cheaper laptop, very glitchy.",
                "Overall, an okay purchase",
                "It is very glitchy, often ‘crashes’ and there is something wrong with the keys",
                "But it was very cheap for a laptop so can’t complain",
                "Wouldn’t buy again - would pay the extra for a more reliable one."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great value laptop",
                "Really pleased with this product",
                "Fast connection, easy to set up, good size memory",
                "Very good value laptop",
                "Bought for my daughter at university who is very pleased with it."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great value",
                "Great value and laptop number 3 for the family",
                "Excellent value and great performance at the price",
                "Recommended."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good for the money.",
                "It is very portable and smart"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Smallish but functional !",
                "Great little laptop ! Speedy for an entry level processor and impressive screen display ! Great value as well ! A1 !"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Waste of money",
                "Only switched on twice second time the updates took 90 minutes to do was advised to factory reset by customer service then it wouldn’t even let me select windows 10 as operating system",
                "Very poor and refund will be applied would give 0 star if it was an option"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop for students",
                "Bought this for my son to use for uni work, he's found it easy to set up and use, fast, plenty of memory for his needs",
                "It had decent specs for a great price, we're very happy with it."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Bad quality",
                "Not good at all"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Get what you pay for!",
                "Only purchased as a back-up",
                "Camera and speaker are poor and it is very slow."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "very disappointed.",
                "The laptop got really hot when charging and it had a fan underneath",
                "it was so hot I had to turn it off",
                "Also very slow"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptop",
                "Very happy, perfect for what i need it for which is games and surfing the Internet."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Not as advertised",
                "Only got 1 month office free.",
                "This PC is suposed to gave 12 months office included with it",
                "I only got 1 month",
                "I have emailed the company using the address that came with it but no reply",
                "Not impressed with them",
                "As for the PC you get what you pay for upto now no complaints."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Recommended",
                "Happy with purchase, for the price it is good quality",
                "It is fast so far and the metal casing is robust",
                "The screen is very nice and difficult to smudge",
                "I really like the keyboard as it is more responsive than a MacBook which I would say is very similar."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little laptop",
                "I purchased this laptop for my Grandson's birthday after he read all the reviews He is really happy with it",
                "He loves the design - really solid yet too heavy",
                "Best birthday present ever he says! Thanks Jumper"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent",
                "Excellent"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Start up dosnt not always work",
                "Sometimes does not start up properly then has to be shut down and restarted numerous times but unfortunately I could not send it back as I current live in Spain and have taken it there with me and due to brexit it is very difficult to return items !"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Quite impressed so far",
                "This wee laptop seems great so far",
                "Looks nice, has worked quickly",
                "Didn’t think I would like the silicone keyboard protector, but it turns out I’m a fan! Just remains to see how this little machine holds up to the test of time..."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "perfect for light users",
                "i don't really understand everything inside this laptop but it is perfect for me and i couldn't be happier with my purchase and the price."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "didnt work after windows 10 update",
                "worked lovely for first day until all windows 10 lupdates installed, then totally dead wouldnt do anything, has been returned and refunded"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Not heavy",
                "This laptop is quite light and the size is perfect",
                "Looking forward to using it."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Light weight good screen quality tidy little laptop",
                "Light weight nice size will be perfect for my son for homework and few games be a good Christmas present for him days are earlier but so far impressed"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Superb",
                "Honesty, don’t hesitate to buy this laptop",
                "It is great and such value for money",
                "The seller has the best customer service available",
                "Top notch all round!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good product",
                "Good product"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Superb",
                "Superb ."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great product",
                "I bought one 3weeks ago for my younger son, my older one found it very good and asked me to get one for him",
                "I did and got it very fast",
                "It a great product and value for money."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great size and weight",
                "Great item well packaged, easy set up love the gel cover for the keyboard"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "What's not to like",
                "Loving this great little lap top",
                "It does enough very quickly."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Works fast!",
                "The laptop is amazing and is perfect for students who want a laptop for school work",
                "It works amazingly and the battery life is great too",
                "The aesthetic of the laptop is also amazing and i would definitely reccomend to buy it :)"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Present",
                "Bought as a present"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Disappointing",
                "The laptop seems great for the price but can't use it for what I bought it for as the Microsoft Office product key is missing",
                "We-ve been waiting 2 weeks for someone to get back to us regarding this, extremely frustrating."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Out of my expectation",
                "Worthy!",
                "The price of this computer is reasonable so I didn’t expect it has a good speed and operating function",
                "I can even run video editing software",
                "I think it is similar with normal window computers but much cheaper price! Highly Recommend!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good value entry level laptop",
                "Good value laptop and simple set up",
                "Speed ok for general web browsing"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Brilliant lap top computer",
                "Excellent specs at £249",
                "Very light and intuitive to use",
                "It could do with a longer charging cable though",
                "Brilliant",
                "Excellent value for money Windows 10 laptop to complement my Acer Google Chrome Book laptop which cost me £180 in Lidl."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent value for money",
                "Excellent laptop for my everyday use",
                "Don't download films or a lot of stuff so I can't say what it would be like for high volume use."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Microsoft con.",
                "BIG CON on free year of Microsoft 365 .I had to buy it ",
                "Product support help did not help"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Get one",
                "Great laptop for price very fast for every day use well made it is not for gaming l will buy again"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent Spec Laptop.",
                "Was looking for a cheap good spec laptop for surfing the net and online shopping",
                "This laptop way fulfilled my needs",
                "Battery life is really good and fast ! A bargain for the price."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Ok; basic; get what you pay for",
                "Ok for a basic laptop at this price, but painfully slow (and that’s compared to my very old one!)"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Looking good so far",
                "Looks good, works well",
                "However instruction booklet contains ridiculously small writing and is not well written",
                "Also not clear how to activate the 1-year free Microsoft subscription loaded on to it"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "faulty",
                "i must have received a laptop that slipped through quality control as when it arrived, depsite charging it for hours, it wouldnt turn on",
                "how ever i had no fuss with the return / refund"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "No Microsoft 365 subscription",
                "Lightweight and easy set up, advertised as one year free Microsoft 365 subscription but that appears to not be true which is frustrating and an additional cost"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "High quality great value laptop",
                "Great value laptop",
                "Easy to set up and use",
                "Screen is also great",
                "High quality item and perfect for working from home."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice laptop",
                "Nice neat compact laptop"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Doesn’t work",
                "Faulty, not “new” I tried booting it up several times, It says it’s booting up but then the screen just goes blank, luckily I opened it as soon as I got it because I was going to gift it without opening it"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Easy to Use.",
                "Love my new laptop",
                "Arrived today and I found it really easy to set up and use",
                "Perfect for using for online classes and with a very good battery life."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "I brought it, it arrived, it works.",
                "This is the greatest laptop I have ever purchased, it's the only laptop I have ever purchased however it works and it's never not worked",
                "So if you want to buy a laptop that works, buy this one."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Brilliant for coursework",
                "Lovely and slick perfect for uni work and light use."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great so far",
                "Arrived quickly, pleased so far"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great wee laptop",
                "Great laptop, does what I need it to do, really light and came with a keyboard protector, really happy with purchase."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "does the job",
                "nice"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Bloody good value!",
                "Well worth the money",
                "Great display, fast, precise, clean lines and easy to use",
                "Fulfils all I wanted it for",
                "Well done China."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Easy set up",
                "So far excellent",
                "Easy set up and fast delivery",
                "Looks smart and is very lightweight",
                "Excellent product support too in order to set up extended warranty."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Nice size",
                "Good size",
                "Wasn’t sure if it had a camera but it does",
                "Good price"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Value for money",
                "Great piece of kit good value for the price",
                "I have to admit I was sceptical after reading some of the reviews but my scepticism was unfounded, would be tempted to buy again"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Best buy",
                "Perfect buy and works well!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Good, lightweight laptop.",
                "Good, lightweight laptop",
                "Speed and display quality just what I need (use it for work and some streaming)",
                "Excellent value for money."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Brilliant",
                "Bought for my 16yr daughter",
                "Brilliant product easy to use and set up",
                "The year microsoft 365 will come in handy for her too."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great For Students!!",
                "Package came quick and it was not damaged",
                "I really love how it looks",
                "Its so sleek and lightweight",
                "It comes with a cover for the keyboard which is a bonus",
                "Great product for a student like me."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Cheap is not always the best option",
                "This was purchased for my son to use for his education",
                "Lasted one week, powered down would not charge",
                "Returned for a full refund."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "A great laptop",
                "Really pleased with this laptop which is slick lightweight and very good especially for the price",
                "I am very happy with this laptop",
                "Easy to set up as well",
                "Thank you!"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Best budget laptop",
                "Perfect little laptop, my fiance loves it, the year sub to Microsoft is really helpful"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Charger broken",
                "The charger has stopped working and it wont charge up."
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Perfectly matched",
                "Very portable Laptop",
                "Initially wasn't happy with the size but I've come to fall in love with it perfectly",
                "Great screen design"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great little laptop",
                "Great little computer",
                "Would recommend this",
                "I had to buy the additional Microsoft Office to get all of the features, but still a bargain."
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Fantastic",
                "Quality product at a real competitive price",
                "So pleased so far",
                "I don’t game so can’t comment on that"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Good little laptop",
                "Nice little laptop for casual day to day usage",
                "Worth the buy if you want to work from home."
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great for general office",
                "Can't argue at this price",
                "We purchase a laptop for each new venue we set up (for managers to complete paperwork) and this is ideal",
                "Will definitely buy again",
                "Thank you"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "value for money",
                "good little laptop does what i want it to do battery life about average say 4 hrs but would like more other than that no complaints"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Don’t waste your money!",
                "My laptop is already failing to charge the cable is flimsy and rubbish have had to pay out for new one hoping this is all that is wrong ! Only 8 weeks old!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great laptip",
                "I think it is great value for money and has great screen quality"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Sleek and convenient",
                "Really nice sleek laptop",
                "Lightweight and handily sized",
                "Does exactly what I need it to",
                "No bells and whistles",
                "Efficient and effective and great value"
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Happy",
                "Happy so far, easy to set up",
                "Will be great for work and for home learning for my children",
                ":)"
            ],
            "opinions": [
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "i would buy again",
                "i find it great i did not give any stars for gaming as i have not played any games",
                "but its a lovely little lap top"
            ],
            "opinions": [
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Item returned and full refund granted.",
                "Item bought in December 2020",
                "Managed to go through the initial set up fine",
                "On logging on afterwards the screen was blank",
                "Nothing at all."
            ],
            "opinions": [
                [],
                [],
                [],
                [],
                []
            ]
        },
        {
            "text": [
                "Great value and does what it needs to",
                "So far so good! Bought for kids’ homework and homeschooling when isolating during Covid and it’s serving us really well! Very impressed for the price!!"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great product",
                "Work and personal"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Great value for the price",
                "Looks nice,slim,and light.only just took it out the box once battery charged will be able to give 2and review"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Excellent value",
                "Perfect for what I need it for"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Exactly what I’m looking for",
                "Exactly what I’m looking for helps with work and gaming"
            ],
            "opinions": [
                [],
                []
            ]
        },
        {
            "text": [
                "Bought again for my son",
                "Great"
            ],
            "opinions": [
                [],
                []
            ]
        }
    ]
}